var provinces = {
  "11": {
    code: "110000",
    text: "北京市"
  },
  "12": {
    code: "120000",
    text: "天津市"
  },
  "13": {
    code: "130000",
    text: "河北省"
  },
  "14": {
    code: "140000",
    text: "山西省"
  },
  "15": {
    code: "150000",
    text: "内蒙古自治区"
  },
  "21": {
    code: "210000",
    text: "辽宁省"
  },
  "22": {
    code: "220000",
    text: "吉林省"
  },
  "23": {
    code: "230000",
    text: "黑龙江省"
  },
  "31": {
    code: "310000",
    text: "上海市"
  },
  "32": {
    code: "320000",
    text: "江苏省"
  },
  "33": {
    code: "330000",
    text: "浙江省"
  },
  "34": {
    code: "340000",
    text: "安徽省"
  },
  "35": {
    code: "350000",
    text: "福建省"
  },
  "36": {
    code: "360000",
    text: "江西省"
  },
  "37": {
    code: "370000",
    text: "山东省"
  },
  "41": {
    code: "410000",
    text: "河南省"
  },
  "42": {
    code: "420000",
    text: "湖北省"
  },
  "43": {
    code: "430000",
    text: "湖南省"
  },
  "44": {
    code: "440000",
    text: "广东省"
  },
  "45": {
    code: "450000",
    text: "广西壮族自治区"
  },
  "46": {
    code: "460000",
    text: "海南省"
  },
  "50": {
    code: "500000",
    text: "重庆市"
  },
  "51": {
    code: "510000",
    text: "四川省"
  },
  "52": {
    code: "520000",
    text: "贵州省"
  },
  "53": {
    code: "530000",
    text: "云南省"
  },
  "54": {
    code: "540000",
    text: "西藏自治区"
  },
  "61": {
    code: "610000",
    text: "陕西省"
  },
  "62": {
    code: "620000",
    text: "甘肃省"
  },
  "63": {
    code: "630000",
    text: "青海省"
  },
  "64": {
    code: "640000",
    text: "宁夏回族自治区"
  },
  "65": {
    code: "650000",
    text: "新疆维吾尔自治区"
  },
  "71": {
    code: "710000",
    text: "台湾省"
  },
  "81": {
    code: "810000",
    text: "香港特别行政区"
  },
  "82": {
    code: "820000",
    text: "澳门特别行政区"
  }
}
var citys = {
  //北京
  "1101": {
    code: "110100",
    text: "市辖区"
  },
  "1102": {
    code: "110200",
    text: "县"
  },
  //天津
  "1201": {
    code: "120100",
    text: "市辖区"
  },
  "1202": {
    code: "120200",
    text: "县"
  },
  //河北
  "1301": {
    code: "130100",
    text: "石家庄市"
  },
  "1302": {
    code: "130200",
    text: "唐山市"
  },
  "1303": {
    code: "130300",
    text: "秦皇岛市"
  },
  "1304": {
    code: "130400",
    text: "邯郸市"
  },
  "1305": {
    code: "130500",
    text: "邢台市"
  },
  "1306": {
    code: "130600",
    text: "保定市"
  },
  "1307": {
    code: "130700",
    text: "张家口市"
  },
  "1308": {
    code: "130800",
    text: "承德市"
  },
  "1309": {
    code: "130900",
    text: "沧州市"
  },
  "1310": {
    code: "131000",
    text: "廊坊市"
  },
  "1311": {
    code: "131100",
    text: "衡水市"
  },
  "1390": {
    code: "139000",
    text: "省直辖县级行政区划"
  },
  //山西
  "1401": {
    code: "140100",
    text: "太原市"
  },
  "1402": {
    code: "140200",
    text: "大同市"
  },
  "1403": {
    code: "140300",
    text: "阳泉市"
  },
  "1404": {
    code: "140400",
    text: "长治市"
  },
  "1405": {
    code: "140500",
    text: "晋城市"
  },
  "1406": {
    code: "140600",
    text: "朔州市"
  },
  "1407": {
    code: "140700",
    text: "晋中市"
  },
  "1408": {
    code: "140800",
    text: "运城市"
  },
  "1409": {
    code: "140900",
    text: "忻州市"
  },
  "1410": {
    code: "141000",
    text: "临汾市"
  },
  "1411": {
    code: "141100",
    text: "吕梁市"
  },
  //内蒙古
  "1501": {
    code: "150100",
    text: "呼和浩特市"
  },
  "1502": {
    code: "150200",
    text: "包头市"
  },
  "1503": {
    code: "150300",
    text: "乌海市"
  },
  "1504": {
    code: "150400",
    text: "赤峰市"
  },
  "1505": {
    code: "150500",
    text: "通辽市"
  },
  "1506": {
    code: "150600",
    text: "鄂尔多斯市"
  },
  "1507": {
    code: "150700",
    text: "呼伦贝尔市"
  },
  "1508": {
    code: "150800",
    text: "巴彦淖尔市"
  },
  "1509": {
    code: "150900",
    text: "乌兰察布市"
  },
  "1521": {
    code: "152100",
    text: "呼伦贝尔盟"
  },
  "1522": {
    code: "152200",
    text: "兴安盟"
  },
  "1523": {
    code: "152300",
    text: "哲里木盟"
  },
  "1525": {
    code: "152500",
    text: "锡林郭勒盟"
  },
  "1526": {
    code: "152600",
    text: "乌兰察布盟"
  },
  "1527": {
    code: "152700",
    text: "伊克昭盟"
  },
  "1528": {
    code: "152800",
    text: "巴彦淖尔盟"
  },
  "1529": {
    code: "152900",
    text: "阿拉善盟"
  },
  //辽宁
  "2101": {
    code: "210100",
    text: "沈阳市"
  },
  "2102": {
    code: "210200",
    text: "大连市"
  },
  "2103": {
    code: "210300",
    text: "鞍山市"
  },
  "2104": {
    code: "210400",
    text: "抚顺市"
  },
  "2105": {
    code: "210500",
    text: "本溪市"
  },
  "2106": {
    code: "210600",
    text: "丹东市"
  },
  "2107": {
    code: "210700",
    text: "锦州市"
  },
  "2108": {
    code: "210800",
    text: "营口市"
  },
  "2109": {
    code: "210900",
    text: "阜新市"
  },
  "2110": {
    code: "211000",
    text: "辽阳市"
  },
  "2111": {
    code: "211100",
    text: "盘锦市"
  },
  "2112": {
    code: "211200",
    text: "铁岭市"
  },
  "2113": {
    code: "211300",
    text: "朝阳市"
  },
  "2114": {
    code: "211400",
    text: "葫芦岛市"
  },
  //吉林
  "2201": {
    code: "220100",
    text: "长春市"
  },
  "2202": {
    code: "220200",
    text: "吉林市"
  },
  "2203": {
    code: "220300",
    text: "四平市"
  },
  "2204": {
    code: "220400",
    text: "辽源市"
  },
  "2205": {
    code: "220500",
    text: "通化市"
  },
  "2206": {
    code: "220600",
    text: "白山市"
  },
  "2207": {
    code: "220700",
    text: "松原市"
  },
  "2208": {
    code: "220800",
    text: "白城市"
  },
  "2221": {
    code: "222100",
    text: "怀德县"
  },
  "2222": {
    code: "222200",
    text: "海龙县"
  },
  "2223": {
    code: "222300",
    text: "白城地区"
  },
  "2224": {
    code: "222400",
    text: "延边朝鲜族自治州"
  },
  //黑龙江
  "2301": {
    code: "230100",
    text: "哈尔滨市"
  },
  "2302": {
    code: "230200",
    text: "齐齐哈尔市"
  },
  "2303": {
    code: "230300",
    text: "鸡西市"
  },
  "2304": {
    code: "230400",
    text: "鹤岗市"
  },
  "2305": {
    code: "230500",
    text: "双鸭山市"
  },
  "2306": {
    code: "230600",
    text: "大庆市"
  },
  "2307": {
    code: "230700",
    text: "伊春市"
  },
  "2308": {
    code: "230800",
    text: "佳木斯市"
  },
  "2309": {
    code: "230900",
    text: "七台河市"
  },
  "2310": {
    code: "231000",
    text: "牡丹江市"
  },
  "2311": {
    code: "231100",
    text: "黑河市"
  },
  "2312": {
    code: "231200",
    text: "绥化市"
  },
  "2321": {
    code: "232100",
    text: "松花江地区"
  },
  "2323": {
    code: "232300",
    text: "绥化地区"
  },
  "2324": {
    code: "232400",
    text: "佳木斯地区"
  },
  "2325": {
    code: "232500",
    text: "牡丹江地区"
  },
  "2326": {
    code: "232600",
    text: "黑河地区"
  },
  "2327": {
    code: "232700",
    text: "大兴安岭地区"
  },
  //上海
  "3101": {
    code: "310100",
    text: "市辖区"
  },
  "3102": {
    code: "310200",
    text: "县"
  },
  //江苏
  "3201": {
    code: "320100",
    text: "南京市"
  },
  "3202": {
    code: "320200",
    text: "无锡市"
  },
  "3203": {
    code: "320300",
    text: "徐州市"
  },
  "3204": {
    code: "320400",
    text: "常州市"
  },
  "3205": {
    code: "320500",
    text: "苏州市"
  },
  "3206": {
    code: "320600",
    text: "南通市"
  },
  "3207": {
    code: "320700",
    text: "连云港市"
  },
  "3208": {
    code: "320800",
    text: "淮安市"
  },
  "3209": {
    code: "320900",
    text: "盐城市"
  },
  "3210": {
    code: "321000",
    text: "扬州市"
  },
  "3211": {
    code: "321100",
    text: "镇江市"
  },
  "3212": {
    code: "321200",
    text: "泰州市"
  },
  "3213": {
    code: "321300",
    text: "宿迁市"
  },
  //浙江
  "3301": {
    code: "330100",
    text: "杭州市"
  },
  "3302": {
    code: "330200",
    text: "宁波市"
  },
  "3303": {
    code: "330300",
    text: "温州市"
  },
  "3304": {
    code: "330400",
    text: "嘉兴市"
  },
  "3305": {
    code: "330500",
    text: "湖州市"
  },
  "3306": {
    code: "330600",
    text: "绍兴市"
  },
  "3307": {
    code: "330700",
    text: "金华市"
  },
  "3308": {
    code: "330800",
    text: "衢州市"
  },
  "3309": {
    code: "330900",
    text: "舟山市"
  },
  "3310": {
    code: "331000",
    text: "台州市"
  },
  "3311": {
    code: "331100",
    text: "丽水市"
  },
  //安徽
  "3401": {
    code: "340100",
    text: "合肥市"
  },
  "3402": {
    code: "340200",
    text: "芜湖市"
  },
  "3403": {
    code: "340300",
    text: "蚌埠市"
  },
  "3404": {
    code: "340400",
    text: "淮南市"
  },
  "3405": {
    code: "340500",
    text: "马鞍山市"
  },
  "3406": {
    code: "340600",
    text: "淮北市"
  },
  "3407": {
    code: "340700",
    text: "铜陵市"
  },
  "3408": {
    code: "340800",
    text: "安庆市"
  },
  "3410": {
    code: "341000",
    text: "黄山市"
  },
  "3411": {
    code: "341100",
    text: "滁州市"
  },
  "3412": {
    code: "341200",
    text: "阜阳市"
  },
  "3413": {
    code: "341300",
    text: "宿州市"
  },
  "3414": {
    code: "341400",
    text: "巢湖市"
  },
  "3415": {
    code: "341500",
    text: "六安市"
  },
  "3416": {
    code: "341600",
    text: "亳州市"
  },
  "3417": {
    code: "341700",
    text: "池州市"
  },
  "3418": {
    code: "341800",
    text: "宣城市"
  },
  //福建
  "3501": {
    code: "350100",
    text: "福州市"
  },
  "3502": {
    code: "350200",
    text: "厦门市"
  },
  "3503": {
    code: "350300",
    text: "莆田市"
  },
  "3504": {
    code: "350400",
    text: "三明市"
  },
  "3505": {
    code: "350500",
    text: "泉州市"
  },
  "3506": {
    code: "350600",
    text: "漳州市"
  },
  "3507": {
    code: "350700",
    text: "南平市"
  },
  "3508": {
    code: "350800",
    text: "龙岩市"
  },
  "3509": {
    code: "350900",
    text: "宁德市"
  },
  //江西
  "3601": {
    code: "360100",
    text: "南昌市"
  },
  "3602": {
    code: "360200",
    text: "景德镇市"
  },
  "3603": {
    code: "360300",
    text: "萍乡市"
  },
  "3604": {
    code: "360400",
    text: "九江市"
  },
  "3605": {
    code: "360500",
    text: "新余市"
  },
  "3606": {
    code: "360600",
    text: "鹰潭市"
  },
  "3607": {
    code: "360700",
    text: "赣州市"
  },
  "3608": {
    code: "360800",
    text: "吉安市"
  },
  "3609": {
    code: "360900",
    text: "宜春市"
  },
  "3610": {
    code: "361000",
    text: "抚州市"
  },
  "3611": {
    code: "361100",
    text: "上饶市"
  },
  //山东
  "3701": {
    code: "370100",
    text: "济南市"
  },
  "3702": {
    code: "370200",
    text: "青岛市"
  },
  "3703": {
    code: "370300",
    text: "淄博市"
  },
  "3704": {
    code: "370400",
    text: "枣庄市"
  },
  "3705": {
    code: "370500",
    text: "东营市"
  },
  "3706": {
    code: "370600",
    text: "烟台市"
  },
  "3707": {
    code: "370700",
    text: "潍坊市"
  },
  "3708": {
    code: "370800",
    text: "济宁市"
  },
  "3709": {
    code: "370900",
    text: "泰安市"
  },
  "3710": {
    code: "371000",
    text: "威海市"
  },
  "3711": {
    code: "371100",
    text: "日照市"
  },
  "3712": {
    code: "371200",
    text: "莱芜市"
  },
  "3713": {
    code: "371300",
    text: "临沂市"
  },
  "3714": {
    code: "371400",
    text: "德州市"
  },
  "3715": {
    code: "371500",
    text: "聊城市"
  },
  "3716": {
    code: "371600",
    text: "滨州市"
  },
  "3717": {
    code: "371700",
    text: "菏泽市"
  },
  //河南
  "4101": {
    code: "410100",
    text: "郑州市"
  },
  "4102": {
    code: "410200",
    text: "开封市"
  },
  "4103": {
    code: "410300",
    text: "洛阳市"
  },
  "4104": {
    code: "410400",
    text: "平顶山市"
  },
  "4105": {
    code: "410500",
    text: "安阳市"
  },
  "4106": {
    code: "410600",
    text: "鹤壁市"
  },
  "4107": {
    code: "410700",
    text: "新乡市"
  },
  "4108": {
    code: "410800",
    text: "焦作市"
  },
  "4109": {
    code: "410900",
    text: "濮阳市"
  },
  "4110": {
    code: "411000",
    text: "许昌市"
  },
  "4111": {
    code: "411100",
    text: "漯河市"
  },
  "4112": {
    code: "411200",
    text: "三门峡市"
  },
  "4113": {
    code: "411300",
    text: "南阳市"
  },
  "4114": {
    code: "411400",
    text: "商丘市"
  },
  "4115": {
    code: "411500",
    text: "信阳市"
  },
  "4116": {
    code: "411600",
    text: "周口市"
  },
  "4117": {
    code: "411700",
    text: "驻马店市"
  },
  "4190": {
    code: "419000",
    text: "省直辖县级行政区划"
  },
  //湖北
  "4201": {
    code: "420100",
    text: "武汉市"
  },
  "4202": {
    code: "420200",
    text: "黄石市"
  },
  "4203": {
    code: "420300",
    text: "十堰市"
  },
  "4204": {
    code: "420400",
    text: "沙市"
  },
  "4205": {
    code: "420500",
    text: "宜昌市"
  },
  "4206": {
    code: "420600",
    text: "襄阳市"
  },
  "4207": {
    code: "420700",
    text: "鄂州市"
  },
  "4208": {
    code: "420800",
    text: "荆门市"
  },
  "4209": {
    code: "420900",
    text: "孝感市"
  },
  "4210": {
    code: "421000",
    text: "荆州市"
  },
  "4211": {
    code: "421100",
    text: "黄冈市"
  },
  "4212": {
    code: "421200",
    text: "咸宁市"
  },
  "4213": {
    code: "421300",
    text: "随州市"
  },
  "4221": {
    code: "422100",
    text: "黄冈地区"
  },
  "4222": {
    code: "422200",
    text: "孝感地区"
  },
  "4223": {
    code: "422300",
    text: "咸宁地区"
  },
  "4224": {
    code: "422400",
    text: "荆州地区"
  },
  "4225": {
    code: "422500",
    text: "随州地区"
  },
  "4226": {
    code: "422600",
    text: "郧阳地区"
  },
  "4227": {
    code: "422700",
    text: "宜昌地区"
  },
  "4228": {
    code: "422800",
    text: "恩施土家族苗族自治州"
  },
  "4229": {
    code: "422900",
    text: "省直辖行政单位"
  },
  "4290": {
    code: "429000",
    text: "省直辖县级行政区划"
  },
  //湖南
  "4301": {
    code: "430100",
    text: "长沙市"
  },
  "4302": {
    code: "430200",
    text: "株洲市"
  },
  "4303": {
    code: "430300",
    text: "湘潭市"
  },
  "4304": {
    code: "430400",
    text: "衡阳市"
  },
  "4305": {
    code: "430500",
    text: "邵阳市"
  },
  "4306": {
    code: "430600",
    text: "岳阳市"
  },
  "4307": {
    code: "430700",
    text: "常德市"
  },
  "4308": {
    code: "430800",
    text: "张家界市"
  },
  "4309": {
    code: "430900",
    text: "益阳市"
  },
  "4310": {
    code: "431000",
    text: "郴州市"
  },
  "4311": {
    code: "431100",
    text: "永州市"
  },
  "4312": {
    code: "431200",
    text: "怀化市"
  },
  "4313": {
    code: "431300",
    text: "娄底市"
  },
  "4321": {
    code: "432100",
    text: "湘潭地区"
  },
  "4322": {
    code: "432200",
    text: "岳阳地区"
  },
  "4323": {
    code: "432300",
    text: "益阳地区"
  },
  "4324": {
    code: "432400",
    text: "常德地区"
  },
  "4325": {
    code: "432500",
    text: "娄底地区"
  },
  "4326": {
    code: "432600",
    text: "邵阳地区"
  },
  "4327": {
    code: "432700",
    text: "衡阳地区"
  },
  "4328": {
    code: "432800",
    text: "郴州地区"
  },
  "4329": {
    code: "432900",
    text: "零陵地区"
  },
  "4330": {
    code: "433000",
    text: "怀化市"
  },
  "4331": {
    code: "433100",
    text: "湘西土家族苗族自治州"
  },
  //广东
  "4401": {
    code: "440100",
    text: "广州市"
  },
  "4402": {
    code: "440200",
    text: "韶关市"
  },
  "4403": {
    code: "440300",
    text: "深圳市"
  },
  "4404": {
    code: "440400",
    text: "珠海市"
  },
  "4405": {
    code: "440500",
    text: "汕头市"
  },
  "4406": {
    code: "440600",
    text: "佛山市"
  },
  "4407": {
    code: "440700",
    text: "江门市"
  },
  "4408": {
    code: "440800",
    text: "湛江市"
  },
  "4409": {
    code: "440900",
    text: "茂名市"
  },
  "4412": {
    code: "441200",
    text: "肇庆市"
  },
  "4413": {
    code: "441300",
    text: "惠州市"
  },
  "4414": {
    code: "441400",
    text: "梅州市"
  },
  "4415": {
    code: "441500",
    text: "汕尾市"
  },
  "4416": {
    code: "441600",
    text: "河源市"
  },
  "4417": {
    code: "441700",
    text: "阳江市"
  },
  "4418": {
    code: "441800",
    text: "清远市"
  },
  "4419": {
    code: "441900",
    text: "东莞市"
  },
  "4420": {
    code: "442000",
    text: "中山市"
  },
  "4451": {
    code: "445100",
    text: "潮州市"
  },
  "4452": {
    code: "445200",
    text: "揭阳市"
  },
  "4453": {
    code: "445300",
    text: "云浮市"
  },
  //广西
  "4501": {
    code: "450100",
    text: "南宁市"
  },
  "4502": {
    code: "450200",
    text: "柳州市"
  },
  "4503": {
    code: "450300",
    text: "桂林市"
  },
  "4504": {
    code: "450400",
    text: "梧州市"
  },
  "4505": {
    code: "450500",
    text: "北海市"
  },
  "4506": {
    code: "450600",
    text: "防城港市"
  },
  "4507": {
    code: "450700",
    text: "钦州市"
  },
  "4508": {
    code: "450800",
    text: "贵港市"
  },
  "4509": {
    code: "450900",
    text: "玉林市"
  },
  "4510": {
    code: "451000",
    text: "百色市"
  },
  "4511": {
    code: "451100",
    text: "贺州市"
  },
  "4512": {
    code: "451200",
    text: "河池市"
  },
  "4513": {
    code: "451300",
    text: "来宾市"
  },
  "4514": {
    code: "451400",
    text: "崇左市"
  },
  //海南
  "4601": {
    code: "460100",
    text: "海口市"
  },
  "4602": {
    code: "460200",
    text: "三亚市"
  },
  "4603": {
    code: "460300",
    text: "三沙市"
  },
  "4604": {
    code: "460400",
    text: "儋州市"
  },
  "4690": {
    code: "469000",
    text: "省直辖县级行政区划"
  },
  //重庆
  "5001": {
    code: "500100",
    text: "市辖区"
  },
  "5002": {
    code: "500200",
    text: "县"
  },
  //四川
  "5101": {
    code: "510100",
    text: "成都市"
  },
  "5102": {
    code: "510200",
    text: "重庆市"
  },
  "5103": {
    code: "510300",
    text: "自贡市"
  },
  "5104": {
    code: "510400",
    text: "攀枝花市"
  },
  "5105": {
    code: "510500",
    text: "泸州市"
  },
  "5106": {
    code: "510600",
    text: "德阳市"
  },
  "5107": {
    code: "510700",
    text: "绵阳市"
  },
  "5108": {
    code: "510800",
    text: "广元市"
  },
  "5109": {
    code: "510900",
    text: "遂宁市"
  },
  "5110": {
    code: "511000",
    text: "内江市"
  },
  "5111": {
    code: "511100",
    text: "乐山市"
  },
  "5112": {
    code: "511200",
    text: "万县市"
  },
  "5113": {
    code: "511300",
    text: "南充市"
  },
  "5114": {
    code: "511400",
    text: "眉山市"
  },
  "5115": {
    code: "511500",
    text: "宜宾市"
  },
  "5116": {
    code: "511600",
    text: "广安市"
  },
  "5117": {
    code: "511700",
    text: "达州市"
  },
  "5118": {
    code: "511800",
    text: "雅安市"
  },
  "5119": {
    code: "511900",
    text: "巴中市"
  },
  "5120": {
    code: "512000",
    text: "资阳市"
  },
  "5122": {
    code: "512200",
    text: "万县地区"
  },
  "5123": {
    code: "512300",
    text: "涪陵地区"
  },
  "5125": {
    code: "512500",
    text: "宜宾地区"
  },
  "5129": {
    code: "512900",
    text: "南充地区"
  },
  "5130": {
    code: "513000",
    text: "达川地区"
  },
  "5131": {
    code: "513100",
    text: "雅安地区"
  },
  "5132": {
    code: "513200",
    text: "阿坝藏族羌族自治州"
  },
  "5133": {
    code: "513300",
    text: "甘孜藏族自治州"
  },
  "5134": {
    code: "513400",
    text: "凉山彝族自治州"
  },
  "5135": {
    code: "513500",
    text: "黔江地区"
  },
  "5136": {
    code: "513600",
    text: "广安市"
  },
  "5137": {
    code: "513700",
    text: "巴中地区"
  },
  "5138": {
    code: "513800",
    text: "眉山地区"
  },
  "5139": {
    code: "513900",
    text: "资阳地区"
  },
  "5190": {
    code: "519000",
    text: "广汉市"
  },
  //贵州
  "5201": {
    code: "520100",
    text: "贵阳市"
  },
  "5202": {
    code: "520200",
    text: "六盘水市"
  },
  "5203": {
    code: "520300",
    text: "遵义市"
  },
  "5204": {
    code: "520400",
    text: "安顺市"
  },
  "5205": {
    code: "520500",
    text: "毕节市"
  },
  "5206": {
    code: "520600",
    text: "铜仁市"
  },
  "5221": {
    code: "522100",
    text: "遵义地区"
  },
  "5222": {
    code: "522200",
    text: "铜仁地区"
  },
  "5223": {
    code: "522300",
    text: "黔西南布依族苗族自治州"
  },
  "5224": {
    code: "522400",
    text: "毕节地区"
  },
  "5225": {
    code: "522500",
    text: "安顺地区"
  },
  "5226": {
    code: "522600",
    text: "黔东南苗族侗族自治州"
  },
  "5227": {
    code: "522700",
    text: "黔南布依族苗族自治州"
  },
  //云南
  "5301": {
    code: "530100",
    text: "昆明市"
  },
  "5303": {
    code: "530300",
    text: "曲靖市"
  },
  "5304": {
    code: "530400",
    text: "玉溪市"
  },
  "5305": {
    code: "530500",
    text: "保山市"
  },
  "5306": {
    code: "530600",
    text: "昭通市"
  },
  "5307": {
    code: "530700",
    text: "丽江市"
  },
  "5308": {
    code: "530800",
    text: "普洱市"
  },
  "5309": {
    code: "530900",
    text: "临沧市"
  },
  "5321": {
    code: "532100",
    text: "昭通地区"
  },
  "5322": {
    code: "532200",
    text: "曲靖地区"
  },
  "5323": {
    code: "532300",
    text: "楚雄彝族自治州"
  },
  "5324": {
    code: "532400",
    text: "玉溪地区"
  },
  "5325": {
    code: "532500",
    text: "红河哈尼族彝族自治州"
  },
  "5326": {
    code: "532600",
    text: "文山壮族苗族自治州"
  },
  "5327": {
    code: "532700",
    text: "思茅地区"
  },
  "5328": {
    code: "532800",
    text: "西双版纳傣族自治州"
  },
  "5329": {
    code: "532900",
    text: "大理白族自治州"
  },
  "5330": {
    code: "533000",
    text: "保山地区"
  },
  "5331": {
    code: "533100",
    text: "德宏傣族景颇族自治州"
  },
  "5332": {
    code: "533200",
    text: "丽江地区"
  },
  "5333": {
    code: "533300",
    text: "怒江傈僳族自治州"
  },
  "5334": {
    code: "533400",
    text: "迪庆藏族自治州"
  },
  "5335": {
    code: "533500",
    text: "临沧地区"
  },
  //西藏
  "5401": {
    code: "540100",
    text: "拉萨市"
  },
  "5402": {
    code: "540200",
    text: "日喀则市"
  },
  "5403": {
    code: "540300",
    text: "昌都市"
  },
  "5404": {
    code: "540400",
    text: "林芝市"
  },
  "5405": {
    code: "540500",
    text: "山南市"
  },
  
  "5421": {
    code: "542100",
    text: "昌都地区"
  },
  "5422": {
    code: "542200",
    text: "山南地区"
  },
  "5423": {
    code: "542300",
    text: "日喀则地区"
  },
  "5424": {
    code: "542400",
    text: "那曲地区"
  },
  "5425": {
    code: "542500",
    text: "阿里地区"
  },
  "5426": {
    code: "542600",
    text: "林芝地区"
  },
  "5427": {
    code: "542700",
    text: "江孜地区"
  },
  //陕西
  "6101": {
    code: "610100",
    text: "西安市"
  },
  "6102": {
    code: "610200",
    text: "铜川市"
  },
  "6103": {
    code: "610300",
    text: "宝鸡市"
  },
  "6104": {
    code: "610400",
    text: "咸阳市"
  },
  "6105": {
    code: "610500",
    text: "渭南市"
  },
  "6106": {
    code: "610600",
    text: "延安市"
  },
  "6107": {
    code: "610700",
    text: "汉中市"
  },
  "6108": {
    code: "610800",
    text: "榆林市"
  },
  "6109": {
    code: "610900",
    text: "安康市"
  },
  "6110": {
    code: "611000",
    text: "商洛市"
  },
  //甘肃
  "6201": {
    code: "620100",
    text: "兰州市"
  },
  "6202": {
    code: "620200",
    text: "嘉峪关市"
  },
  "6203": {
    code: "620300",
    text: "金昌市"
  },
  "6204": {
    code: "620400",
    text: "白银市"
  },
  "6205": {
    code: "620500",
    text: "天水市"
  },
  "6206": {
    code: "620600",
    text: "武威市"
  },
  "6207": {
    code: "620700",
    text: "张掖市"
  },
  "6208": {
    code: "620800",
    text: "平凉市"
  },
  "6209": {
    code: "620900",
    text: "酒泉市"
  },
  "6210": {
    code: "621000",
    text: "庆阳市"
  },
  "6211": {
    code: "621100",
    text: "定西市"
  },
  "6212": {
    code: "621200",
    text: "陇南市"
  },
  "6221": {
    code: "622100",
    text: "酒泉地区"
  },
  "6222": {
    code: "622200",
    text: "张掖地区"
  },
  "6223": {
    code: "622300",
    text: "武威地区"
  },
  "6224": {
    code: "622400",
    text: "定西地区"
  },
  "6226": {
    code: "622600",
    text: "陇南地区"
  },
  "6227": {
    code: "622700",
    text: "平凉地区"
  },
  "6228": {
    code: "622800",
    text: "庆阳地区"
  },
  "6229": {
    code: "622900",
    text: "临夏回族自治州"
  },
  "6230": {
    code: "623000",
    text: "甘南藏族自治州"
  },
  //青海
  "6301": {
    code: "630100",
    text: "西宁市"
  },
  "6302": {
    code: "630200",
    text: "海东市"
  },
  "6321": {
    code: "632100",
    text: "海东地区"
  },
  "6322": {
    code: "632200",
    text: "海北藏族自治州"
  },
  "6323": {
    code: "632300",
    text: "黄南藏族自治州"
  },
  "6325": {
    code: "632500",
    text: "海南藏族自治州"
  },
  "6326": {
    code: "632600",
    text: "果洛藏族自治州"
  },
  "6327": {
    code: "632700",
    text: "玉树藏族自治州"
  },
  "6328": {
    code: "632800",
    text: "海西蒙古族藏族自治州"
  },
  //宁夏
  "6401": {
    code: "640100",
    text: "银川市"
  },
  "6402": {
    code: "640200",
    text: "石嘴山"
  },
  "6403": {
    code: "640300",
    text: "吴忠市"
  },
  "6404": {
    code: "640400",
    text: "固原市"
  },
  "6405": {
    code: "640500",
    text: "中卫市"
  },
  "6421": {
    code: "642100",
    text: "吴忠市"
  },
  "6422": {
    code: "642200",
    text: "固原地区"
  },
  //新疆
  "6501": {
    code: "650100",
    text: "乌鲁木齐市"
  },
  "6502": {
    code: "650200",
    text: "克拉玛依市"
  },
  "6504": {
    code: "650400",
    text: "吐鲁番市"
  },
  "6505": {
    code: "650500",
    text: "哈密市"
  },
  "6521": {
    code: "652100",
    text: "吐鲁番地区"
  },
  "6522": {
    code: "652200",
    text: "哈密地区"
  },
  "6523": {
    code: "652300",
    text: "昌吉回族自治州"
  },
  "6524": {
    code: "652400",
    text: "伊犁哈萨克自治州"
  },
  "6525": {
    code: "652500",
    text: "塔城地区"
  },
  "6526": {
    code: "652600",
    text: "阿勒泰地区"
  },
  "6527": {
    code: "652700",
    text: "博尔塔拉蒙古自治州"
  },
  "6528": {
    code: "652800",
    text: "巴音郭楞蒙古自治州"
  },
  "6529": {
    code: "652900",
    text: "阿克苏地区"
  },
  "6530": {
    code: "653000",
    text: "克孜勒苏柯尔克孜自治州"
  },
  "6531": {
    code: "653100",
    text: "喀什地区"
  },
  "6532": {
    code: "653200",
    text: "和田地区"
  },
  "6540": {
    code: "654000",
    text: "伊犁哈萨克自治州"
  },
  "6541": {
    code: "654100",
    text: "伊犁哈萨克自治州"
  },
  "6542": {
    code: "654200",
    text: "塔城地区"
  },
  "6543": {
    code: "654300",
    text: "阿勒泰地区"
  },
  "6590": {
    code: "659000",
    text: "自治区直辖县级行政区划"
  },
}
var areas = {
  //北京
  //北京市辖区
  "110101": {
    code: "110101",
    text: "东城区"
  },
  "110102": {
    code: "110102",
    text: "西城区"
  },
  "110103": {
    code: "110103",
    text: "崇文区"
  },
  "110104": {
    code: "110104",
    text: "宣武区"
  },
  "110105": {
    code: "110105",
    text: "朝阳区"
  },
  "110106": {
    code: "110106",
    text: "丰台区"
  },
  "110107": {
    code: "110107",
    text: "石景山区"
  },
  "110108": {
    code: "110108",
    text: "海淀区"
  },
  "110109": {
    code: "110109",
    text: "门头沟区"
  },
  "110110": {
    code: "110110",
    text: "燕山区"
  },
  "110111": {
    code: "110111",
    text: "房山区"
  },
  "110112": {
    code: "110112",
    text: "通州区"
  },
  "110113": {
    code: "110113",
    text: "顺义区"
  },
  "110114": {
    code: "110114",
    text: "昌平区"
  },
  "110115": {
    code: "110115",
    text: "大兴区"
  },
  "110116": {
    code: "110116",
    text: "怀柔区"
  },
  "110117": {
    code: "110117",
    text: "平谷区"
  },
  "110118": {
    code: "110118",
    text: "密云区"
  },
  "110119": {
    code: "110119",
    text: "延庆区"
  },
  //北京县
  "110221": {
    code: "110221",
    text: "昌平县"
  },
  "110222": {
    code: "110222",
    text: "顺义县"
  },
  "110223": {
    code: "110223",
    text: "通县"
  },
  "110224": {
    code: "110224",
    text: "大兴县"
  },
  "110225": {
    code: "110225",
    text: "房山县"
  },
  "110226": {
    code: "110226",
    text: "平谷县"
  },
  "110227": {
    code: "110227",
    text: "怀柔县"
  },
  "110228": {
    code: "110228",
    text: "密云县"
  },
  "110229": {
    code: "110229",
    text: "延庆县"
  },
  //天津
  //天津 市辖区
  "120101": {
    code: "120101",
    text: "和平区"
  },
  "120102": {
    code: "120102",
    text: "河东区"
  },
  "120103": {
    code: "120103",
    text: "河西区"
  },
  "120104": {
    code: "120104",
    text: "南开区"
  },
  "120105": {
    code: "120105",
    text: "河北区"
  },
  "120106": {
    code: "120106",
    text: "红桥区"
  },
  "120107": {
    code: "120107",
    text: "塘沽区"
  },
  "120108": {
    code: "120108",
    text: "汉沽区"
  },
  "120109": {
    code: "120109",
    text: "大港区"
  },
  "120110": {
    code: "120110",
    text: "东丽区"
  },
  "120111": {
    code: "120111",
    text: "西青区"
  },
  "120112": {
    code: "120112",
    text: "津南区"
  },
  "120113": {
    code: "120113",
    text: "北辰区"
  },
  "120114": {
    code: "120114",
    text: "武清区"
  },
  "120115": {
    code: "120115",
    text: "宝坻区"
  },
  "120116": {
    code: "120116",
    text: "滨海新区"
  },
  "120117": {
    code: "120117",
    text: "宁河区"
  },
  "120118": {
    code: "120118",
    text: "静海区"
  },
  "120119": {
    code: "120119",
    text: "蓟州区"
  },
  //天津 县
  "120221": {
    code: "120221",
    text: "宁河县"
  },
  "120222": {
    code: "120222",
    text: "武清县"
  },
  "120223": {
    code: "120223",
    text: "静海县"
  },
  "120224": {
    code: "120224",
    text: "宝坻县"
  },
  "120225": {
    code: "120225",
    text: "蓟县"
  },
  //河北
  //河北 石家庄
  "130101": {
    code: "130101",
    text: "市辖区"
  },
  "130102": {
    code: "130102",
    text: "长安区"
  },
  "130103": {
    code: "130103",
    text: "桥东区"
  },
  "130104": {
    code: "130104",
    text: "桥西区"
  },
  "130105": {
    code: "130105",
    text: "新华区"
  },
  "130106": {
    code: "130106",
    text: "郊区"
  },
  "130107": {
    code: "130107",
    text: "井陉矿区"
  },
  "130108": {
    code: "130108",
    text: "裕华区"
  },
  "130109": {
    code: "130109",
    text: "藁城区"
  },
  "130110": {
    code: "130110",
    text: "鹿泉区"
  },
  "130111": {
    code: "130111",
    text: "栾城区"
  },
  "130121": {
    code: "130121",
    text: "井陉县"
  },
  "130122": {
    code: "130122",
    text: "获鹿县"
  },
  "130123": {
    code: "130123",
    text: "正定县"
  },
  "130124": {
    code: "130124",
    text: "栾城县"
  },
  "130125": {
    code: "130125",
    text: "行唐县"
  },
  "130126": {
    code: "130126",
    text: "灵寿县"
  },
  "130127": {
    code: "130127",
    text: "高邑县"
  },
  "130128": {
    code: "130128",
    text: "深泽县"
  },
  "130129": {
    code: "130129",
    text: "赞皇县"
  },
  "130130": {
    code: "130130",
    text: "无极县"
  },
  "130131": {
    code: "130131",
    text: "平山县"
  },
  "130132": {
    code: "130132",
    text: "元氏县"
  },
  "130133": {
    code: "130133",
    text: "赵县"
  },
  "130181": {
    code: "130181",
    text: "辛集市"
  },
  "130182": {
    code: "130182",
    text: "藁城区"
  },
  "130183": {
    code: "130183",
    text: "晋州市"
  },
  "130184": {
    code: "130184",
    text: "新乐市"
  },
  //河北 唐山
  "130201": {
    code: "130201",
    text: "市辖区"
  },
  "130202": {
    code: "130202",
    text: "路南区"
  },
  "130203": {
    code: "130203",
    text: "路北区"
  },
  "130204": {
    code: "130204",
    text: "古冶区"
  },
  "130205": {
    code: "130205",
    text: "开平区"
  },
  "130206": {
    code: "130206",
    text: "新区"
  },
  "130207": {
    code: "130207",
    text: "丰南区"
  },
  "130208": {
    code: "130208",
    text: "丰润区"
  },
  "130209": {
    code: "130209",
    text: "曹妃甸区"
  },
  "130221": {
    code: "130221",
    text: "丰润县"
  },
  "130222": {
    code: "130222",
    text: "丰南县"
  },
  "130223": {
    code: "130223",
    text: "滦县"
  },
  "130224": {
    code: "130224",
    text: "滦南县"
  },
  "130225": {
    code: "130225",
    text: "乐亭县"
  },
  "130226": {
    code: "130226",
    text: "迁安县"
  },
  "130227": {
    code: "130227",
    text: "迁西县"
  },
  "130228": {
    code: "130228",
    text: "遵化县"
  },
  "130229": {
    code: "130229",
    text: "玉田县"
  },
  "130230": {
    code: "130230",
    text: "曹妃甸区"
  },
  "130281": {
    code: "130281",
    text: "遵化市"
  },
  "130282": {
    code: "130282",
    text: "丰南市"
  },
  "130283": {
    code: "130283",
    text: "迁安市"
  },
  //河北 秦皇岛市
  "130301": {
    code: "130301",
    text: "市辖区"
  },
  "130302": {
    code: "130302",
    text: "海港区"
  },
  "130303": {
    code: "130303",
    text: "山海关区"
  },
  "130304": {
    code: "130304",
    text: "北戴河区"
  },
  "130306": {
    code: "130306",
    text: "抚宁区"
  },
  "130321": {
    code: "130321",
    text: "青龙满族自治县"
  },
  "130322": {
    code: "130322",
    text: "昌黎县"
  },
  "130323": {
    code: "130323",
    text: "抚宁县"
  },
  "130324": {
    code: "130324",
    text: "卢龙县"
  },
  //河北 邯郸市
  "130401": {
    code: "130401",
    text: "市辖区"
  },
  "130402": {
    code: "130402",
    text: "邯山区"
  },
  "130403": {
    code: "130403",
    text: "丛台区"
  },
  "130404": {
    code: "130404",
    text: "复兴区"
  },
  "130405": {
    code: "130405",
    text: "郊区"
  },
  "130406": {
    code: "130406",
    text: "峰峰矿区"
  },
  "130421": {
    code: "130421",
    text: "邯郸县"
  },
  "130422": {
    code: "130422",
    text: "武安县"
  },
  "130423": {
    code: "130423",
    text: "临漳县"
  },
  "130424": {
    code: "130424",
    text: "成安县"
  },
  "130425": {
    code: "130425",
    text: "大名县"
  },
  "130426": {
    code: "130426",
    text: "涉县"
  },
  "130427": {
    code: "130427",
    text: "磁县"
  },
  "130428": {
    code: "130428",
    text: "肥乡县"
  },
  "130429": {
    code: "130429",
    text: "永年县"
  },
  "130430": {
    code: "130430",
    text: "邱县"
  },
  "130431": {
    code: "130431",
    text: "鸡泽县"
  },
  "130432": {
    code: "130432",
    text: "广平县"
  },
  "130433": {
    code: "130433",
    text: "馆陶县"
  },
  "130434": {
    code: "130434",
    text: "魏县"
  },
  "130435": {
    code: "130435",
    text: "曲周县"
  },
  "130481": {
    code: "130481",
    text: "武安市"
  },
  //河北 邢台市
  "130501": {
    code: "130501",
    text: "市辖区"
  },
  "130502": {
    code: "130502",
    text: "桥东区"
  },
  "130503": {
    code: "130503",
    text: "桥西区"
  },
  "130521": {
    code: "130521",
    text: "邢台县"
  },
  "130522": {
    code: "130522",
    text: "临城县"
  },
  "130523": {
    code: "130523",
    text: "内丘县"
  },
  "130524": {
    code: "130524",
    text: "柏乡县"
  },
  "130525": {
    code: "130525",
    text: "隆尧县"
  },
  "130526": {
    code: "130526",
    text: "任县"
  },
  "130527": {
    code: "130527",
    text: "南和县"
  },
  "130528": {
    code: "130528",
    text: "宁晋县"
  },
  "130529": {
    code: "130529",
    text: "巨鹿县"
  },
  "130530": {
    code: "130530",
    text: "新河县"
  },
  "130531": {
    code: "130531",
    text: "广宗县"
  },
  "130532": {
    code: "130532",
    text: "平乡县"
  },
  "130533": {
    code: "130533",
    text: "威县"
  },
  "130534": {
    code: "130534",
    text: "清河县"
  },
  "130535": {
    code: "130535",
    text: "临西县"
  },
  "130581": {
    code: "130581",
    text: "南宫市"
  },
  "130582": {
    code: "130582",
    text: "沙河市"
  },
  //河北 保定市
  "130601": {
    code: "130601",
    text: "市辖区"
  },
  "130602": {
    code: "130602",
    text: "新市区"
  },
  "130603": {
    code: "130603",
    text: "北市区"
  },
  "130604": {
    code: "130604",
    text: "南市区"
  },
  "130606": {
    code: "130606",
    text: "莲池区"
  },
  "130607": {
    code: "130607",
    text: "满城区"
  },
  "130608": {
    code: "130608",
    text: "清苑区"
  },
  "130609": {
    code: "130609",
    text: "徐水区"
  },
  "130621": {
    code: "130621",
    text: "满城县"
  },
  "130622": {
    code: "130622",
    text: "清苑县"
  },
  "130623": {
    code: "130623",
    text: "涞水县"
  },
  "130624": {
    code: "130624",
    text: "阜平县"
  },
  "130625": {
    code: "130625",
    text: "徐水县"
  },
  "130626": {
    code: "130626",
    text: "定兴县"
  },
  "130627": {
    code: "130627",
    text: "唐县"
  },
  "130628": {
    code: "130628",
    text: "高阳县"
  },
  "130629": {
    code: "130629",
    text: "容城县"
  },
  "130630": {
    code: "130630",
    text: "涞源县"
  },
  "130631": {
    code: "130631",
    text: "望都县"
  },
  "130632": {
    code: "130632",
    text: "安新县"
  },
  "130633": {
    code: "130633",
    text: "易县"
  },
  "130634": {
    code: "130634",
    text: "曲阳县"
  },
  "130635": {
    code: "130635",
    text: "蠡县"
  },
  "130636": {
    code: "130636",
    text: "顺平县"
  },
  "130637": {
    code: "130637",
    text: "博野县"
  },
  "130638": {
    code: "130638",
    text: "雄县"
  },
  "130681": {
    code: "130681",
    text: "涿州市"
  },
  "130682": {
    code: "130682",
    text: "定州市"
  },
  "130683": {
    code: "130683",
    text: "安国市"
  },
  "130684": {
    code: "130684",
    text: "高碑店市"
  },
  //河北 张家口市
  "130701": {
    code: "130701",
    text: "市辖区"
  },
  "130702": {
    code: "130702",
    text: "桥东区"
  },
  "130703": {
    code: "130703",
    text: "桥西区"
  },
  "130705": {
    code: "130705",
    text: "宣化区"
  },
  "130706": {
    code: "130706",
    text: "下花园区"
  },
  "130721": {
    code: "130721",
    text: "宣化县"
  },
  "130722": {
    code: "130722",
    text: "张北县"
  },
  "130723": {
    code: "130723",
    text: "康保县"
  },
  "130724": {
    code: "130724",
    text: "沽源县"
  },
  "130725": {
    code: "130725",
    text: "尚义县"
  },
  "130726": {
    code: "130726",
    text: "蔚县"
  },
  "130727": {
    code: "130727",
    text: "阳原县"
  },
  "130728": {
    code: "130728",
    text: "怀安县"
  },
  "130729": {
    code: "130729",
    text: "万全县"
  },
  "130730": {
    code: "130730",
    text: "怀来县"
  },
  "130731": {
    code: "130731",
    text: "涿鹿县"
  },
  "130732": {
    code: "130732",
    text: "赤城县"
  },
  "130733": {
    code: "130733",
    text: "崇礼县"
  },
  //河北 承德市
  "130801": {
    code: "130801",
    text: "市辖区"
  },
  "130802": {
    code: "130802",
    text: "双桥区"
  },
  "130803": {
    code: "130803",
    text: "双滦区"
  },
  "130804": {
    code: "130804",
    text: "鹰手营子矿区"
  },
  "130821": {
    code: "130821",
    text: "承德县"
  },
  "130822": {
    code: "130822",
    text: "兴隆县"
  },
  "130823": {
    code: "130823",
    text: "平泉县"
  },
  "130824": {
    code: "130824",
    text: "滦平县"
  },
  "130825": {
    code: "130825",
    text: "隆化县"
  },
  "130826": {
    code: "130826",
    text: "丰宁满族自治县"
  },
  "130827": {
    code: "130827",
    text: "宽城满族自治县"
  },
  "130828": {
    code: "130828",
    text: "围场满族蒙古族自治县"
  },
  //河北 沧州市
  "130901": {
    code: "130901",
    text: "市辖区"
  },
  "130902": {
    code: "130902",
    text: "新华区"
  },
  "130903": {
    code: "130903",
    text: "运河区"
  },
  "130904": {
    code: "130904",
    text: "郊区"
  },
  "130921": {
    code: "130921",
    text: "沧县"
  },
  "130922": {
    code: "130922",
    text: "青县"
  },
  "130923": {
    code: "130923",
    text: "东光县"
  },
  "130924": {
    code: "130924",
    text: "海兴县"
  },
  "130925": {
    code: "130925",
    text: "盐山县"
  },
  "130926": {
    code: "130926",
    text: "肃宁县"
  },
  "130927": {
    code: "130927",
    text: "南皮县"
  },
  "130928": {
    code: "130928",
    text: "吴桥县"
  },
  "130929": {
    code: "130929",
    text: "献县"
  },
  "130930": {
    code: "130930",
    text: "孟村回族自治县"
  },
  "130981": {
    code: "130981",
    text: "泊头市"
  },
  "130982": {
    code: "130982",
    text: "任丘市"
  },
  "130983": {
    code: "130983",
    text: "黄骅市"
  },
  "130984": {
    code: "130984",
    text: "河间市"
  },
  //河北 廊坊市
  "131001": {
    code: "131001",
    text: "市辖区"
  },
  "131002": {
    code: "131002",
    text: "安次区"
  },
  "131003": {
    code: "131003",
    text: "广阳区"
  },
  "131021": {
    code: "131021",
    text: "三河县"
  },
  "131022": {
    code: "131022",
    text: "固安县"
  },
  "131023": {
    code: "131023",
    text: "永清县"
  },
  "131024": {
    code: "131024",
    text: "香河县"
  },
  "131025": {
    code: "131025",
    text: "大城县"
  },
  "131026": {
    code: "131026",
    text: "文安县"
  },
  "131027": {
    code: "131027",
    text: "霸县"
  },
  "131028": {
    code: "131028",
    text: "大厂回族自治县"
  },
  "131081": {
    code: "131081",
    text: "霸州市"
  },
  "131082": {
    code: "131082",
    text: "三河市"
  },
  //河北 衡水市
  "131101": {
    code: "131101",
    text: "市辖区"
  },
  "131102": {
    code: "131102",
    text: "桃城区"
  },
  "131121": {
    code: "131121",
    text: "枣强县"
  },
  "131122": {
    code: "131122",
    text: "武邑县"
  },
  "131123": {
    code: "131123",
    text: "武强县"
  },
  "131124": {
    code: "131124",
    text: "饶阳县"
  },
  "131125": {
    code: "131125",
    text: "安平县"
  },
  "131126": {
    code: "131126",
    text: "故城县"
  },
  "131127": {
    code: "131127",
    text: "景县"
  },
  "131128": {
    code: "131128",
    text: "阜城县"
  },
  "131181": {
    code: "131181",
    text: "冀州市"
  },
  "131182": {
    code: "131182",
    text: "深州市"
  },
  //河北 省直辖县级行政区划
  "139001": {
    code: "139001",
    text: "定州市"
  },
  "139002": {
    code: "139002",
    text: "辛集市"
  },
  //山西
  //山西 太原市
  "140101": {
    code: "140101",
    text: "市辖区"
  },
  "140102": {
    code: "140102",
    text: "南城区"
  },
  "140103": {
    code: "140103",
    text: "北城区"
  },
  "140104": {
    code: "140104",
    text: "河西区"
  },
  "140105": {
    code: "140105",
    text: "小店区"
  },
  "140106": {
    code: "140106",
    text: "迎泽区"
  },
  "140107": {
    code: "140107",
    text: "杏花岭区"
  },
  "140108": {
    code: "140108",
    text: "尖草坪区"
  },
  "140109": {
    code: "140109",
    text: "万柏林区"
  },
  "140110": {
    code: "140110",
    text: "晋源区"
  },
  "140111": {
    code: "140111",
    text: "古交工矿区"
  },
  "140112": {
    code: "140112",
    text: "南郊区"
  },
  "140113": {
    code: "140113",
    text: "北郊区"
  },
  "140121": {
    code: "140121",
    text: "清徐县"
  },
  "140122": {
    code: "140122",
    text: "阳曲县"
  },
  "140123": {
    code: "140123",
    text: "娄烦县"
  },
  "140181": {
    code: "140181",
    text: "古交市"
  },
  //山西 大同市
  "140201": {
    code: "140201",
    text: "市辖区"
  },
  "140202": {
    code: "140202",
    text: "城区"
  },
  "140203": {
    code: "140203",
    text: "矿区"
  },
  "140211": {
    code: "140211",
    text: "南郊区"
  },
  "140212": {
    code: "140212",
    text: "新荣区"
  },
  "140221": {
    code: "140221",
    text: "阳高县"
  },
  "140222": {
    code: "140222",
    text: "天镇县"
  },
  "140223": {
    code: "140223",
    text: "广灵县"
  },
  "140224": {
    code: "140224",
    text: "灵丘县"
  },
  "140225": {
    code: "140225",
    text: "浑源县"
  },
  "140226": {
    code: "140226",
    text: "左云县"
  },
  "140227": {
    code: "140227",
    text: "大同县"
  },
  //山西 阳泉市
  "140301": {
    code: "140301",
    text: "市辖区"
  },
  "140302": {
    code: "140302",
    text: "城区"
  },
  "140303": {
    code: "140303",
    text: "矿区"
  },
  "140311": {
    code: "140311",
    text: "郊区"
  },
  "140321": {
    code: "140321",
    text: "平定县"
  },
  "140322": {
    code: "140322",
    text: "盂县"
  },
  //山西 长治市
  "140401": {
    code: "140401",
    text: "市辖区"
  },
  "140402": {
    code: "140402",
    text: "城区"
  },
  "140411": {
    code: "140411",
    text: "郊区"
  },
  "140421": {
    code: "140421",
    text: "长治县"
  },
  "140423": {
    code: "140423",
    text: "襄垣县"
  },
  "140424": {
    code: "140424",
    text: "屯留县"
  },
  "140425": {
    code: "140425",
    text: "平顺县"
  },
  "140426": {
    code: "140426",
    text: "黎城县"
  },
  "140427": {
    code: "140427",
    text: "壶关县"
  },
  "140428": {
    code: "140428",
    text: "长子县"
  },
  "140429": {
    code: "140429",
    text: "武乡县"
  },
  "140430": {
    code: "140430",
    text: "沁县"
  },
  "140431": {
    code: "140431",
    text: "沁源县"
  },
  "140481": {
    code: "140481",
    text: "潞城市"
  },
  //山西 晋城市
  "140501": {
    code: "140501",
    text: "市辖区"
  },
  "140502": {
    code: "140502",
    text: "城区"
  },
  "140521": {
    code: "140521",
    text: "沁水县"
  },
  "140522": {
    code: "140522",
    text: "阳城县"
  },
  "140523": {
    code: "140523",
    text: "高平县"
  },
  "140524": {
    code: "140524",
    text: "陵川县"
  },
  "140525": {
    code: "140525",
    text: "泽州县"
  },
  "140581": {
    code: "140581",
    text: "高平市"
  },
  //山西 朔州市
  "140601": {
    code: "140601",
    text: "市辖区"
  },
  "140602": {
    code: "140602",
    text: "朔城区"
  },
  "140603": {
    code: "140603",
    text: "平鲁区"
  },
  "140621": {
    code: "140621",
    text: "山阴县"
  },
  "140622": {
    code: "140622",
    text: "应县"
  },
  "140623": {
    code: "140623",
    text: "右玉县"
  },
  "140624": {
    code: "140624",
    text: "怀仁县"
  },
  //山西 晋中市
  "140701": {
    code: "140701",
    text: "市辖区"
  },
  "140702": {
    code: "140702",
    text: "榆次区"
  },
  "140721": {
    code: "140721",
    text: "榆社县"
  },
  "140722": {
    code: "140722",
    text: "左权县"
  },
  "140723": {
    code: "140723",
    text: "和顺县"
  },
  "140724": {
    code: "140724",
    text: "昔阳县"
  },
  "140725": {
    code: "140725",
    text: "寿阳县"
  },
  "140726": {
    code: "140726",
    text: "太谷县"
  },
  "140727": {
    code: "140727",
    text: "祁县"
  },
  "140728": {
    code: "140728",
    text: "平遥县"
  },
  "140729": {
    code: "140729",
    text: "灵石县"
  },
  "140781": {
    code: "140781",
    text: "介休市"
  },
  //山西 运城市
  "140801": {
    code: "140801",
    text: "市辖区"
  },
  "140802": {
    code: "140802",
    text: "盐湖区"
  },
  "140821": {
    code: "140821",
    text: "临猗县"
  },
  "140822": {
    code: "140822",
    text: "万荣县"
  },
  "140823": {
    code: "140823",
    text: "闻喜县"
  },
  "140824": {
    code: "140824",
    text: "稷山县"
  },
  "140825": {
    code: "140825",
    text: "新绛县"
  },
  "140826": {
    code: "140826",
    text: "绛县"
  },
  "140827": {
    code: "140827",
    text: "垣曲县"
  },
  "140828": {
    code: "140828",
    text: "夏县"
  },
  "140829": {
    code: "140829",
    text: "平陆县"
  },
  "140830": {
    code: "140830",
    text: "芮城县"
  },
  "140881": {
    code: "140881",
    text: "永济市"
  },
  "140882": {
    code: "140882",
    text: "河津市"
  },
  //山西 忻州市
  "140901": {
    code: "140901",
    text: "市辖区"
  },
  "140902": {
    code: "140902",
    text: "忻府区"
  },
  "140921": {
    code: "140921",
    text: "定襄县"
  },
  "140922": {
    code: "140922",
    text: "五台县"
  },
  "140923": {
    code: "140923",
    text: "代县"
  },
  "140924": {
    code: "140924",
    text: "繁峙县"
  },
  "140925": {
    code: "140925",
    text: "宁武县"
  },
  "140926": {
    code: "140926",
    text: "静乐县"
  },
  "140927": {
    code: "140927",
    text: "神池县"
  },
  "140928": {
    code: "140928",
    text: "五寨县"
  },
  "140929": {
    code: "140929",
    text: "岢岚县"
  },
  "140930": {
    code: "140930",
    text: "河曲县"
  },
  "140931": {
    code: "140931",
    text: "保德县"
  },
  "140932": {
    code: "140932",
    text: "偏关县"
  },
  "140981": {
    code: "140981",
    text: "原平市"
  },
  //山西 临汾市
  "141001": {
    code: "141001",
    text: "市辖区"
  },
  "141002": {
    code: "141002",
    text: "尧都区"
  },
  "141021": {
    code: "141021",
    text: "曲沃县"
  },
  "141022": {
    code: "141022",
    text: "翼城县"
  },
  "141023": {
    code: "141023",
    text: "襄汾县"
  },
  "141024": {
    code: "141024",
    text: "洪洞县"
  },
  "141025": {
    code: "141025",
    text: "古县"
  },
  "141026": {
    code: "141026",
    text: "安泽县"
  },
  "141027": {
    code: "141027",
    text: "浮山县"
  },
  "141028": {
    code: "141028",
    text: "吉县"
  },
  "141029": {
    code: "141029",
    text: "乡宁县"
  },
  "141030": {
    code: "141030",
    text: "大宁县"
  },
  "141031": {
    code: "141031",
    text: "隰县"
  },
  "141032": {
    code: "141032",
    text: "永和县"
  },
  "141033": {
    code: "141033",
    text: "蒲县"
  },
  "141034": {
    code: "141034",
    text: "汾西县"
  },
  "141081": {
    code: "141081",
    text: "侯马市"
  },
  "141082": {
    code: "141082",
    text: "霍州市"
  },
  //山西 吕梁市
  "141101": {
    code: "141101",
    text: "市辖区"
  },
  "141102": {
    code: "141102",
    text: "离石区"
  },
  "141121": {
    code: "141121",
    text: "文水县"
  },
  "141122": {
    code: "141122",
    text: "交城县"
  },
  "141123": {
    code: "141123",
    text: "兴县"
  },
  "141124": {
    code: "141124",
    text: "临县"
  },
  "141125": {
    code: "141125",
    text: "柳林县"
  },
  "141126": {
    code: "141126",
    text: "石楼县"
  },
  "141127": {
    code: "141127",
    text: "岚县"
  },
  "141128": {
    code: "141128",
    text: "方山县"
  },
  "141129": {
    code: "141129",
    text: "中阳县"
  },
  "141130": {
    code: "141130",
    text: "交口县"
  },
  "141181": {
    code: "141181",
    text: "孝义市"
  },
  "141182": {
    code: "141182",
    text: "汾阳市"
  },
  //内蒙古 
  //内蒙古 呼和浩特市
  "150101": {
    code: "150101",
    text: "市辖区"
  },
  "150102": {
    code: "150102",
    text: "新城区"
  },
  "150103": {
    code: "150103",
    text: "回民区"
  },
  "150104": {
    code: "150104",
    text: "玉泉区"
  },
  "150105": {
    code: "150105",
    text: "赛罕区"
  },
  "150121": {
    code: "150121",
    text: "土默特左旗"
  },
  "150122": {
    code: "150122",
    text: "托克托县"
  },
  "150123": {
    code: "150123",
    text: "和林格尔县"
  },
  "150124": {
    code: "150124",
    text: "清水河县"
  },
  "150125": {
    code: "150125",
    text: "武川县"
  },
  //内蒙古 包头市
  "150201": {
    code: "150201",
    text: "市辖区"
  },
  "150202": {
    code: "150202",
    text: "东河区"
  },
  "150203": {
    code: "150203",
    text: "昆都仑区"
  },
  "150204": {
    code: "150204",
    text: "青山区"
  },
  "150205": {
    code: "150205",
    text: "石拐区"
  },
  "150206": {
    code: "150206",
    text: "白云鄂博矿区"
  },
  "150207": {
    code: "150207",
    text: "九原区"
  },
  "150221": {
    code: "150221",
    text: "土默特右旗"
  },
  "150222": {
    code: "150222",
    text: "固阳县"
  },
  "150223": {
    code: "150223",
    text: "达尔罕茂明安联合旗"
  },
  //内蒙古 乌海市
  "150301": {
    code: "150301",
    text: "市辖区"
  },
  "150302": {
    code: "150302",
    text: "海勃湾区"
  },
  "150303": {
    code: "150303",
    text: "海南区"
  },
  "150304": {
    code: "150304",
    text: "乌达区"
  },
  //内蒙古 赤峰市
  "150401": {
    code: "150401",
    text: "市辖区"
  },
  "150402": {
    code: "150402",
    text: "红山区"
  },
  "150403": {
    code: "150403",
    text: "元宝山区"
  },
  "150404": {
    code: "150404",
    text: "松山区"
  },
  "150421": {
    code: "150421",
    text: "阿鲁科尔沁旗"
  },
  "150422": {
    code: "150422",
    text: "巴林左旗"
  },
  "150423": {
    code: "150423",
    text: "巴林右旗"
  },
  "150424": {
    code: "150424",
    text: "林西县"
  },
  "150425": {
    code: "150425",
    text: "克什克腾旗"
  },
  "150426": {
    code: "150426",
    text: "翁牛特旗"
  },
  "150428": {
    code: "150428",
    text: "喀喇沁旗"
  },
  "150429": {
    code: "150429",
    text: "宁城县"
  },
  "150430": {
    code: "150430",
    text: "敖汉旗"
  },
  //内蒙古 通辽市
  "150501": {
    code: "150501",
    text: "市辖区"
  },
  "150502": {
    code: "150502",
    text: "科尔沁区"
  },
  "150521": {
    code: "150521",
    text: "科尔沁左翼中旗"
  },
  "150522": {
    code: "150522",
    text: "科尔沁左翼后旗"
  },
  "150523": {
    code: "150523",
    text: "开鲁县"
  },
  "150524": {
    code: "150524",
    text: "库伦旗"
  },
  "150525": {
    code: "150525",
    text: "奈曼旗"
  },
  "150526": {
    code: "150526",
    text: "扎鲁特旗"
  },
  "150581": {
    code: "150581",
    text: "霍林郭勒市"
  },
  //内蒙古 鄂尔多斯市
  "150601": {
    code: "150601",
    text: "市辖区"
  },
  "150602": {
    code: "150602",
    text: "东胜区"
  },
  "150621": {
    code: "150621",
    text: "达拉特旗"
  },
  "150622": {
    code: "150622",
    text: "准格尔旗"
  },
  "150623": {
    code: "150623",
    text: "鄂托克前旗"
  },
  "150624": {
    code: "150624",
    text: "鄂托克旗"
  },
  "150625": {
    code: "150625",
    text: "杭锦旗"
  },
  "150626": {
    code: "150626",
    text: "乌审旗"
  },
  "150627": {
    code: "150627",
    text: "伊金霍洛旗"
  },
  //内蒙古 呼伦贝尔市
  "150701": {
    code: "150701",
    text: "市辖区"
  },
  "150702": {
    code: "150702",
    text: "海拉尔区"
  },
  "150703": {
    code: "150703",
    text: "扎赉诺尔区"
  },
  "150721": {
    code: "150721",
    text: "阿荣旗"
  },
  "150722": {
    code: "150722",
    text: "莫力达瓦达斡尔族自治旗"
  },
  "150723": {
    code: "150723",
    text: "鄂伦春自治旗"
  },
  "150724": {
    code: "150724",
    text: "鄂温克族自治旗"
  },
  "150725": {
    code: "150725",
    text: "陈巴尔虎旗"
  },
  "150726": {
    code: "150726",
    text: "新巴尔虎左旗"
  },
  "150727": {
    code: "150727",
    text: "新巴尔虎右旗"
  },
  "150781": {
    code: "150781",
    text: "满洲里市"
  },
  "150782": {
    code: "150782",
    text: "牙克石市"
  },
  "150783": {
    code: "150783",
    text: "扎兰屯市"
  },
  "150784": {
    code: "150784",
    text: "额尔古纳市"
  },
  "150785": {
    code: "150785",
    text: "根河市"
  },
  //内蒙古 巴彦淖尔市
  "150801": {
    code: "150801",
    text: "市辖区"
  },
  "150802": {
    code: "150802",
    text: "临河区"
  },
  "150821": {
    code: "150821",
    text: "五原县"
  },
  "150822": {
    code: "150822",
    text: "磴口县"
  },
  "150823": {
    code: "150823",
    text: "乌拉特前旗"
  },
  "150824": {
    code: "150824",
    text: "乌拉特中旗"
  },
  "150825": {
    code: "150825",
    text: "乌拉特后旗"
  },
  "150826": {
    code: "150826",
    text: "杭锦后旗"
  },
  //内蒙古 乌兰察布市
  "150901": {
    code: "150901",
    text: "市辖区"
  },
  "150902": {
    code: "150902",
    text: "集宁区"
  },
  "150921": {
    code: "150921",
    text: "卓资县"
  },
  "150922": {
    code: "150922",
    text: "化德县"
  },
  "150923": {
    code: "150923",
    text: "商都县"
  },
  "150924": {
    code: "150924",
    text: "兴和县"
  },
  "150925": {
    code: "150925",
    text: "凉城县"
  },
  "150926": {
    code: "150926",
    text: "察哈尔右翼前旗"
  },
  "150927": {
    code: "150927",
    text: "察哈尔右翼中旗"
  },
  "150928": {
    code: "150928",
    text: "察哈尔右翼后旗"
  },
  "150929": {
    code: "150929",
    text: "四子王旗"
  },
  "150981": {
    code: "150981",
    text: "丰镇市"
  },
  //内蒙古 兴安盟
  "152201": {
    code: "152201",
    text: "乌兰浩特市"
  },
  "152202": {
    code: "152202",
    text: "阿尔山市"
  },
  "152221": {
    code: "152221",
    text: "科尔沁右翼前旗"
  },
  "152222": {
    code: "152222",
    text: "科尔沁右翼中旗"
  },
  "152223": {
    code: "152223",
    text: "扎赉特旗"
  },
  "152224": {
    code: "152224",
    text: "突泉县"
  },
  //内蒙古 锡林郭勒盟
  "152501": {
    code: "152501",
    text: "二连浩特市"
  },
  "152502": {
    code: "152502",
    text: "锡林浩特市"
  },
  "152522": {
    code: "152522",
    text: "阿巴嘎旗"
  },
  "152523": {
    code: "152523",
    text: "苏尼特左旗"
  },
  "152524": {
    code: "152524",
    text: "苏尼特右旗"
  },
  "152525": {
    code: "152525",
    text: "东乌珠穆沁旗"
  },
  "152526": {
    code: "152526",
    text: "西乌珠穆沁旗"
  },
  "152527": {
    code: "152527",
    text: "太仆寺旗"
  },
  "152528": {
    code: "152528",
    text: "镶黄旗"
  },
  "152529": {
    code: "152529",
    text: "正镶白旗"
  },
  "152530": {
    code: "152530",
    text: "正蓝旗"
  },
  "152531": {
    code: "152531",
    text: "多伦县"
  },
  //内蒙古 阿拉善盟
  "152921": {
    code: "152921",
    text: "阿拉善左旗"
  },
  "152922": {
    code: "152922",
    text: "阿拉善右旗"
  },
  "152923": {
    code: "152923",
    text: "额济纳旗"
  },
  //辽宁省
  //辽宁省 沈阳市
  "210101": {
    code: "210101",
    text: "市辖区"
  },
  "210102": {
    code: "210102",
    text: "和平区"
  },
  "210103": {
    code: "210103",
    text: "沈河区"
  },
  "210104": {
    code: "210104",
    text: "大东区"
  },
  "210105": {
    code: "210105",
    text: "皇姑区"
  },
  "210106": {
    code: "210106",
    text: "铁西区"
  },
  "210111": {
    code: "210111",
    text: "苏家屯区"
  },
  "210112": {
    code: "210112",
    text: "浑南区"
  },
  "210113": {
    code: "210113",
    text: "沈北新区"
  },
  "210114": {
    code: "210114",
    text: "于洪区"
  },
  "210121": {
    code: "210121",
    text: "新民县"
  },
  "210122": {
    code: "210122",
    text: "辽中县"
  },
  "210123": {
    code: "210123",
    text: "康平县"
  },
  "210124": {
    code: "210124",
    text: "法库县"
  },
  "210181": {
    code: "210181",
    text: "新民市"
  },
  //辽宁省 大连市
  "210201": {
    code: "210201",
    text: "市辖区"
  },
  "210202": {
    code: "210202",
    text: "中山区"
  },
  "210203": {
    code: "210203",
    text: "西岗区"
  },
  "210204": {
    code: "210204",
    text: "沙河口区"
  },
  "210211": {
    code: "210211",
    text: "甘井子区"
  },
  "210212": {
    code: "210212",
    text: "旅顺口区"
  },
  "210213": {
    code: "210213",
    text: "金州区"
  },
  "210224": {
    code: "210224",
    text: "长海县"
  },
  "210225": {
    code: "210225",
    text: "庄河县"
  },
  "210281": {
    code: "210281",
    text: "瓦房店市"
  },
  "210282": {
    code: "210282",
    text: "普兰店市"
  },
  "210283": {
    code: "210283",
    text: "庄河市"
  },
  //辽宁省 鞍山市
  "210301": {
    code: "210301",
    text: "市辖区"
  },
  "210302": {
    code: "210302",
    text: "铁东区"
  },
  "210303": {
    code: "210303",
    text: "铁西区"
  },
  "210304": {
    code: "210304",
    text: "立山区"
  },
  "210311": {
    code: "210311",
    text: "千山区"
  },
  "210321": {
    code: "210321",
    text: "台安县"
  },
  "210323": {
    code: "210323",
    text: "岫岩满族自治县"
  },
  "210381": {
    code: "210381",
    text: "海城市"
  },
  //辽宁省 抚顺市
  "210401": {
    code: "210401",
    text: "市辖区"
  },
  "210402": {
    code: "210402",
    text: "新抚区"
  },
  "210403": {
    code: "210403",
    text: "东洲区"
  },
  "210404": {
    code: "210404",
    text: "望花区"
  },
  "210411": {
    code: "210411",
    text: "顺城区"
  },
  "210421": {
    code: "210421",
    text: "抚顺县"
  },
  "210422": {
    code: "210422",
    text: "新宾满族自治县"
  },
  "210423": {
    code: "210423",
    text: "清原满族自治县"
  },
  //辽宁省 本溪市
  "210501": {
    code: "210501",
    text: "市辖区"
  },
  "210502": {
    code: "210502",
    text: "平山区"
  },
  "210503": {
    code: "210503",
    text: "溪湖区"
  },
  "210504": {
    code: "210504",
    text: "明山区"
  },
  "210505": {
    code: "210505",
    text: "南芬区"
  },
  "210521": {
    code: "210521",
    text: "本溪满族自治县"
  },
  "210522": {
    code: "210522",
    text: "桓仁满族自治县"
  },
  //辽宁省 丹东市
  "210601": {
    code: "210601",
    text: "市辖区"
  },
  "210602": {
    code: "210602",
    text: "元宝区"
  },
  "210603": {
    code: "210603",
    text: "振兴区"
  },
  "210604": {
    code: "210604",
    text: "振安区"
  },
  "210621": {
    code: "210621",
    text: "凤城满族自治县"
  },
  "210622": {
    code: "210622",
    text: "岫岩满族自治县"
  },
  "210623": {
    code: "210623",
    text: "东沟县"
  },
  "210624": {
    code: "210624",
    text: "宽甸满族自治县"
  },
  "210681": {
    code: "210681",
    text: "东港市"
  },
  "210682": {
    code: "210682",
    text: "凤城市"
  },
  //辽宁省 锦州市
  "210701": {
    code: "210701",
    text: "市辖区"
  },
  "210702": {
    code: "210702",
    text: "古塔区"
  },
  "210703": {
    code: "210703",
    text: "凌河区"
  },
  "210704": {
    code: "210704",
    text: "南票区"
  },
  "210705": {
    code: "210705",
    text: "葫芦岛区"
  },
  "210711": {
    code: "210711",
    text: "太和区"
  },
  "210726": {
    code: "210726",
    text: "黑山县"
  },
  "210727": {
    code: "210727",
    text: "义县"
  },
  "210781": {
    code: "210781",
    text: "凌海市"
  },
  "210782": {
    code: "210782",
    text: "北镇市"
  },
  //辽宁省 营口市
  "210801": {
    code: "210801",
    text: "市辖区"
  },
  "210802": {
    code: "210802",
    text: "站前区"
  },
  "210803": {
    code: "210803",
    text: "西市区"
  },
  "210804": {
    code: "210804",
    text: "鲅鱼圈区"
  },
  "210811": {
    code: "210811",
    text: "老边区"
  },
  "210881": {
    code: "210881",
    text: "盖州市"
  },
  "210882": {
    code: "210882",
    text: "大石桥市"
  },
  //辽宁省 阜新市
  "210901": {
    code: "210901",
    text: "市辖区"
  },
  "210902": {
    code: "210902",
    text: "海州区"
  },
  "210903": {
    code: "210903",
    text: "新邱区"
  },
  "210904": {
    code: "210904",
    text: "太平区"
  },
  "210905": {
    code: "210905",
    text: "清河门区"
  },
  "210911": {
    code: "210911",
    text: "细河区"
  },
  "210921": {
    code: "210921",
    text: "阜新蒙古族自治县"
  },
  "210922": {
    code: "210922",
    text: "彰武县"
  },
  //辽宁省 辽阳市
  "211001": {
    code: "211001",
    text: "市辖区"
  },
  "211002": {
    code: "211002",
    text: "白塔区"
  },
  "211003": {
    code: "211003",
    text: "文圣区"
  },
  "211004": {
    code: "211004",
    text: "宏伟区"
  },
  "211005": {
    code: "211005",
    text: "弓长岭区"
  },
  "211011": {
    code: "211011",
    text: "太子河区"
  },
  "211021": {
    code: "211021",
    text: "辽阳县"
  },
  "211022": {
    code: "211022",
    text: "灯塔县"
  },
  "211081": {
    code: "211081",
    text: "灯塔市"
  },
  //辽宁省 盘锦市
  "211101": {
    code: "211101",
    text: "市辖区"
  },
  "211102": {
    code: "211102",
    text: "双台子区"
  },
  "211103": {
    code: "211103",
    text: "兴隆台区"
  },
  "211121": {
    code: "211121",
    text: "大洼县"
  },
  "211122": {
    code: "211122",
    text: "盘山县"
  },
  //辽宁省 铁岭市
  "211201": {
    code: "211201",
    text: "市辖区"
  },
  "211202": {
    code: "211202",
    text: "银州区"
  },
  "211203": {
    code: "211203",
    text: "铁法区"
  },
  "211204": {
    code: "211204",
    text: "清河区"
  },
  "211221": {
    code: "211221",
    text: "铁岭县"
  },
  "211222": {
    code: "211222",
    text: "开原县"
  },
  "211223": {
    code: "211223",
    text: "西丰县"
  },
  "211224": {
    code: "211224",
    text: "昌图县"
  },
  "211225": {
    code: "211225",
    text: "康平县"
  },
  "211226": {
    code: "211226",
    text: "法库县"
  },
  "211281": {
    code: "211281",
    text: "调兵山市"
  },
  "211282": {
    code: "211282",
    text: "开原市"
  },
  //辽宁省 朝阳市
  "211301": {
    code: "211301",
    text: "市辖区"
  },
  "211302": {
    code: "211302",
    text: "双塔区"
  },
  "211303": {
    code: "211303",
    text: "龙城区"
  },
  "211321": {
    code: "211321",
    text: "朝阳县"
  },
  "211322": {
    code: "211322",
    text: "建平县"
  },
  "211323": {
    code: "211323",
    text: "凌源县"
  },
  "211324": {
    code: "211324",
    text: "喀喇沁左翼蒙古族自治县"
  },
  "211325": {
    code: "211325",
    text: "建昌县"
  },
  "211326": {
    code: "211326",
    text: "北票县"
  },
  "211381": {
    code: "211381",
    text: "北票市"
  },
  "211382": {
    code: "211382",
    text: "凌源市"
  },
  //辽宁省 葫芦岛市
  "211401": {
    code: "211401",
    text: "市辖区"
  },
  "211402": {
    code: "211402",
    text: "连山区"
  },
  "211403": {
    code: "211403",
    text: "龙港区"
  },
  "211404": {
    code: "211404",
    text: "南票区"
  },
  "211421": {
    code: "211421",
    text: "绥中县"
  },
  "211422": {
    code: "211422",
    text: "建昌县"
  },
  "211481": {
    code: "211481",
    text: "兴城市"
  },
  //吉林省 
  //吉林省 长春市
  "220101": {
    code: "220101",
    text: "市辖区"
  },
  "220102": {
    code: "220102",
    text: "南关区"
  },
  "220103": {
    code: "220103",
    text: "宽城区"
  },
  "220104": {
    code: "220104",
    text: "朝阳区"
  },
  "220105": {
    code: "220105",
    text: "二道区"
  },
  "220106": {
    code: "220106",
    text: "绿园区"
  },
  "220111": {
    code: "220111",
    text: "郊区"
  },
  "220112": {
    code: "220112",
    text: "双阳区"
  },
  "220113": {
    code: "220113",
    text: "九台区"
  },
  "220121": {
    code: "220121",
    text: "榆树县"
  },
  "220122": {
    code: "220122",
    text: "农安县"
  },
  "220123": {
    code: "220123",
    text: "九台县"
  },
  "220124": {
    code: "220124",
    text: "德惠县"
  },
  "220125": {
    code: "220125",
    text: "双阳县"
  },
  "220181": {
    code: "220181",
    text: "九台市"
  },
  "220182": {
    code: "220182",
    text: "榆树市"
  },
  "220183": {
    code: "220183",
    text: "德惠市"
  },
  //吉林省 吉林市
  "220201": {
    code: "220201",
    text: "市辖区"
  },
  "220202": {
    code: "220202",
    text: "昌邑区"
  },
  "220203": {
    code: "220203",
    text: "龙潭区"
  },
  "220204": {
    code: "220204",
    text: "船营区"
  },
  "220211": {
    code: "220211",
    text: "丰满区"
  },
  "220221": {
    code: "220221",
    text: "永吉县"
  },
  "220222": {
    code: "220222",
    text: "舒兰县"
  },
  "220223": {
    code: "220223",
    text: "磐石县"
  },
  "220224": {
    code: "220224",
    text: "蛟河县"
  },
  "220225": {
    code: "220225",
    text: "桦甸县"
  },
  "220281": {
    code: "220281",
    text: "蛟河市"
  },
  "220282": {
    code: "220282",
    text: "桦甸市"
  },
  "220283": {
    code: "220283",
    text: "舒兰市"
  },
  "220284": {
    code: "220284",
    text: "磐石市"
  },
  //吉林省 四平市
  "220301": {
    code: "220301",
    text: "市辖区"
  },
  "220302": {
    code: "220302",
    text: "铁西区"
  },
  "220303": {
    code: "220303",
    text: "铁东区"
  },
  "220321": {
    code: "220321",
    text: "怀德县"
  },
  "220322": {
    code: "220322",
    text: "梨树县"
  },
  "220323": {
    code: "220323",
    text: "伊通满族自治县"
  },
  "220324": {
    code: "220324",
    text: "双辽县"
  },
  "220381": {
    code: "220381",
    text: "公主岭市"
  },
  "220382": {
    code: "220382",
    text: "双辽市"
  },
  //吉林省 辽源市
  "220401": {
    code: "220401",
    text: "市辖区"
  },
  "220402": {
    code: "220402",
    text: "龙山区"
  },
  "220403": {
    code: "220403",
    text: "西安区"
  },
  "220421": {
    code: "220421",
    text: "东丰县"
  },
  "220422": {
    code: "220422",
    text: "东辽县"
  },
  //吉林省 通化市
  "220501": {
    code: "220501",
    text: "市辖区"
  },
  "220502": {
    code: "220502",
    text: "东昌区"
  },
  "220503": {
    code: "220503",
    text: "二道江区"
  },
  "220521": {
    code: "220521",
    text: "通化县"
  },
  "220522": {
    code: "220522",
    text: "集安县"
  },
  "220523": {
    code: "220523",
    text: "辉南县"
  },
  "220524": {
    code: "220524",
    text: "柳河县"
  },
  "220581": {
    code: "220581",
    text: "梅河口市"
  },
  "220582": {
    code: "220582",
    text: "集安市"
  },
  //吉林省 通化市
  "220601": {
    code: "220601",
    text: "市辖区"
  },
  "220602": {
    code: "220602",
    text: "浑江区"
  },
  "220603": {
    code: "220603",
    text: "三岔子区"
  },
  "220604": {
    code: "220604",
    text: "临江区"
  },
  "220605": {
    code: "220605",
    text: "江源区"
  },
  "220621": {
    code: "220621",
    text: "抚松县"
  },
  "220622": {
    code: "220622",
    text: "靖宇县"
  },
  "220623": {
    code: "220623",
    text: "长白朝鲜族自治县"
  },
  "220625": {
    code: "220625",
    text: "江源县"
  },
  "220681": {
    code: "220681",
    text: "临江市"
  },
  //吉林省 松原市
  "220701": {
    code: "220701",
    text: "市辖区"
  },
  "220702": {
    code: "220702",
    text: "宁江区"
  },
  "220721": {
    code: "220721",
    text: "前郭尔罗斯蒙古族自治县"
  },
  "220722": {
    code: "220722",
    text: "长岭县"
  },
  "220723": {
    code: "220723",
    text: "乾安县"
  },
  "220724": {
    code: "220724",
    text: "扶余县"
  },
  "220781": {
    code: "220781",
    text: "扶余市"
  },
  //吉林省 白城市
  "220801": {
    code: "220801",
    text: "市辖区"
  },
  "220802": {
    code: "220802",
    text: "洮北区"
  },
  "220821": {
    code: "220821",
    text: "镇赉县"
  },
  "220822": {
    code: "220822",
    text: "通榆县"
  },
  "220881": {
    code: "220881",
    text: "洮南市"
  },
  "220882": {
    code: "220882",
    text: "大安市"
  },
  //吉林省 延边朝鲜族自治州
  "222401": {
    code: "222401",
    text: "延吉市"
  },
  "222402": {
    code: "222402",
    text: "图们市"
  },
  "222403": {
    code: "222403",
    text: "敦化市"
  },
  "222404": {
    code: "222404",
    text: "珲春市"
  },
  "222405": {
    code: "222405",
    text: "龙井市"
  },
  "222406": {
    code: "222406",
    text: "和龙市"
  },
  "222421": {
    code: "222421",
    text: "龙井县"
  },
  "222422": {
    code: "222422",
    text: "敦化县"
  },
  "222423": {
    code: "222423",
    text: "和龙县"
  },
  "222424": {
    code: "222424",
    text: "汪清县"
  },
  "222425": {
    code: "222425",
    text: "珲春县"
  },
  "222426": {
    code: "222426",
    text: "安图县"
  },
  //黑龙江省 
  //黑龙江省 哈尔滨市
  "230101": {
    code: "230101",
    text: "市辖区"
  },
  "230102": {
    code: "230102",
    text: "道里区"
  },
  "230103": {
    code: "230103",
    text: "南岗区"
  },
  "230104": {
    code: "230104",
    text: "道外区"
  },
  "230105": {
    code: "230105",
    text: "太平区"
  },
  "230106": {
    code: "230106",
    text: "香坊区"
  },
  "230107": {
    code: "230107",
    text: "动力区"
  },
  "230108": {
    code: "230108",
    text: "平房区"
  },
  "230109": {
    code: "230109",
    text: "松北区"
  },
  "230110": {
    code: "230110",
    text: "香坊区"
  },
  "230111": {
    code: "230111",
    text: "呼兰区"
  },
  "230112": {
    code: "230112",
    text: "阿城区"
  },
  "230113": {
    code: "230113",
    text: "双城区"
  },
  "230121": {
    code: "230121",
    text: "呼兰县"
  },
  "230122": {
    code: "230122",
    text: "阿城县"
  },
  "230123": {
    code: "230123",
    text: "依兰县"
  },
  "230124": {
    code: "230124",
    text: "方正县"
  },
  "230125": {
    code: "230125",
    text: "宾县"
  },
  "230126": {
    code: "230126",
    text: "巴彦县"
  },
  "230127": {
    code: "230127",
    text: "木兰县"
  },
  "230128": {
    code: "230128",
    text: "通河县"
  },
  "230129": {
    code: "230129",
    text: "延寿县"
  },
  "230181": {
    code: "230181",
    text: "阿城市"
  },
  "230182": {
    code: "230182",
    text: "双城市"
  },
  "230183": {
    code: "230183",
    text: "尚志市"
  },
  "230184": {
    code: "230184",
    text: "五常市"
  },
  //黑龙江省 齐齐哈尔市
  "230201": {
    code: "230201",
    text: "市辖区"
  },
  "230202": {
    code: "230202",
    text: "龙沙区"
  },
  "230203": {
    code: "230203",
    text: "建华区"
  },
  "230204": {
    code: "230204",
    text: "铁锋区"
  },
  "230205": {
    code: "230205",
    text: "昂昂溪区"
  },
  "230206": {
    code: "230206",
    text: "富拉尔基区"
  },
  "230207": {
    code: "230207",
    text: "碾子山区"
  },
  "230208": {
    code: "230208",
    text: "梅里斯达斡尔族区"
  },
  "230221": {
    code: "230221",
    text: "龙江县"
  },
  "230222": {
    code: "230222",
    text: "讷河县"
  },
  "230223": {
    code: "230223",
    text: "依安县"
  },
  "230224": {
    code: "230224",
    text: "泰来县"
  },
  "230225": {
    code: "230225",
    text: "甘南县"
  },
  "230226": {
    code: "230226",
    text: "杜尔伯特蒙古族自治县"
  },
  "230227": {
    code: "230227",
    text: "富裕县"
  },
  "230228": {
    code: "230228",
    text: "林甸县"
  },
  "230229": {
    code: "230229",
    text: "克山县"
  },
  "230230": {
    code: "230230",
    text: "克东县"
  },
  "230231": {
    code: "230231",
    text: "拜泉县"
  },
  "230281": {
    code: "230281",
    text: "讷河市"
  },
  //黑龙江省 鸡西市
  "230301": {
    code: "230301",
    text: "市辖区"
  },
  "230302": {
    code: "230302",
    text: "鸡冠区"
  },
  "230303": {
    code: "230303",
    text: "恒山区"
  },
  "230304": {
    code: "230304",
    text: "滴道区"
  },
  "230305": {
    code: "230305",
    text: "梨树区"
  },
  "230306": {
    code: "230306",
    text: "城子河区"
  },
  "230307": {
    code: "230307",
    text: "麻山区"
  },
  "230321": {
    code: "230321",
    text: "鸡东县"
  },
  "230381": {
    code: "230381",
    text: "虎林市"
  },
  "230382": {
    code: "230382",
    text: "密山市"
  },
  //黑龙江省 鹤岗市
  "230401": {
    code: "230401",
    text: "市辖区"
  },
  "230402": {
    code: "230402",
    text: "向阳区"
  },
  "230403": {
    code: "230403",
    text: "工农区"
  },
  "230404": {
    code: "230404",
    text: "南山区"
  },
  "230405": {
    code: "230405",
    text: "兴安区"
  },
  "230406": {
    code: "230406",
    text: "东山区"
  },
  "230407": {
    code: "230407",
    text: "兴山区"
  },
  "230421": {
    code: "230421",
    text: "萝北县"
  },
  "230422": {
    code: "230422",
    text: "绥滨县"
  },
  //黑龙江省 双鸭山市
  "230501": {
    code: "230501",
    text: "市辖区"
  },
  "230502": {
    code: "230502",
    text: "尖山区"
  },
  "230503": {
    code: "230503",
    text: "岭东区"
  },
  "230504": {
    code: "230504",
    text: "岭西区"
  },
  "230505": {
    code: "230505",
    text: "四方台区"
  },
  "230506": {
    code: "230506",
    text: "宝山区"
  },
  "230521": {
    code: "230521",
    text: "集贤县"
  },
  "230522": {
    code: "230522",
    text: "友谊县"
  },
  "230523": {
    code: "230523",
    text: "宝清县"
  },
  "230524": {
    code: "230524",
    text: "饶河县"
  },
  //黑龙江省 大庆市
  "230601": {
    code: "230601",
    text: "市辖区"
  },
  "230602": {
    code: "230602",
    text: "萨尔图区"
  },
  "230603": {
    code: "230603",
    text: "龙凤区"
  },
  "230604": {
    code: "230604",
    text: "让胡路区"
  },
  "230605": {
    code: "230605",
    text: "红岗区"
  },
  "230606": {
    code: "230606",
    text: "大同区"
  },
  "230621": {
    code: "230621",
    text: "肇州县"
  },
  "230622": {
    code: "230622",
    text: "肇源县"
  },
  "230623": {
    code: "230623",
    text: "林甸县"
  },
  "230624": {
    code: "230624",
    text: "杜尔伯特蒙古族自治县"
  },
  //黑龙江省 伊春市
  "230701": {
    code: "230701",
    text: "市辖区"
  },
  "230702": {
    code: "230702",
    text: "伊春区"
  },
  "230703": {
    code: "230703",
    text: "南岔区"
  },
  "230704": {
    code: "230704",
    text: "友好区"
  },
  "230705": {
    code: "230705",
    text: "西林区"
  },
  "230706": {
    code: "230706",
    text: "翠峦区"
  },
  "230707": {
    code: "230707",
    text: "新青区"
  },
  "230708": {
    code: "230708",
    text: "美溪区"
  },
  "230709": {
    code: "230709",
    text: "金山屯区"
  },
  "230710": {
    code: "230710",
    text: "五营区"
  },
  "230711": {
    code: "230711",
    text: "乌马河区"
  },
  "230712": {
    code: "230712",
    text: "汤旺河区"
  },
  "230713": {
    code: "230713",
    text: "带岭区"
  },
  "230714": {
    code: "230714",
    text: "乌伊岭区"
  },
  "230715": {
    code: "230715",
    text: "红星区"
  },
  "230716": {
    code: "230716",
    text: "上甘岭区"
  },
  "230721": {
    code: "230721",
    text: "铁力县"
  },
  "230722": {
    code: "230722",
    text: "嘉荫县"
  },
  "230781": {
    code: "230781",
    text: "铁力市"
  },
  //黑龙江省 佳木斯市
  "230801": {
    code: "230801",
    text: "市辖区"
  },
  "230802": {
    code: "230802",
    text: "永红区"
  },
  "230803": {
    code: "230803",
    text: "向阳区"
  },
  "230804": {
    code: "230804",
    text: "前进区"
  },
  "230805": {
    code: "230805",
    text: "东风区"
  },
  "230811": {
    code: "230811",
    text: "郊区"
  },
  "230821": {
    code: "230821",
    text: "富锦县"
  },
  "230822": {
    code: "230822",
    text: "桦南县"
  },
  "230823": {
    code: "230823",
    text: "依兰县"
  },
  "230825": {
    code: "230825",
    text: "集贤县"
  },
  "230826": {
    code: "230826",
    text: "桦川县"
  },
  "230827": {
    code: "230827",
    text: "宝清县"
  },
  "230828": {
    code: "230828",
    text: "汤原县"
  },
  "230829": {
    code: "230829",
    text: "绥滨县"
  },
  "230830": {
    code: "230830",
    text: "萝北县"
  },
  "230831": {
    code: "230831",
    text: "同江县"
  },
  "230832": {
    code: "230832",
    text: "饶河县"
  },
  "230833": {
    code: "230833",
    text: "抚远县"
  },
  "230834": {
    code: "230834",
    text: "友谊县"
  },
  "230881": {
    code: "230881",
    text: "同江市"
  },
  "230882": {
    code: "230882",
    text: "富锦市"
  },
  "230883": {
    code: "230883",
    text: "抚远市"
  },   　　
  //黑龙江省 七台河市
  "230901": {
    code: "230901",
    text: "市辖区"
  },
  "230902": {
    code: "230902",
    text: "新兴区"
  },
  "230903": {
    code: "230903",
    text: "桃山区"
  },
  "230904": {
    code: "230904",
    text: "茄子河区"
  },
  "230921": {
    code: "230921",
    text: "勃利县"
  },
  //黑龙江省 牡丹江市
  "231001": {
    code: "231001",
    text: "市辖区"
  },
  "231002": {
    code: "231002",
    text: "东安区"
  },
  "231003": {
    code: "231003",
    text: "阳明区"
  },
  "231004": {
    code: "231004",
    text: "爱民区"
  },
  "231005": {
    code: "231005",
    text: "西安区"
  },
  "231021": {
    code: "231021",
    text: "宁安县"
  },
  "231022": {
    code: "231022",
    text: "海林县"
  },
  "231023": {
    code: "231023",
    text: "穆棱县"
  },
  "231024": {
    code: "231024",
    text: "东宁县"
  },
  "231025": {
    code: "231025",
    text: "林口县"
  },
  "231026": {
    code: "231026",
    text: "密山县"
  },
  "231027": {
    code: "231026",
    text: "密山县"
  },
  "231081": {
    code: "231081",
    text: "绥芬河市"
  },
  "231082": {
    code: "231082",
    text: "密山市"
  },
  "231083": {
    code: "231083",
    text: "海林市"
  },
  "231084": {
    code: "231084",
    text: "宁安市"
  },
  "231085": {
    code: "231085",
    text: "穆棱市"
  },
  "231086": {
    code: "231086",
    text: "东宁市"
  },
  //黑龙江省 黑河市
  "231101": {
    code: "231101",
    text: "市辖区"
  },
  "231102": {
    code: "231102",
    text: "爱辉区"
  },
  "231121": {
    code: "231121",
    text: "嫩江县"
  },
  "231123": {
    code: "231123",
    text: "逊克县"
  },
  "231124": {
    code: "231124",
    text: "孙吴县"
  },
  "231181": {
    code: "231181",
    text: "北安市"
  },
  "231182": {
    code: "231182",
    text: "五大连池市"
  },
  //黑龙江省 绥化市
  "231201": {
    code: "231201",
    text: "市辖区"
  },
  "231202": {
    code: "231202",
    text: "北林区"
  },
  "231221": {
    code: "231221",
    text: "望奎县"
  },
  "231222": {
    code: "231222",
    text: "兰西县"
  },
  "231223": {
    code: "231223",
    text: "青冈县"
  },
  "231224": {
    code: "231224",
    text: "庆安县"
  },
  "231225": {
    code: "231225",
    text: "明水县"
  },
  "231226": {
    code: "231226",
    text: "绥棱县"
  },
  "231281": {
    code: "231281",
    text: "安达市"
  },
  "231282": {
    code: "231282",
    text: "肇东市"
  },
  "231283": {
    code: "231283",
    text: "海伦市"
  },
  //黑龙江省 大兴安岭地区
  "232721": {
    code: "232721",
    text: "呼玛县"
  },
  "232722": {
    code: "232722",
    text: "塔河县"
  },
  "232723": {
    code: "232723",
    text: "漠河县"
  },
  "232724": {
    code: "232724",
    text: "漠河县"
  },
  //上海市 
  //上海市 市辖区
  "310101": {
    code: "310101",
    text: "黄浦区"
  },
  "310102": {
    code: "310102",
    text: "南市区"
  },
  "310103": {
    code: "310103",
    text: "卢湾区"
  },
  "310104": {
    code: "310104",
    text: "徐汇区"
  },
  "310105": {
    code: "310105",
    text: "长宁区"
  },
  "310106": {
    code: "310106",
    text: "静安区"
  },
  "310107": {
    code: "310107",
    text: "普陀区"
  },
  "310108": {
    code: "310108",
    text: "闸北区"
  },
  "310109": {
    code: "310109",
    text: "虹口区"
  },
  "310110": {
    code: "310110",
    text: "杨浦区"
  },
  "310111": {
    code: "310111",
    text: "吴凇区"
  },
  "310112": {
    code: "310112",
    text: "闵行区"
  },
  "310113": {
    code: "310113",
    text: "宝山区"
  },
  "310114": {
    code: "310114",
    text: "嘉定区"
  },
  "310115": {
    code: "310115",
    text: "浦东新区"
  },
  "310116": {
    code: "310116",
    text: "金山区"
  },
  "310117": {
    code: "310117",
    text: "松江区"
  },
  "310118": {
    code: "310118",
    text: "青浦区"
  },
  "310119": {
    code: "310119",
    text: "南汇区"
  },
  "310120": {
    code: "310120",
    text: "奉贤区"
  },
  "310151": {
    code: "310151",
    text: "崇明区"
  },
  //上海市 县
  "310230": {
    code: "310230",
    text: "崇明县"
  },
  //江苏省
  //江苏省 南京市
  "320101": {
    code: "320101",
    text: "市辖区"
  },
  "320102": {
    code: "320102",
    text: "玄武区"
  },
  "320103": {
    code: "320103",
    text: "白下区"
  },
  "320104": {
    code: "320104",
    text: "秦淮区"
  },
  "320105": {
    code: "320105",
    text: "建邺区"
  },
  "320106": {
    code: "320106",
    text: "鼓楼区"
  },
  "320107": {
    code: "320107",
    text: "下关区"
  },
  "320111": {
    code: "320111",
    text: "浦口区"
  },
  "320112": {
    code: "320112",
    text: "大厂区"
  },
  "320113": {
    code: "320113",
    text: "栖霞区"
  },
  "320114": {
    code: "320114",
    text: "雨花台区"
  },
  "320115": {
    code: "320115",
    text: "江宁区"
  },
  "320116": {
    code: "320116",
    text: "六合区"
  },
  "320117": {
    code: "320117",
    text: "溧水区"
  },
  "320118": {
    code: "320118",
    text: "高淳区"
  },
  "320120": {
    code: "320120",
    text: "市区"
  },
  "320121": {
    code: "320121",
    text: "江宁县"
  },
  "320122": {
    code: "320122",
    text: "江浦县"
  },
  "320123": {
    code: "320123",
    text: "六合县"
  },
  "320124": {
    code: "320124",
    text: "溧水县"
  },
  "320125": {
    code: "320125",
    text: "高淳县"
  },
  //江苏省 无锡市
  "320201": {
    code: "320201",
    text: "市辖区"
  },
  "320202": {
    code: "320202",
    text: "崇安区"
  },
  "320203": {
    code: "320203",
    text: "南长区"
  },
  "320204": {
    code: "320204",
    text: "北塘区"
  },
  "320205": {
    code: "320205",
    text: "锡山区"
  },
  "320206": {
    code: "320206",
    text: "惠山区"
  },
  "320211": {
    code: "320211",
    text: "滨湖区"
  },
  "320212": {
    code: "320212",
    text: "马山区"
  },
  "320213": {
    code: "320213",
    text: "梁溪区"
  },
  "320214": {
    code: "320214",
    text: "新吴区"
  },
  "320281": {
    code: "320281",
    text: "江阴市"
  },
  "320282": {
    code: "320282",
    text: "宜兴市"
  },
  "320283": {
    code: "320283",
    text: "锡山市"
  },
  //江苏省 徐州市
  "320301": {
    code: "320301",
    text: "市辖区"
  },
  "320302": {
    code: "320302",
    text: "鼓楼区"
  },
  "320303": {
    code: "320303",
    text: "云龙区"
  },
  "320304": {
    code: "320304",
    text: "九里区"
  },
  "320305": {
    code: "320305",
    text: "贾汪区"
  },
  "320311": {
    code: "320311",
    text: "泉山区"
  },
  "320312": {
    code: "320312",
    text: "铜山区"
  },
  "320321": {
    code: "320321",
    text: "丰县"
  },
  "320322": {
    code: "320322",
    text: "沛县"
  },
  "320323": {
    code: "320323",
    text: "铜山县"
  },
  "320324": {
    code: "320324",
    text: "睢宁县"
  },
  "320325": {
    code: "320325",
    text: "邳县"
  },
  "320326": {
    code: "320326",
    text: "新沂县"
  },
  "320381": {
    code: "320381",
    text: "新沂市"
  },
  "320382": {
    code: "320382",
    text: "邳州市"
  },
  //江苏省 常州市
  "320401": {
    code: "320401",
    text: "市辖区"
  },
  "320402": {
    code: "320402",
    text: "天宁区"
  },
  "320404": {
    code: "320404",
    text: "钟楼区"
  },
  "320405": {
    code: "320405",
    text: "戚墅堰区"
  },
  "320411": {
    code: "320411",
    text: "新北区"
  },
  "320412": {
    code: "320412",
    text: "武进区"
  },
  "320413": {
    code: "320413",
    text: "金坛区"
  },
  "320481": {
    code: "320481",
    text: "溧阳市"
  },
  "320482": {
    code: "320482",
    text: "金坛市"
  },
  "320483": {
    code: "320483",
    text: "武进市"
  },
  //江苏省 苏州市
  "320501": {
    code: "320501",
    text: "市辖区"
  },
  "320502": {
    code: "320502",
    text: "沧浪区"
  },
  "320503": {
    code: "320503",
    text: "平江区"
  },
  "320504": {
    code: "320504",
    text: "金阊区"
  },
  "320505": {
    code: "320505",
    text: "虎丘区"
  },
  "320506": {
    code: "320506",
    text: "吴中区"
  },
  "320507": {
    code: "320507",
    text: "相城区"
  },
  "320508": {
    code: "320508",
    text: "姑苏区"
  },
  "320509": {
    code: "320509",
    text: "吴江区"
  },
  "320511": {
    code: "320511",
    text: "郊区"
  },
  "320581": {
    code: "320581",
    text: "常熟市"
  },
  "320582": {
    code: "320582",
    text: "张家港市"
  },
  "320583": {
    code: "320583",
    text: "昆山市"
  },
  "320584": {
    code: "320584",
    text: "吴江市"
  },
  "320585": {
    code: "320585",
    text: "太仓市"
  },
  "320586": {
    code: "320586",
    text: "吴县市"
  },
  //江苏省 南通市
  "320601": {
    code: "320601",
    text: "市辖区"
  },
  "320602": {
    code: "320602",
    text: "崇川区"
  },
  "320611": {
    code: "320611",
    text: "港闸区"
  },
  "320612": {
    code: "320612",
    text: "通州区"
  },
  "320621": {
    code: "320621",
    text: "海安县"
  },
  "320622": {
    code: "320622",
    text: "如皋县"
  },
  "320623": {
    code: "320623",
    text: "如东县"
  },
  "320624": {
    code: "320624",
    text: "南通县"
  },
  "320625": {
    code: "320625",
    text: "海门县"
  },
  "320626": {
    code: "320626",
    text: "启东县"
  },
  "320681": {
    code: "320681",
    text: "启东市"
  },
  "320682": {
    code: "320682",
    text: "如皋市"
  },
  "320683": {
    code: "320683",
    text: "通州市"
  },
  "320684": {
    code: "320684",
    text: "海门市"
  },
  //江苏省 连云港市
  "320701": {
    code: "320701",
    text: "市辖区"
  },
  "320703": {
    code: "320703",
    text: "连云区"
  },
  "320704": {
    code: "320704",
    text: "云台区"
  },
  "320705": {
    code: "320705",
    text: "新浦区"
  },
  "320706": {
    code: "320706",
    text: "海州区"
  },
  "320707": {
    code: "320707",
    text: "赣榆区"
  },
  "320721": {
    code: "320721",
    text: "赣榆县"
  },
  "320722": {
    code: "320722",
    text: "东海县"
  },
  "320723": {
    code: "320723",
    text: "灌云县"
  },
  "320724": {
    code: "320724",
    text: "灌南县"
  },
  //江苏省 淮安市
  "320801": {
    code: "320801",
    text: "市辖区"
  },
  "320802": {
    code: "320802",
    text: "清河区"
  },
  "320803": {
    code: "320803",
    text: "淮安区"
  },
  "320804": {
    code: "320804",
    text: "淮阴区"
  },
  "320811": {
    code: "320811",
    text: "清浦区"
  },
  "320821": {
    code: "320821",
    text: "淮阴县"
  },
  "320822": {
    code: "320822",
    text: "灌南县"
  },
  "320823": {
    code: "320823",
    text: "沭阳县"
  },
  "320824": {
    code: "320824",
    text: "宿迁县"
  },
  "320825": {
    code: "320825",
    text: "泗阳县"
  },
  "320826": {
    code: "320826",
    text: "涟水县"
  },
  "320827": {
    code: "320827",
    text: "泗洪县"
  },
  "320828": {
    code: "320828",
    text: "淮安县"
  },
  "320829": {
    code: "320829",
    text: "洪泽县"
  },
  "320830": {
    code: "320830",
    text: "盱眙县"
  },
  "320831": {
    code: "320831",
    text: "金湖县"
  },
  //江苏省 盐城市
  "320901": {
    code: "320901",
    text: "市辖区"
  },
  "320902": {
    code: "320902",
    text: "亭湖区"
  },
  "320903": {
    code: "320903",
    text: "盐都区"
  },
  "320904": {
    code: "320904",
    text: "大丰区"
  },
  "320921": {
    code: "320921",
    text: "响水县"
  },
  "320922": {
    code: "320922",
    text: "滨海县"
  },
  "320923": {
    code: "320923",
    text: "阜宁县"
  },
  "320924": {
    code: "320924",
    text: "射阳县"
  },
  "320925": {
    code: "320925",
    text: "建湖县"
  },
  "320926": {
    code: "320926",
    text: "大丰县"
  },
  "320927": {
    code: "320927",
    text: "东台县"
  },
  "320928": {
    code: "320928",
    text: "盐都县"
  },
  "320981": {
    code: "320981",
    text: "东台市"
  },
  "320982": {
    code: "320982",
    text: "大丰市"
  },
  //江苏省 扬州市
  "321001": {
    code: "321001",
    text: "市辖区"
  },
  "321002": {
    code: "321002",
    text: "广陵区"
  },
  "321003": {
    code: "321003",
    text: "邗江区"
  },
  "321011": {
    code: "321011",
    text: "郊区"
  },
  "321012": {
    code: "321012",
    text: "江都区"
  },
  "321021": {
    code: "321021",
    text: "兴化县"
  },
  "321022": {
    code: "321022",
    text: "高邮县"
  },
  "321023": {
    code: "321023",
    text: "宝应县"
  },
  "321024": {
    code: "321024",
    text: "靖江县"
  },
  "321025": {
    code: "321025",
    text: "泰兴县"
  },
  "321026": {
    code: "321026",
    text: "江都县"
  },
  "321027": {
    code: "321027",
    text: "邗江县"
  },
  "321028": {
    code: "321028",
    text: "泰县"
  },
  "321029": {
    code: "321029",
    text: "仪征县"
  },
  "321081": {
    code: "321081",
    text: "仪征市"
  },
  "321082": {
    code: "321082",
    text: "泰州市"
  },
  "321083": {
    code: "321083",
    text: "兴化市"
  },
  "321084": {
    code: "321084",
    text: "高邮市"
  },
  "321085": {
    code: "321085",
    text: "泰兴市"
  },
  "321086": {
    code: "321086",
    text: "靖江市"
  },
  //江苏省 镇江市
  "321101": {
    code: "321101",
    text: "市辖区"
  },
  "321102": {
    code: "321102",
    text: "京口区"
  },
  "321111": {
    code: "321111",
    text: "润州区"
  },
  "321112": {
    code: "321112",
    text: "丹徒区"
  },
  "321181": {
    code: "321181",
    text: "丹阳市"
  },
  "321182": {
    code: "321182",
    text: "扬中市"
  },
  "321183": {
    code: "321183",
    text: "句容市"
  },
  //江苏省 泰州市
  "321201": {
    code: "321201",
    text: "市辖区"
  },
  "321202": {
    code: "321202",
    text: "海陵区"
  },
  "321203": {
    code: "321203",
    text: "高港区"
  },
  "321204": {
    code: "321204",
    text: "姜堰区"
  },
  "321281": {
    code: "321281",
    text: "兴化市"
  },
  "321282": {
    code: "321282",
    text: "靖江市"
  },
  "321283": {
    code: "321283",
    text: "泰兴市"
  },
  "321284": {
    code: "321284",
    text: "姜堰市"
  },
  //江苏省 宿迁市
  "321301": {
    code: "321301",
    text: "市辖区"
  },
  "321302": {
    code: "321302",
    text: "宿城区"
  },
  "321311": {
    code: "321311",
    text: "宿豫区"
  },
  "321321": {
    code: "321321",
    text: "宿豫县"
  },
  "321322": {
    code: "321322",
    text: "沭阳县"
  },
  "321323": {
    code: "321323",
    text: "泗阳县"
  },
  "321324": {
    code: "321324",
    text: "泗洪县"
  },
  //浙江省 
  //浙江省 杭州市
  "330101": {
    code: "330101",
    text: "市辖区"
  },
  "330102": {
    code: "330102",
    text: "上城区"
  },
  "330103": {
    code: "330103",
    text: "下城区"
  },
  "330104": {
    code: "330104",
    text: "江干区"
  },
  "330105": {
    code: "330105",
    text: "拱墅区"
  },
  "330106": {
    code: "330106",
    text: "西湖区"
  },
  "330107": {
    code: "330107",
    text: "滨江区"
  },
  "330108": {
    code: "330108",
    text: "滨江区"
  },
  "330109": {
    code: "330109",
    text: "萧山区"
  },
  "330110": {
    code: "330110",
    text: "余杭区"
  },
  "330111": {
    code: "330111",
    text: "富阳区"
  },
  "330121": {
    code: "330121",
    text: "萧山县"
  },
  "330122": {
    code: "330122",
    text: "桐庐县"
  },
  "330123": {
    code: "330123",
    text: "富阳县"
  },
  "330124": {
    code: "330124",
    text: "临安县"
  },
  "330125": {
    code: "330125",
    text: "余杭县"
  },
  "330126": {
    code: "330126",
    text: "建德县"
  },
  "330127": {
    code: "330127",
    text: "淳安县"
  },
  "330181": {
    code: "330181",
    text: "萧山市"
  },
  "330182": {
    code: "330182",
    text: "建德市"
  },
  "330183": {
    code: "330183",
    text: "富阳市"
  },
  "330184": {
    code: "330184",
    text: "余杭市"
  },
  "330185": {
    code: "330185",
    text: "临安市"
  },
  //浙江省 宁波市
  "330201": {
    code: "330201",
    text: "市辖区"
  },
  "330202": {
    code: "330202",
    text: "镇明区"
  },
  "330203": {
    code: "330203",
    text: "海曙区"
  },
  "330204": {
    code: "330204",
    text: "江东区"
  },
  "330205": {
    code: "330205",
    text: "江北区"
  },
  "330206": {
    code: "330206",
    text: "北仑区"
  },
  "330207": {
    code: "330207",
    text: "鄞州区"
  },
  "330211": {
    code: "330211",
    text: "镇海区"
  },
  "330212": {
    code: "330212",
    text: "鄞州区"
  },
  "330221": {
    code: "330221",
    text: "镇海县"
  },
  "330222": {
    code: "330222",
    text: "慈溪县"
  },
  "330223": {
    code: "330223",
    text: "余姚县"
  },
  "330224": {
    code: "330224",
    text: "奉化县"
  },
  "330225": {
    code: "330225",
    text: "象山县"
  },
  "330226": {
    code: "330226",
    text: "宁海县"
  },
  "330227": {
    code: "330227",
    text: "鄞县"
  },
  "330281": {
    code: "330281",
    text: "余姚市"
  },
  "330282": {
    code: "330282",
    text: "慈溪市"
  },
  "330283": {
    code: "330283",
    text: "奉化市"
  },
  //浙江省 温州市
  "330301": {
    code: "330301",
    text: "市辖区"
  },
  "330302": {
    code: "330302",
    text: "鹿城区"
  },
  "330303": {
    code: "330303",
    text: "龙湾区"
  },
  "330304": {
    code: "330304",
    text: "瓯海区"
  },
  "330305": {
    code: "330305",
    text: "洞头区"
  },
  "330321": {
    code: "330321",
    text: "瓯海县"
  },
  "330322": {
    code: "330322",
    text: "洞头县"
  },
  "330323": {
    code: "330323",
    text: "乐清县"
  },
  "330324": {
    code: "330324",
    text: "永嘉县"
  },
  "330325": {
    code: "330325",
    text: "瑞安县"
  },
  "330326": {
    code: "330326",
    text: "平阳县"
  },
  "330327": {
    code: "330327",
    text: "苍南县"
  },
  "330328": {
    code: "330328",
    text: "文成县"
  },
  "330329": {
    code: "330329",
    text: "泰顺县"
  },
  "330381": {
    code: "330381",
    text: "瑞安市"
  },
  "330382": {
    code: "330382",
    text: "乐清市"
  },
  //浙江省 嘉兴市
  "330401": {
    code: "330401",
    text: "市辖区"
  },
  "330402": {
    code: "330402",
    text: "南湖区"
  },
  "330411": {
    code: "330411",
    text: "秀洲区"
  },
  "330421": {
    code: "330421",
    text: "嘉善县"
  },
  "330422": {
    code: "330422",
    text: "平湖县"
  },
  "330423": {
    code: "330423",
    text: "海宁县"
  },
  "330424": {
    code: "330424",
    text: "海盐县"
  },
  "330425": {
    code: "330425",
    text: "桐乡县"
  },
  "330481": {
    code: "330481",
    text: "海宁市"
  },
  "330482": {
    code: "330482",
    text: "平湖市"
  },
  "330483": {
    code: "330483",
    text: "桐乡市"
  },
  //浙江省 湖州市
  "330501": {
    code: "330501",
    text: "市辖区"
  },
  "330502": {
    code: "330502",
    text: "吴兴区"
  },
  "330503": {
    code: "330503",
    text: "南浔区"
  },
  "330521": {
    code: "330521",
    text: "德清县"
  },
  "330522": {
    code: "330522",
    text: "长兴县"
  },
  "330523": {
    code: "330523",
    text: "安吉县"
  },
  //浙江省 绍兴市
  "330601": {
    code: "330601",
    text: "市辖区"
  },
  "330602": {
    code: "330602",
    text: "越城区"
  },
  "330603": {
    code: "330603",
    text: "柯桥区"
  },
  "330604": {
    code: "330604",
    text: "上虞区"
  },
  "330621": {
    code: "330621",
    text: "绍兴县"
  },
  "330622": {
    code: "330622",
    text: "上虞县"
  },
  "330623": {
    code: "330623",
    text: "嵊县"
  },
  "330624": {
    code: "330624",
    text: "新昌县"
  },
  "330625": {
    code: "330625",
    text: "诸暨县"
  },
  "330681": {
    code: "330681",
    text: "诸暨市"
  },
  "330682": {
    code: "330682",
    text: "上虞市"
  },
  "330683": {
    code: "330683",
    text: "嵊州市"
  },
  //浙江省 金华市
  "330701": {
    code: "330701",
    text: "市辖区"
  },
  "330702": {
    code: "330702",
    text: "婺城区"
  },
  "330703": {
    code: "330703",
    text: "金东区"
  },
  "330721": {
    code: "330721",
    text: "金华县"
  },
  "330722": {
    code: "330722",
    text: "永康县"
  },
  "330723": {
    code: "330723",
    text: "武义县"
  },
  "330724": {
    code: "330724",
    text: "东阳县"
  },
  "330725": {
    code: "330725",
    text: "义乌县"
  },
  "330726": {
    code: "330726",
    text: "浦江县"
  },
  "330727": {
    code: "330727",
    text: "磐安县"
  },
  "330781": {
    code: "330781",
    text: "兰溪市"
  },
  "330782": {
    code: "330782",
    text: "义乌市"
  },
  "330783": {
    code: "330783",
    text: "东阳市"
  },
  "330784": {
    code: "330784",
    text: "永康市"
  },
  //浙江省 衢州市
  "330801": {
    code: "330801",
    text: "市辖区"
  },
  "330802": {
    code: "330802",
    text: "柯城区"
  },
  "330803": {
    code: "330803",
    text: "衢江区"
  },
  "330821": {
    code: "330821",
    text: "衢县"
  },
  "330822": {
    code: "330822",
    text: "常山县"
  },
  "330823": {
    code: "330823",
    text: "江山县"
  },
  "330824": {
    code: "330824",
    text: "开化县"
  },
  "330825": {
    code: "330825",
    text: "龙游县"
  },
  "330881": {
    code: "330881",
    text: "江山市"
  },
  //浙江省 舟山市
  "330901": {
    code: "330901",
    text: "市辖区"
  },
  "330902": {
    code: "330902",
    text: "定海区"
  },
  "330903": {
    code: "330903",
    text: "普陀区"
  },
  "330921": {
    code: "330921",
    text: "岱山县"
  },
  "330922": {
    code: "330922",
    text: "嵊泗县"
  },
  //浙江省 台州市
  "331001": {
    code: "331001",
    text: "市辖区"
  },
  "331002": {
    code: "331002",
    text: "椒江区"
  },
  "331003": {
    code: "331003",
    text: "黄岩区"
  },
  "331004": {
    code: "331004",
    text: "路桥区"
  },
  "331021": {
    code: "331021",
    text: "玉环县"
  },
  "331022": {
    code: "331022",
    text: "三门县"
  },
  "331023": {
    code: "331023",
    text: "天台县"
  },
  "331024": {
    code: "331024",
    text: "仙居县"
  },
  "331081": {
    code: "331081",
    text: "温岭市"
  },
  "331082": {
    code: "331082",
    text: "临海市"
  },
  //浙江省 丽水市
  "331101": {
    code: "331101",
    text: "市辖区"
  },
  "331102": {
    code: "331102",
    text: "莲都区"
  },
  "331121": {
    code: "331121",
    text: "青田县"
  },
  "331122": {
    code: "331122",
    text: "缙云县"
  },
  "331123": {
    code: "331123",
    text: "遂昌县"
  },
  "331124": {
    code: "331124",
    text: "松阳县"
  },
  "331125": {
    code: "331125",
    text: "云和县"
  },
  "331126": {
    code: "331126",
    text: "庆元县"
  },
  "331127": {
    code: "331127",
    text: "景宁畲族自治县"
  },
  "331181": {
    code: "331181",
    text: "龙泉市"
  },
  //安徽省 
  //安徽省 合肥市
  "340101": {
    code: "340101",
    text: "市辖区"
  },
  "340102": {
    code: "340102",
    text: "瑶海区"
  },
  "340103": {
    code: "340103",
    text: "庐阳区"
  },
  "340104": {
    code: "340104",
    text: "蜀山区"
  },
  "340111": {
    code: "340111",
    text: "包河区"
  },
  "340121": {
    code: "340121",
    text: "长丰县"
  },
  "340122": {
    code: "340122",
    text: "肥东县"
  },
  "340123": {
    code: "340123",
    text: "肥西县"
  },
  "340124": {
    code: "340124",
    text: "庐江县"
  },
  "340181": {
    code: "340181",
    text: "巢湖市"
  },
  //安徽省 芜湖市
  "340201": {
    code: "340201",
    text: "市辖区"
  },
  "340202": {
    code: "340202",
    text: "镜湖区"
  },
  "340203": {
    code: "340203",
    text: "弋江区"
  },
  "340204": {
    code: "340204",
    text: "新芜区"
  },
  "340205": {
    code: "340205",
    text: "裕溪口区"
  },
  "340206": {
    code: "340206",
    text: "四褐山区"
  },
  "340207": {
    code: "340207",
    text: "鸠江区"
  },
  "340208": {
    code: "340208",
    text: "三山区"
  },
  "340221": {
    code: "340221",
    text: "芜湖县"
  },
  "340222": {
    code: "340222",
    text: "繁昌县"
  },
  "340223": {
    code: "340223",
    text: "南陵县"
  },
  "340224": {
    code: "340224",
    text: "青阳县"
  },
  "340225": {
    code: "340225",
    text: "无为县"
  },
  //安徽省 蚌埠市
  "340301": {
    code: "340301",
    text: "市辖区"
  },
  "340302": {
    code: "340302",
    text: "龙子湖区"
  },
  "340303": {
    code: "340303",
    text: "蚌山区"
  },
  "340304": {
    code: "340304",
    text: "禹会区"
  },
  "340311": {
    code: "340311",
    text: "淮上区"
  },
  "340321": {
    code: "340321",
    text: "怀远县"
  },
  "340322": {
    code: "340322",
    text: "五河县"
  },
  "340323": {
    code: "340323",
    text: "固镇县"
  },
  //安徽省 淮南市
  "340401": {
    code: "340401",
    text: "市辖区"
  },
  "340402": {
    code: "340402",
    text: "大通区"
  },
  "340403": {
    code: "340403",
    text: "田家庵区"
  },
  "340404": {
    code: "340404",
    text: "谢家集区"
  },
  "340405": {
    code: "340405",
    text: "八公山区"
  },
  "340406": {
    code: "340406",
    text: "潘集区"
  },
  "340421": {
    code: "340421",
    text: "凤台县"
  },
  "340422": {
    code: "340422",
    text: "寿县"
  },
  //安徽省 马鞍山市
  "340501": {
    code: "340501",
    text: "市辖区"
  },
  "340502": {
    code: "340502",
    text: "金家庄区"
  },
  "340503": {
    code: "340503",
    text: "花山区"
  },
  "340504": {
    code: "340504",
    text: "雨山区"
  },
  "340505": {
    code: "340505",
    text: "向山区"
  },
  "340506": {
    code: "340506",
    text: "博望区"
  },
  "340521": {
    code: "340521",
    text: "当涂县"
  },
  "340522": {
    code: "340522",
    text: "含山县"
  },
  "340523": {
    code: "340523",
    text: "和县"
  },
  //安徽省 淮北市
  "340601": {
    code: "340601",
    text: "市辖区"
  },
  "340602": {
    code: "340602",
    text: "杜集区"
  },
  "340603": {
    code: "340603",
    text: "相山区"
  },
  "340604": {
    code: "340604",
    text: "烈山区"
  },
  "340621": {
    code: "340621",
    text: "濉溪县"
  },
  //安徽省 铜陵市
  "340701": {
    code: "340701",
    text: "市辖区"
  },
  "340702": {
    code: "340702",
    text: "铜官山区"
  },
  "340703": {
    code: "340703",
    text: "狮子山区"
  },
  "340705": {
    code: "340705",
    text: "铜官区"
  },
  "340706": {
    code: "340706",
    text: "义安区"
  },
  "340711": {
    code: "340711",
    text: "郊区"
  },
  "340721": {
    code: "340721",
    text: "铜陵县"
  },
  "340722": {
    code: "340722",
    text: "枞阳县"
  },
  //安徽省 安庆市
  "340801": {
    code: "340801",
    text: "市辖区"
  },
  "340802": {
    code: "340802",
    text: "迎江区"
  },
  "340803": {
    code: "340803",
    text: "大观区"
  },
  "340811": {
    code: "340811",
    text: "宜秀区"
  },
  "340821": {
    code: "340821",
    text: "桐城县"
  },
  "340822": {
    code: "340822",
    text: "怀宁县"
  },
  "340823": {
    code: "340823",
    text: "枞阳县"
  },
  "340824": {
    code: "340824",
    text: "潜山县"
  },
  "340825": {
    code: "340825",
    text: "太湖县"
  },
  "340826": {
    code: "340826",
    text: "宿松县"
  },
  "340827": {
    code: "340827",
    text: "望江县"
  },
  "340828": {
    code: "340828",
    text: "岳西县"
  },
  "340881": {
    code: "340881",
    text: "桐城市"
  },
  //安徽省 黄山市
  "341001": {
    code: "341001",
    text: "市辖区"
  },
  "341002": {
    code: "341002",
    text: "屯溪区"
  },
  "341003": {
    code: "341003",
    text: "黄山区"
  },
  "341004": {
    code: "341004",
    text: "徽州区"
  },
  "341021": {
    code: "341021",
    text: "歙县"
  },
  "341022": {
    code: "341022",
    text: "休宁县"
  },
  "341023": {
    code: "341023",
    text: "黟县"
  },
  "341024": {
    code: "341024",
    text: "祁门县"
  },
  //安徽省 滁州市
  "341101": {
    code: "341101",
    text: "市辖区"
  },
  "341102": {
    code: "341102",
    text: "琅琊区"
  },
  "341103": {
    code: "341103",
    text: "南谯区"
  },
  "341121": {
    code: "341121",
    text: "天长县"
  },
  "341122": {
    code: "341122",
    text: "来安县"
  },
  "341124": {
    code: "341124",
    text: "全椒县"
  },
  "341125": {
    code: "341125",
    text: "定远县"
  },
  "341126": {
    code: "341126",
    text: "凤阳县"
  },
  "341127": {
    code: "341127",
    text: "嘉山县"
  },
  "341181": {
    code: "341181",
    text: "天长市"
  },
  "341182": {
    code: "341182",
    text: "明光市"
  },
  //安徽省 阜阳市
  "341201": {
    code: "341201",
    text: "市辖区"
  },
  "341202": {
    code: "341202",
    text: "颍州区"
  },
  "341203": {
    code: "341203",
    text: "颍东区"
  },
  "341204": {
    code: "341204",
    text: "颍泉区"
  },
  "341221": {
    code: "341221",
    text: "临泉县"
  },
  "341222": {
    code: "341222",
    text: "太和县"
  },
  "341223": {
    code: "341223",
    text: "涡阳县"
  },
  "341224": {
    code: "341224",
    text: "蒙城县"
  },
  "341225": {
    code: "341225",
    text: "阜南县"
  },
  "341226": {
    code: "341226",
    text: "颍上县"
  },
  "341227": {
    code: "341227",
    text: "利辛县"
  },
  "341282": {
    code: "341282",
    text: "界首市"
  },
  //安徽省 宿州市
  "341301": {
    code: "341301",
    text: "市辖区"
  },
  "341302": {
    code: "341302",
    text: "埇桥区"
  },
  "341321": {
    code: "341321",
    text: "砀山县"
  },
  "341322": {
    code: "341322",
    text: "萧县"
  },
  "341323": {
    code: "341323",
    text: "灵璧县"
  },
  "341324": {
    code: "341324",
    text: "泗县"
  },
  //安徽省 六安市
  "341501": {
    code: "341501",
    text: "市辖区"
  },
  "341502": {
    code: "341502",
    text: "金安区"
  },
  "341503": {
    code: "341503",
    text: "裕安区"
  },
  "341504": {
    code: "341504",
    text: "叶集区"
  },
  "341521": {
    code: "341521",
    text: "寿县"
  },
  "341522": {
    code: "341522",
    text: "霍邱县"
  },
  "341523": {
    code: "341523",
    text: "舒城县"
  },
  "341524": {
    code: "341524",
    text: "金寨县"
  },
  "341525": {
    code: "341525",
    text: "霍山县"
  },
  //安徽省 亳州市
  "341601": {
    code: "341601",
    text: "市辖区"
  },
  "341602": {
    code: "341602",
    text: "谯城区"
  },
  "341621": {
    code: "341621",
    text: "涡阳县"
  },
  "341622": {
    code: "341622",
    text: "蒙城县"
  },
  "341623": {
    code: "341623",
    text: "利辛县"
  },
  //安徽省 池州市
  "341701": {
    code: "341701",
    text: "市辖区"
  },
  "341702": {
    code: "341702",
    text: "贵池区"
  },
  "341721": {
    code: "341721",
    text: "东至县"
  },
  "341722": {
    code: "341722",
    text: "石台县"
  },
  "341723": {
    code: "341723",
    text: "青阳县"
  },
  //安徽省 宣城市
  "341801": {
    code: "341801",
    text: "市辖区"
  },
  "341802": {
    code: "341802",
    text: "宣州区"
  },
  "341821": {
    code: "341821",
    text: "郎溪县"
  },
  "341822": {
    code: "341822",
    text: "广德县"
  },
  "341823": {
    code: "341823",
    text: "泾县"
  },
  "341824": {
    code: "341824",
    text: "绩溪县"
  },
  "341825": {
    code: "341825",
    text: "旌德县"
  },
  "341881": {
    code: "341881",
    text: "宁国市"
  },
  //福建省 
  //福建省 福州市
  "350101": {
    code: "350101",
    text: "市辖区"
  },
  "350102": {
    code: "350102",
    text: "鼓楼区"
  },
  "350103": {
    code: "350103",
    text: "台江区"
  },
  "350104": {
    code: "350104",
    text: "仓山区"
  },
  "350105": {
    code: "350105",
    text: "马尾区"
  },
  "350111": {
    code: "350111",
    text: "晋安区"
  },
  "350121": {
    code: "350121",
    text: "闽侯县"
  },
  "350122": {
    code: "350122",
    text: "连江县"
  },
  "350123": {
    code: "350123",
    text: "罗源县"
  },
  "350124": {
    code: "350124",
    text: "闽清县"
  },
  "350125": {
    code: "350125",
    text: "永泰县"
  },
  "350126": {
    code: "350126",
    text: "长乐县"
  },
  "350127": {
    code: "350127",
    text: "福清县"
  },
  "350128": {
    code: "350128",
    text: "平潭县"
  },
  "350181": {
    code: "350181",
    text: "福清市"
  },
  "350182": {
    code: "350182",
    text: "长乐市"
  },
  //福建省 厦门市
  "350201": {
    code: "350201",
    text: "市辖区"
  },
  "350202": {
    code: "350202",
    text: "鼓浪屿区"
  },
  "350203": {
    code: "350203",
    text: "思明区"
  },
  "350204": {
    code: "350204",
    text: "开元区"
  },
  "350205": {
    code: "350205",
    text: "海沧区"
  },
  "350206": {
    code: "350206",
    text: "湖里区"
  },
  "350211": {
    code: "350211",
    text: "集美区"
  },
  "350212": {
    code: "350212",
    text: "同安区"
  },
  "350213": {
    code: "350213",
    text: "翔安区"
  },
  //福建省 莆田市
  "350301": {
    code: "350301",
    text: "市辖区"
  },
  "350302": {
    code: "350302",
    text: "城厢区"
  },
  "350303": {
    code: "350303",
    text: "涵江区"
  },
  "350304": {
    code: "350304",
    text: "荔城区"
  },
  "350305": {
    code: "350305",
    text: "秀屿区"
  },
  "350321": {
    code: "350321",
    text: "莆田县"
  },
  "350322": {
    code: "350322",
    text: "仙游县"
  },
  "350323": {
    code: "350323",
    text: "仙游县"
  },
  //福建省 三明市
  "350401": {
    code: "350401",
    text: "市辖区"
  },
  "350402": {
    code: "350402",
    text: "梅列区"
  },
  "350403": {
    code: "350403",
    text: "三元区"
  },
  "350404": {
    code: "350404",
    text: "永安市"
  },
  "350421": {
    code: "350421",
    text: "明溪县"
  },
  "350422": {
    code: "350422",
    text: "永安县"
  },
  "350423": {
    code: "350423",
    text: "清流县"
  },
  "350424": {
    code: "350424",
    text: "宁化县"
  },
  "350425": {
    code: "350425",
    text: "大田县"
  },
  "350426": {
    code: "350426",
    text: "尤溪县"
  },
  "350427": {
    code: "350427",
    text: "沙县"
  },
  "350428": {
    code: "350428",
    text: "将乐县"
  },
  "350429": {
    code: "350429",
    text: "泰宁县"
  },
  "350430": {
    code: "350430",
    text: "建宁县"
  },
  "350481": {
    code: "350481",
    text: "永安市"
  },
  //福建省 泉州市
  "350501": {
    code: "350501",
    text: "市辖区"
  },
  "350502": {
    code: "350502",
    text: "鲤城区"
  },
  "350503": {
    code: "350503",
    text: "丰泽区"
  },
  "350504": {
    code: "350504",
    text: "洛江区"
  },
  "350505": {
    code: "350505",
    text: "泉港区"
  },
  "350521": {
    code: "350521",
    text: "惠安县"
  },
  "350522": {
    code: "350522",
    text: "晋江县"
  },
  "350523": {
    code: "350523",
    text: "南安县"
  },
  "350524": {
    code: "350524",
    text: "安溪县"
  },
  "350525": {
    code: "350525",
    text: "永春县"
  },
  "350526": {
    code: "350526",
    text: "德化县"
  },
  "350527": {
    code: "350527",
    text: "金门县"
  },
  "350581": {
    code: "350581",
    text: "石狮市"
  },
  "350582": {
    code: "350582",
    text: "晋江市"
  },
  "350583": {
    code: "350583",
    text: "南安市"
  },
  //福建省 漳州市
  "350601": {
    code: "350601",
    text: "市辖区"
  },
  "350602": {
    code: "350602",
    text: "芗城区"
  },
  "350603": {
    code: "350603",
    text: "龙文区"
  },
  "350621": {
    code: "350621",
    text: "龙海县"
  },
  "350622": {
    code: "350622",
    text: "云霄县"
  },
  "350623": {
    code: "350623",
    text: "漳浦县"
  },
  "350624": {
    code: "350624",
    text: "诏安县"
  },
  "350625": {
    code: "350625",
    text: "长泰县"
  },
  "350626": {
    code: "350626",
    text: "东山县"
  },
  "350627": {
    code: "350627",
    text: "南靖县"
  },
  "350628": {
    code: "350628",
    text: "平和县"
  },
  "350629": {
    code: "350629",
    text: "华安县"
  },
  "350681": {
    code: "350681",
    text: "龙海市"
  },
  //福建省 南平市
  "350701": {
    code: "350701",
    text: "市辖区"
  },
  "350702": {
    code: "350702",
    text: "延平区"
  },
  "350703": {
    code: "350703",
    text: "建阳区"
  },
  "350721": {
    code: "350721",
    text: "顺昌县"
  },
  "350722": {
    code: "350722",
    text: "浦城县"
  },
  "350723": {
    code: "350723",
    text: "光泽县"
  },
  "350724": {
    code: "350724",
    text: "松溪县"
  },
  "350725": {
    code: "350725",
    text: "政和县"
  },
  "350781": {
    code: "350781",
    text: "邵武市"
  },
  "350782": {
    code: "350782",
    text: "武夷山市"
  },
  "350783": {
    code: "350783",
    text: "建瓯市"
  },
  "350784": {
    code: "350784",
    text: "建阳市"
  },
  //福建省 龙岩市
  "350801": {
    code: "350801",
    text: "市辖区"
  },
  "350802": {
    code: "350802",
    text: "新罗区"
  },
  "350803": {
    code: "350803",
    text: "永定区"
  },
  "350821": {
    code: "350821",
    text: "长汀县"
  },
  "350822": {
    code: "350822",
    text: "永定县"
  },
  "350823": {
    code: "350823",
    text: "上杭县"
  },
  "350824": {
    code: "350824",
    text: "武平县"
  },
  "350825": {
    code: "350825",
    text: "连城县"
  },
  "350881": {
    code: "350881",
    text: "漳平市"
  },
  //福建省 宁德市
  "350901": {
    code: "350901",
    text: "市辖区"
  },
  "350902": {
    code: "350902",
    text: "蕉城区"
  },
  "350921": {
    code: "350921",
    text: "霞浦县"
  },
  "350922": {
    code: "350922",
    text: "古田县"
  },
  "350923": {
    code: "350923",
    text: "屏南县"
  },
  "350924": {
    code: "350924",
    text: "寿宁县"
  },
  "350925": {
    code: "350925",
    text: "周宁县"
  },
  "350926": {
    code: "350926",
    text: "柘荣县"
  },
  "350981": {
    code: "350981",
    text: "福安市"
  },
  "350982": {
    code: "350982",
    text: "福鼎市"
  },
  //江西省 
  //江西省 南昌市
  "360101": {
    code: "360101",
    text: "市辖区"
  },
  "360102": {
    code: "360102",
    text: "东湖区"
  },
  "360103": {
    code: "360103",
    text: "西湖区"
  },
  "360104": {
    code: "360104",
    text: "青云谱区"
  },
  "360105": {
    code: "360105",
    text: "湾里区"
  },
  "360111": {
    code: "360111",
    text: "青山湖区"
  },
  "360112": {
    code: "360112",
    text: "新建区"
  },
  "360121": {
    code: "360121",
    text: "南昌县"
  },
  "360122": {
    code: "360122",
    text: "新建县"
  },
  "360123": {
    code: "360123",
    text: "安义县"
  },
  "360124": {
    code: "360124",
    text: "进贤县"
  },
  //江西省 景德镇市
  "360201": {
    code: "360201",
    text: "市辖区"
  },
  "360202": {
    code: "360202",
    text: "昌江区"
  },
  "360203": {
    code: "360203",
    text: "珠山区"
  },
  "360221": {
    code: "360221",
    text: "乐平县"
  },
  "360222": {
    code: "360222",
    text: "浮梁县"
  },
  "360281": {
    code: "360281",
    text: "乐平市"
  },
  //江西省 萍乡市
  "360301": {
    code: "360301",
    text: "市辖区"
  },
  "360302": {
    code: "360302",
    text: "安源区"
  },
  "360311": {
    code: "360311",
    text: "上栗区"
  },
  "360312": {
    code: "360312",
    text: "芦溪区"
  },
  "360313": {
    code: "360313",
    text: "湘东区"
  },
  "360321": {
    code: "360321",
    text: "莲花县"
  },
  "360322": {
    code: "360322",
    text: "上栗县"
  },
  "360323": {
    code: "360323",
    text: "芦溪县"
  },
  //江西省 九江市
  "360401": {
    code: "360401",
    text: "市辖区"
  },
  "360402": {
    code: "360402",
    text: "庐山区"
  },
  "360403": {
    code: "360403",
    text: "浔阳区"
  },
  "360421": {
    code: "360421",
    text: "九江县"
  },
  "360422": {
    code: "360422",
    text: "瑞昌县"
  },
  "360423": {
    code: "360423",
    text: "武宁县"
  },
  "360424": {
    code: "360424",
    text: "修水县"
  },
  "360425": {
    code: "360425",
    text: "永修县"
  },
  "360426": {
    code: "360426",
    text: "德安县"
  },
  "360427": {
    code: "360427",
    text: "星子县"
  },
  "360428": {
    code: "360428",
    text: "都昌县"
  },
  "360429": {
    code: "360429",
    text: "湖口县"
  },
  "360430": {
    code: "360430",
    text: "彭泽县"
  },
  "360481": {
    code: "360481",
    text: "瑞昌市"
  },
  "360482": {
    code: "360482",
    text: "共青城市"
  },
  "360483": {
    code: "360483",
    text: "庐山市"
  },
  //江西省 新余市
  "360501": {
    code: "360501",
    text: "市辖区"
  },
  "360502": {
    code: "360502",
    text: "渝水区"
  },
  "360521": {
    code: "360521",
    text: "分宜县"
  },
  //江西省 鹰潭市
  "360601": {
    code: "360601",
    text: "市辖区"
  },
  "360602": {
    code: "360602",
    text: "月湖区"
  },
  "360621": {
    code: "360621",
    text: "贵溪县"
  },
  "360622": {
    code: "360622",
    text: "余江县"
  },
  "360681": {
    code: "360681",
    text: "贵溪市"
  },
  //江西省 赣州市
  "360701": {
    code: "360701",
    text: "市辖区"
  },
  "360702": {
    code: "360702",
    text: "章贡区"
  },
  "360703": {
    code: "360703",
    text: "南康区"
  },
  "360721": {
    code: "360721",
    text: "赣县"
  },
  "360722": {
    code: "360722",
    text: "信丰县"
  },
  "360723": {
    code: "360723",
    text: "大余县"
  },
  "360724": {
    code: "360724",
    text: "上犹县"
  },
  "360725": {
    code: "360725",
    text: "崇义县"
  },
  "360726": {
    code: "360726",
    text: "安远县"
  },
  "360727": {
    code: "360727",
    text: "龙南县"
  },
  "360728": {
    code: "360728",
    text: "定南县"
  },
  "360729": {
    code: "360729",
    text: "全南县"
  },
  "360730": {
    code: "360730",
    text: "宁都县"
  },
  "360731": {
    code: "360731",
    text: "于都县"
  },
  "360732": {
    code: "360732",
    text: "兴国县"
  },
  "360733": {
    code: "360733",
    text: "会昌县"
  },
  "360734": {
    code: "360734",
    text: "寻乌县"
  },
  "360735": {
    code: "360735",
    text: "石城县"
  },
  "360781": {
    code: "360781",
    text: "瑞金市"
  },
  //江西省 吉安市
  "360801": {
    code: "360801",
    text: "市辖区"
  },
  "360802": {
    code: "360802",
    text: "吉州区"
  },
  "360803": {
    code: "360803",
    text: "青原区"
  },
  "360821": {
    code: "360821",
    text: "吉安县"
  },
  "360822": {
    code: "360822",
    text: "吉水县"
  },
  "360823": {
    code: "360823",
    text: "峡江县"
  },
  "360824": {
    code: "360824",
    text: "新干县"
  },
  "360825": {
    code: "360825",
    text: "永丰县"
  },
  "360826": {
    code: "360826",
    text: "泰和县"
  },
  "360827": {
    code: "360827",
    text: "遂川县"
  },
  "360828": {
    code: "360828",
    text: "万安县"
  },
  "360829": {
    code: "360829",
    text: "安福县"
  },
  "360830": {
    code: "360830",
    text: "永新县"
  },
  "360881": {
    code: "360881",
    text: "井冈山市"
  },
  "360882": {
    code: "360882",
    text: "南康市"
  },
  //江西省 宜春市
  "360901": {
    code: "360901",
    text: "市辖区"
  },
  "360902": {
    code: "360902",
    text: "袁州区"
  },
  "360921": {
    code: "360921",
    text: "奉新县"
  },
  "360922": {
    code: "360922",
    text: "万载县"
  },
  "360923": {
    code: "360923",
    text: "上高县"
  },
  "360924": {
    code: "360924",
    text: "宜丰县"
  },
  "360925": {
    code: "360925",
    text: "靖安县"
  },
  "360926": {
    code: "360926",
    text: "铜鼓县"
  },
  "360981": {
    code: "360981",
    text: "丰城市"
  },
  "360982": {
    code: "360982",
    text: "樟树市"
  },
  "360983": {
    code: "360983",
    text: "高安市"
  },
  //江西省 抚州市
  "361001": {
    code: "361001",
    text: "市辖区"
  },
  "361002": {
    code: "361002",
    text: "临川区"
  },
  "361021": {
    code: "361021",
    text: "南城县"
  },
  "361022": {
    code: "361022",
    text: "黎川县"
  },
  "361023": {
    code: "361023",
    text: "南丰县"
  },
  "361024": {
    code: "361024",
    text: "崇仁县"
  },
  "361025": {
    code: "361025",
    text: "乐安县"
  },
  "361026": {
    code: "361026",
    text: "宜黄县"
  },
  "361027": {
    code: "361027",
    text: "金溪县"
  },
  "361028": {
    code: "361028",
    text: "资溪县"
  },
  "361029": {
    code: "361029",
    text: "东乡县"
  },
  "361030": {
    code: "361030",
    text: "广昌县"
  },
  //江西省 上饶市
  "361101": {
    code: "361101",
    text: "市辖区"
  },
  "361102": {
    code: "361102",
    text: "信州区"
  },
  "361103": {
    code: "361103",
    text: "广丰区"
  },
  "361121": {
    code: "361121",
    text: "上饶县"
  },
  "361122": {
    code: "361122",
    text: "广丰县"
  },
  "361123": {
    code: "361123",
    text: "玉山县"
  },
  "361124": {
    code: "361124",
    text: "铅山县"
  },
  "361125": {
    code: "361125",
    text: "横峰县"
  },
  "361126": {
    code: "361126",
    text: "弋阳县"
  },
  "361127": {
    code: "361127",
    text: "余干县"
  },
  "361128": {
    code: "361128",
    text: "鄱阳县"
  },
  "361129": {
    code: "361129",
    text: "万年县"
  },
  "361130": {
    code: "361130",
    text: "婺源县"
  },
  "361181": {
    code: "361181",
    text: "德兴市"
  },
  //山东省
  //山东省 济南市
  "370101": {
    code: "370101",
    text: "市辖区"
  },
  "370102": {
    code: "370102",
    text: "历下区"
  },
  "370103": {
    code: "370103",
    text: "市中区"
  },
  "370104": {
    code: "370104",
    text: "槐荫区"
  },
  "370105": {
    code: "370105",
    text: "天桥区"
  },
  "370111": {
    code: "370111",
    text: "郊区"
  },
  "370112": {
    code: "370112",
    text: "历城区"
  },
  "370113": {
    code: "370113",
    text: "长清区"
  },
  "370124": {
    code: "370124",
    text: "平阴县"
  },
  "370125": {
    code: "370125",
    text: "济阳县"
  },
  "370126": {
    code: "370126",
    text: "商河县"
  },
  "370181": {
    code: "370181",
    text: "章丘市"
  },
  //山东省 青岛市
  "370201": {
    code: "370201",
    text: "市辖区"
  },
  "370202": {
    code: "370202",
    text: "市南区"
  },
  "370203": {
    code: "370203",
    text: "市北区"
  },
  "370204": {
    code: "370204",
    text: "台东区"
  },
  "370205": {
    code: "370205",
    text: "四方区"
  },
  "370206": {
    code: "370206",
    text: "沧口区"
  },
  "370211": {
    code: "370211",
    text: "黄岛区"
  },
  "370212": {
    code: "370212",
    text: "崂山区"
  },
  "370213": {
    code: "370213",
    text: "李沧区"
  },
  "370214": {
    code: "370214",
    text: "城阳区"
  },
  "370281": {
    code: "370281",
    text: "胶州市"
  },
  "370282": {
    code: "370282",
    text: "即墨市"
  },
  "370283": {
    code: "370283",
    text: "平度市"
  },
  "370284": {
    code: "370284",
    text: "胶南市"
  },
  "370285": {
    code: "370285",
    text: "莱西市"
  },
  //山东省 淄博市
  "370301": {
    code: "370301",
    text: "市辖区"
  },
  "370302": {
    code: "370302",
    text: "淄川区"
  },
  "370303": {
    code: "370303",
    text: "张店区"
  },
  "370304": {
    code: "370304",
    text: "博山区"
  },
  "370305": {
    code: "370305",
    text: "临淄区"
  },
  "370306": {
    code: "370306",
    text: "周村区"
  },
  "370321": {
    code: "370321",
    text: "桓台县"
  },
  "370322": {
    code: "370322",
    text: "高青县"
  },
  "370323": {
    code: "370323",
    text: "沂源县"
  },
  //山东省 枣庄市
  "370401": {
    code: "370401",
    text: "市辖区"
  },
  "370402": {
    code: "370402",
    text: "市中区"
  },
  "370403": {
    code: "370403",
    text: "薛城区"
  },
  "370404": {
    code: "370404",
    text: "峄城区"
  },
  "370405": {
    code: "370405",
    text: "台儿庄区"
  },
  "370406": {
    code: "370406",
    text: "山亭区"
  },
  "370481": {
    code: "370481",
    text: "滕州市"
  },
  //山东省 东营市
  "370501": {
    code: "370501",
    text: "市辖区"
  },
  "370502": {
    code: "370502",
    text: "东营区"
  },
  "370503": {
    code: "370503",
    text: "河口区"
  },
  "370521": {
    code: "370521",
    text: "垦利县"
  },
  "370522": {
    code: "370522",
    text: "利津县"
  },
  "370523": {
    code: "370523",
    text: "广饶县"
  },
  //山东省 烟台市
  "370601": {
    code: "370601",
    text: "市辖区"
  },
  "370602": {
    code: "370602",
    text: "芝罘区"
  },
  "370611": {
    code: "370611",
    text: "福山区"
  },
  "370612": {
    code: "370612",
    text: "牟平区"
  },
  "370613": {
    code: "370613",
    text: "莱山区"
  },
  "370631": {
    code: "370631",
    text: "牟平县"
  },
  "370632": {
    code: "370632",
    text: "文登县"
  },
  "370633": {
    code: "370633",
    text: "荣城县"
  },
  "370634": {
    code: "370634",
    text: "长岛县"
  },
  "370681": {
    code: "370681",
    text: "龙口市"
  },
  "370682": {
    code: "370682",
    text: "莱阳市"
  },
  "370683": {
    code: "370683",
    text: "莱州市"
  },
  "370684": {
    code: "370684",
    text: "蓬莱市"
  },
  "370685": {
    code: "370685",
    text: "招远市"
  },
  "370686": {
    code: "370686",
    text: "栖霞市"
  },
  "370687": {
    code: "370687",
    text: "海阳市"
  },
  //山东省 潍坊市
  "370701": {
    code: "370701",
    text: "市辖区"
  },
  "370702": {
    code: "370702",
    text: "潍城区"
  },
  "370703": {
    code: "370703",
    text: "寒亭区"
  },
  "370704": {
    code: "370704",
    text: "坊子区"
  },
  "370705": {
    code: "370705",
    text: "奎文区"
  },
  "370721": {
    code: "370721",
    text: "益都县"
  },
  "370722": {
    code: "370722",
    text: "安丘县"
  },
  "370723": {
    code: "370723",
    text: "寿光县"
  },
  "370724": {
    code: "370724",
    text: "临朐县"
  },
  "370725": {
    code: "370725",
    text: "昌乐县"
  },
  "370726": {
    code: "370726",
    text: "昌邑县"
  },
  "370727": {
    code: "370727",
    text: "高密县"
  },
  "370728": {
    code: "370728",
    text: "诸城县"
  },
  "370729": {
    code: "370729",
    text: "五莲县"
  },
  "370781": {
    code: "370781",
    text: "青州市"
  },
  "370782": {
    code: "370782",
    text: "诸城市"
  },
  "370783": {
    code: "370783",
    text: "寿光市"
  },
  "370784": {
    code: "370784",
    text: "安丘市"
  },
  "370785": {
    code: "370785",
    text: "高密市"
  },
  "370786": {
    code: "370786",
    text: "昌邑市"
  },
  //山东省 济宁市
  "370801": {
    code: "370801",
    text: "市辖区"
  },
  "370802": {
    code: "370802",
    text: "市中区"
  },
  "370803": {
    code: "370803",
    text: "兖州区"
  },
  "370811": {
    code: "370811",
    text: "任城区"
  },
  "370812": {
    code: "370812",
    text: "兖州区"
  },
  "370822": {
    code: "370822",
    text: "兖州县"
  },
  "370823": {
    code: "370823",
    text: "曲阜县"
  },
  "370825": {
    code: "370825",
    text: "邹县"
  },
  "370826": {
    code: "370826",
    text: "微山县"
  },
  "370827": {
    code: "370827",
    text: "鱼台县"
  },
  "370828": {
    code: "370828",
    text: "金乡县"
  },
  "370829": {
    code: "370829",
    text: "嘉祥县"
  },
  "370830": {
    code: "370830",
    text: "汶上县"
  },
  "370831": {
    code: "370831",
    text: "泗水县"
  },
  "370832": {
    code: "370832",
    text: "梁山县"
  },
  "370881": {
    code: "370881",
    text: "曲阜市"
  },
  "370882": {
    code: "370882",
    text: "兖州市"
  },
  "370883": {
    code: "370883",
    text: "邹城市"
  },
  //山东省 泰安市
  "370901": {
    code: "370901",
    text: "市辖区"
  },
  "370902": {
    code: "370902",
    text: "泰山区"
  },
  "370903": {
    code: "370903",
    text: "岱岳区"
  },
  "370911": {
    code: "370911",
    text: "岱岳区"
  },
  "370921": {
    code: "370921",
    text: "宁阳县"
  },
  "370922": {
    code: "370922",
    text: "肥城县"
  },
  "370923": {
    code: "370923",
    text: "东平县"
  },
  "370981": {
    code: "370981",
    text: "莱芜市"
  },
  "370982": {
    code: "370982",
    text: "新泰市"
  },
  "370983": {
    code: "370983",
    text: "肥城市"
  },
  //山东省 威海市
  "371001": {
    code: "371001",
    text: "市辖区"
  },
  "371002": {
    code: "371002",
    text: "环翠区"
  },
  "371003": {
    code: "371003",
    text: "文登区"
  },
  "371081": {
    code: "371081",
    text: "文登市"
  },
  "371082": {
    code: "371082",
    text: "荣成市"
  },
  "371083": {
    code: "371083",
    text: "乳山市"
  },
  //山东省 日照市
  "371101": {
    code: "371101",
    text: "市辖区"
  },
  "371102": {
    code: "371102",
    text: "东港区"
  },
  "371103": {
    code: "371103",
    text: "岚山区"
  },
  "371121": {
    code: "371121",
    text: "五莲县"
  },
  "371122": {
    code: "371122",
    text: "莒县"
  },
  //山东省 莱芜市
  "371201": {
    code: "371201",
    text: "市辖区"
  },
  "371202": {
    code: "371202",
    text: "莱城区"
  },
  "371203": {
    code: "371203",
    text: "钢城区"
  },
  //山东省 临沂市
  "371301": {
    code: "371301",
    text: "市辖区"
  },
  "371302": {
    code: "371302",
    text: "兰山区"
  },
  "371311": {
    code: "371311",
    text: "罗庄区"
  },
  "371312": {
    code: "371312",
    text: "河东区"
  },
  "371321": {
    code: "371321",
    text: "沂南县"
  },
  "371322": {
    code: "371322",
    text: "郯城县"
  },
  "371323": {
    code: "371323",
    text: "沂水县"
  },
  "371324": {
    code: "371324",
    text: "兰陵县"
  },
  "371325": {
    code: "371325",
    text: "费县"
  },
  "371326": {
    code: "371326",
    text: "平邑县"
  },
  "371327": {
    code: "371327",
    text: "莒南县"
  },
  "371328": {
    code: "371328",
    text: "蒙阴县"
  },
  "371329": {
    code: "371329",
    text: "临沭县"
  },
  //山东省 德州市
  "371401": {
    code: "371401",
    text: "市辖区"
  },
  "371402": {
    code: "371402",
    text: "德城区"
  },
  "371403": {
    code: "371403",
    text: "陵城区"
  },
  "371421": {
    code: "371421",
    text: "陵县"
  },
  "371422": {
    code: "371422",
    text: "宁津县"
  },
  "371423": {
    code: "371423",
    text: "庆云县"
  },
  "371424": {
    code: "371424",
    text: "临邑县"
  },
  "371425": {
    code: "371425",
    text: "齐河县"
  },
  "371426": {
    code: "371426",
    text: "平原县"
  },
  "371427": {
    code: "371427",
    text: "夏津县"
  },
  "371428": {
    code: "371428",
    text: "武城县"
  },
  "371481": {
    code: "371481",
    text: "乐陵市"
  },
  "371482": {
    code: "371482",
    text: "禹城市"
  },
  //山东省 聊城市
  "371501": {
    code: "371501",
    text: "市辖区"
  },
  "371502": {
    code: "371502",
    text: "东昌府区"
  },
  "371521": {
    code: "371521",
    text: "阳谷县"
  },
  "371522": {
    code: "371522",
    text: "莘县"
  },
  "371523": {
    code: "371523",
    text: "茌平县"
  },
  "371524": {
    code: "371524",
    text: "东阿县"
  },
  "371525": {
    code: "371525",
    text: "冠县"
  },
  "371526": {
    code: "371526",
    text: "高唐县"
  },
  "371581": {
    code: "371581",
    text: "临清市"
  },
  //山东省 滨州市
  "371601": {
    code: "371601",
    text: "市辖区"
  },
  "371602": {
    code: "371602",
    text: "滨城区"
  },
  "371603": {
    code: "371603",
    text: "沾化区"
  },
  "371621": {
    code: "371621",
    text: "惠民县"
  },
  "371622": {
    code: "371622",
    text: "阳信县"
  },
  "371623": {
    code: "371623",
    text: "无棣县"
  },
  "371624": {
    code: "371624",
    text: "沾化县"
  },
  "371625": {
    code: "371625",
    text: "博兴县"
  },
  "371626": {
    code: "371626",
    text: "邹平县"
  },
  //山东省 菏泽市
  "371701": {
    code: "371701",
    text: "市辖区"
  },
  "371702": {
    code: "371702",
    text: "牡丹区"
  },
  "371721": {
    code: "371721",
    text: "曹县"
  },
  "371722": {
    code: "371722",
    text: "单县"
  },
  "371723": {
    code: "371723",
    text: "成武县"
  },
  "371724": {
    code: "371724",
    text: "巨野县"
  },
  "371725": {
    code: "371725",
    text: "郓城县"
  },
  "371726": {
    code: "371726",
    text: "鄄城县"
  },
  "371727": {
    code: "371727",
    text: "定陶县"
  },
  "371728": {
    code: "371728",
    text: "东明县"
  },
  //河南省
  //河南省 郑州市
  "410101": {
    code: "410101",
    text: "市辖区"
  },
  "410102": {
    code: "410102",
    text: "中原区"
  },
  "410103": {
    code: "410103",
    text: "二七区"
  },
  "410104": {
    code: "410104",
    text: "管城回族区"
  },
  "410105": {
    code: "410105",
    text: "金水区"
  },
  "410106": {
    code: "410106",
    text: "上街区"
  },
  "410107": {
    code: "410107",
    text: "新密区"
  },
  "410108": {
    code: "410108",
    text: "惠济区"
  },
  "410121": {
    code: "410121",
    text: "荥阳县"
  },
  "410122": {
    code: "410122",
    text: "中牟县"
  },
  "410123": {
    code: "410123",
    text: "新郑县"
  },
  "410124": {
    code: "410124",
    text: "巩县"
  },
  "410125": {
    code: "410125",
    text: "登封县"
  },
  "410126": {
    code: "410126",
    text: "密县"
  },
  "410181": {
    code: "410181",
    text: "巩义市"
  },
  "410182": {
    code: "410182",
    text: "荥阳市"
  },
  "410183": {
    code: "410183",
    text: "新密市"
  },
  "410184": {
    code: "410184",
    text: "新郑市"
  },
  "410185": {
    code: "410185",
    text: "登封市"
  },
  //河南省 开封市
  "410201": {
    code: "410201",
    text: "市辖区"
  },
  "410202": {
    code: "410202",
    text: "龙亭区"
  },
  "410203": {
    code: "410203",
    text: "顺河回族区"
  },
  "410204": {
    code: "410204",
    text: "鼓楼区"
  },
  "410205": {
    code: "410205",
    text: "禹王台区"
  },
  "410211": {
    code: "410211",
    text: "金明区"
  },
  "410212": {
    code: "410212",
    text: "祥符区"
  },
  "410221": {
    code: "410221",
    text: "杞县"
  },
  "410222": {
    code: "410222",
    text: "通许县"
  },
  "410223": {
    code: "410223",
    text: "尉氏县"
  },
  "410224": {
    code: "410224",
    text: "开封县"
  },
  "410225": {
    code: "410225",
    text: "兰考县"
  },
  //河南省 洛阳市
  "410301": {
    code: "410301",
    text: "市辖区"
  },
  "410302": {
    code: "410302",
    text: "老城区"
  },
  "410303": {
    code: "410303",
    text: "西工区"
  },
  "410304": {
    code: "410304",
    text: "瀍河回族区"
  },
  "410305": {
    code: "410305",
    text: "涧西区"
  },
  "410306": {
    code: "410306",
    text: "吉利区"
  },
  "410307": {
    code: "410307",
    text: "洛龙区"
  },
  "410311": {
    code: "410311",
    text: "洛龙区"
  },
  "410321": {
    code: "410321",
    text: "偃师县"
  },
  "410322": {
    code: "410322",
    text: "孟津县"
  },
  "410323": {
    code: "410323",
    text: "新安县"
  },
  "410324": {
    code: "410324",
    text: "栾川县"
  },
  "410325": {
    code: "410325",
    text: "嵩县"
  },
  "410326": {
    code: "410326",
    text: "汝阳县"
  },
  "410327": {
    code: "410327",
    text: "宜阳县"
  },
  "410328": {
    code: "410328",
    text: "洛宁县"
  },
  "410329": {
    code: "410329",
    text: "伊川县"
  },
  "410381": {
    code: "410381",
    text: "偃师市"
  },
  //河南省 平顶山市
  "410401": {
    code: "410401",
    text: "市辖区"
  },
  "410402": {
    code: "410402",
    text: "新华区"
  },
  "410403": {
    code: "410403",
    text: "卫东区"
  },
  "410404": {
    code: "410404",
    text: "石龙区"
  },
  "410411": {
    code: "410411",
    text: "湛河区"
  },
  "410412": {
    code: "410412",
    text: "舞钢区"
  },
  "410421": {
    code: "410421",
    text: "宝丰县"
  },
  "410422": {
    code: "410422",
    text: "叶县"
  },
  "410423": {
    code: "410423",
    text: "鲁山县"
  },
  "410424": {
    code: "410424",
    text: "临汝县"
  },
  "410425": {
    code: "410425",
    text: "郏县"
  },
  "410426": {
    code: "410426",
    text: "襄城县"
  },
  "410481": {
    code: "410481",
    text: "舞钢市"
  },
  "410482": {
    code: "410482",
    text: "汝州市"
  },
  //河南省 安阳市
  "410501": {
    code: "410501",
    text: "市辖区"
  },
  "410502": {
    code: "410502",
    text: "文峰区"
  },
  "410503": {
    code: "410503",
    text: "北关区"
  },
  "410504": {
    code: "410504",
    text: "铁西区"
  },
  "410505": {
    code: "410505",
    text: "殷都区"
  },
  "410506": {
    code: "410506",
    text: "龙安区"
  },
  "410521": {
    code: "410521",
    text: "林县"
  },
  "410522": {
    code: "410522",
    text: "安阳县"
  },
  "410523": {
    code: "410523",
    text: "汤阴县"
  },
  "410524": {
    code: "410524",
    text: "淇县"
  },
  "410525": {
    code: "410525",
    text: "浚县"
  },
  "410526": {
    code: "410526",
    text: "滑县"
  },
  "410527": {
    code: "410527",
    text: "内黄县"
  },
  "410581": {
    code: "410581",
    text: "林州市"
  },
  //河南省 鹤壁市
  "410601": {
    code: "410601",
    text: "市辖区"
  },
  "410602": {
    code: "410602",
    text: "鹤山区"
  },
  "410603": {
    code: "410603",
    text: "山城区"
  },
  "410611": {
    code: "410611",
    text: "淇滨区"
  },
  "410621": {
    code: "410621",
    text: "浚县"
  },
  "410622": {
    code: "410622",
    text: "淇县"
  },
  //河南省 新乡市
  "410701": {
    code: "410701",
    text: "市辖区"
  },
  "410702": {
    code: "410702",
    text: "红旗区"
  },
  "410703": {
    code: "410703",
    text: "卫滨区"
  },
  "410704": {
    code: "410704",
    text: "凤泉区"
  },
  "410711": {
    code: "410711",
    text: "牧野区"
  },
  "410721": {
    code: "410721",
    text: "新乡县"
  },
  "410722": {
    code: "410722",
    text: "汲县"
  },
  "410723": {
    code: "410723",
    text: "辉县"
  },
  "410724": {
    code: "410724",
    text: "获嘉县"
  },
  "410725": {
    code: "410725",
    text: "原阳县"
  },
  "410726": {
    code: "410726",
    text: "延津县"
  },
  "410727": {
    code: "410727",
    text: "封丘县"
  },
  "410728": {
    code: "410728",
    text: "长垣县"
  },
  "410781": {
    code: "410781",
    text: "卫辉市"
  },
  "410782": {
    code: "410782",
    text: "辉县市"
  },
  //河南省 焦作市
  "410801": {
    code: "410801",
    text: "市辖区"
  },
  "410802": {
    code: "410802",
    text: "解放区"
  },
  "410803": {
    code: "410803",
    text: "中站区"
  },
  "410804": {
    code: "410804",
    text: "马村区"
  },
  "410811": {
    code: "410811",
    text: "山阳区"
  },
  "410821": {
    code: "410821",
    text: "修武县"
  },
  "410822": {
    code: "410822",
    text: "博爱县"
  },
  "410823": {
    code: "410823",
    text: "武陟县"
  },
  "410824": {
    code: "410824",
    text: "沁阳县"
  },
  "410825": {
    code: "410825",
    text: "温县"
  },
  "410826": {
    code: "410826",
    text: "孟县"
  },
  "410827": {
    code: "410827",
    text: "济源县"
  },
  "410881": {
    code: "410881",
    text: "济源市"
  },
  "410882": {
    code: "410882",
    text: "沁阳市"
  },
  "410883": {
    code: "410883",
    text: "孟州市"
  },
  //河南省 濮阳市
  "410901": {
    code: "410901",
    text: "市辖区"
  },
  "410902": {
    code: "410902",
    text: "华龙区"
  },
  "410921": {
    code: "410921",
    text: "滑县"
  },
  "410922": {
    code: "410922",
    text: "清丰县"
  },
  "410923": {
    code: "410923",
    text: "南乐县"
  },
  "410924": {
    code: "410924",
    text: "内黄县"
  },
  "410925": {
    code: "410925",
    text: "长垣县"
  },
  "410926": {
    code: "410926",
    text: "范县"
  },
  "410927": {
    code: "410927",
    text: "台前县"
  },
  "410928": {
    code: "410928",
    text: "濮阳县"
  },
  //河南省 许昌市
  "411001": {
    code: "411001",
    text: "市辖区"
  },
  "411002": {
    code: "411002",
    text: "魏都区"
  },
  "411021": {
    code: "411021",
    text: "禹县"
  },
  "411022": {
    code: "411022",
    text: "长葛县"
  },
  "411023": {
    code: "411023",
    text: "许昌县"
  },
  "411024": {
    code: "411024",
    text: "鄢陵县"
  },
  "411025": {
    code: "411025",
    text: "襄城县"
  },
  "411081": {
    code: "411081",
    text: "禹州市"
  },
  "411082": {
    code: "411082",
    text: "长葛市"
  },
  //河南省 漯河市
  "411101": {
    code: "411101",
    text: "市辖区"
  },
  "411102": {
    code: "411102",
    text: "源汇区"
  },
  "411103": {
    code: "411103",
    text: "郾城区"
  },
  "411104": {
    code: "411104",
    text: "召陵区"
  },
  "411121": {
    code: "411121",
    text: "舞阳县"
  },
  "411122": {
    code: "411122",
    text: "临颍县"
  },
  "411123": {
    code: "411123",
    text: "郾城县"
  },
  //河南省 三门峡市
  "411201": {
    code: "411201",
    text: "市辖区"
  },
  "411202": {
    code: "411202",
    text: "湖滨区"
  },
  "411203": {
    code: "411203",
    text: "陕州区"
  },
  "411221": {
    code: "411221",
    text: "渑池县"
  },
  "411222": {
    code: "411222",
    text: "陕县"
  },
  "411223": {
    code: "411223",
    text: "灵宝县"
  },
  "411224": {
    code: "411224",
    text: "卢氏县"
  },
  "411281": {
    code: "411281",
    text: "义马市"
  },
  "411282": {
    code: "411282",
    text: "灵宝市"
  },
  //河南省 南阳市
  "411301": {
    code: "411301",
    text: "市辖区"
  },
  "411302": {
    code: "411302",
    text: "宛城区"
  },
  "411303": {
    code: "411303",
    text: "卧龙区"
  },
  "411321": {
    code: "411321",
    text: "南召县"
  },
  "411322": {
    code: "411322",
    text: "方城县"
  },
  "411323": {
    code: "411323",
    text: "西峡县"
  },
  "411324": {
    code: "411324",
    text: "镇平县"
  },
  "411325": {
    code: "411325",
    text: "内乡县"
  },
  "411326": {
    code: "411326",
    text: "淅川县"
  },
  "411327": {
    code: "411327",
    text: "社旗县"
  },
  "411328": {
    code: "411328",
    text: "唐河县"
  },
  "411329": {
    code: "411329",
    text: "新野县"
  },
  "411330": {
    code: "411330",
    text: "桐柏县"
  },
  "411381": {
    code: "411381",
    text: "邓州市"
  },
  //河南省 商丘市
  "411401": {
    code: "411401",
    text: "市辖区"
  },
  "411402": {
    code: "411402",
    text: "梁园区"
  },
  "411403": {
    code: "411403",
    text: "睢阳区"
  },
  "411421": {
    code: "411421",
    text: "民权县"
  },
  "411422": {
    code: "411422",
    text: "睢县"
  },
  "411423": {
    code: "411423",
    text: "宁陵县"
  },
  "411424": {
    code: "411424",
    text: "柘城县"
  },
  "411425": {
    code: "411425",
    text: "虞城县"
  },
  "411426": {
    code: "411426",
    text: "夏邑县"
  },
  "411481": {
    code: "411481",
    text: "永城市"
  },
  //河南省 信阳市
  "411501": {
    code: "411501",
    text: "市辖区"
  },
  "411502": {
    code: "411502",
    text: "浉河区"
  },
  "411503": {
    code: "411503",
    text: "平桥区"
  },
  "411521": {
    code: "411521",
    text: "罗山县"
  },
  "411522": {
    code: "411522",
    text: "光山县"
  },
  "411523": {
    code: "411523",
    text: "新县"
  },
  "411524": {
    code: "411524",
    text: "商城县"
  },
  "411525": {
    code: "411525",
    text: "固始县"
  },
  "411526": {
    code: "411526",
    text: "潢川县"
  },
  "411527": {
    code: "411527",
    text: "淮滨县"
  },
  "411528": {
    code: "411528",
    text: "息县"
  },
  //河南省 周口市
  "411601": {
    code: "411601",
    text: "市辖区"
  },
  "411602": {
    code: "411602",
    text: "川汇区"
  },
  "411621": {
    code: "411621",
    text: "扶沟县"
  },
  "411622": {
    code: "411622",
    text: "西华县"
  },
  "411623": {
    code: "411623",
    text: "商水县"
  },
  "411624": {
    code: "411624",
    text: "沈丘县"
  },
  "411625": {
    code: "411625",
    text: "郸城县"
  },
  "411626": {
    code: "411626",
    text: "淮阳县"
  },
  "411627": {
    code: "411627",
    text: "太康县"
  },
  "411628": {
    code: "411628",
    text: "鹿邑县"
  },
  "411681": {
    code: "411681",
    text: "项城市"
  },
  //河南省 驻马店市
  "411701": {
    code: "411701",
    text: "市辖区"
  },
  "411702": {
    code: "411702",
    text: "驿城区"
  },
  "411721": {
    code: "411721",
    text: "西平县"
  },
  "411722": {
    code: "411722",
    text: "上蔡县"
  },
  "411723": {
    code: "411723",
    text: "平舆县"
  },
  "411724": {
    code: "411724",
    text: "正阳县"
  },
  "411725": {
    code: "411725",
    text: "确山县"
  },
  "411726": {
    code: "411726",
    text: "泌阳县"
  },
  "411727": {
    code: "411727",
    text: "汝南县"
  },
  "411728": {
    code: "411728",
    text: "遂平县"
  },
  "411729": {
    code: "411729",
    text: "新蔡县"
  },
  //河南省 省直辖县级行政区划
  "419001": {
    code: "419001",
    text: "济源市"
  },
  "419002": {
    code: "419002",
    text: "汝州市"
  },
  "419003": {
    code: "419003",
    text: "济源市"
  },
  "419004": {
    code: "419004",
    text: "禹州市"
  },
  "419005": {
    code: "419005",
    text: "卫辉市"
  },
  "419006": {
    code: "419006",
    text: "辉县市"
  },
  //湖北省
  //湖北省 武汉市
  "420101": {
    code: "420101",
    text: "市辖区"
  },
  "420102": {
    code: "420102",
    text: "江岸区"
  },
  "420103": {
    code: "420103",
    text: "江汉区"
  },
  "420104": {
    code: "420104",
    text: "硚口区"
  },
  "420105": {
    code: "420105",
    text: "汉阳区"
  },
  "420106": {
    code: "420106",
    text: "武昌区"
  },
  "420107": {
    code: "420107",
    text: "青山区"
  },
  "420109": {
    code: "420109",
    text: "东湖管理分局"
  },
  "420111": {
    code: "420111",
    text: "洪山区"
  },
  "420112": {
    code: "420112",
    text: "东西湖区"
  },
  "420113": {
    code: "420113",
    text: "汉南区"
  },
  "420114": {
    code: "420114",
    text: "蔡甸区"
  },
  "420115": {
    code: "420115",
    text: "江夏区"
  },
  "420116": {
    code: "420116",
    text: "黄陂区"
  },
  "420117": {
    code: "420117",
    text: "新洲区"
  },
  //湖北省 黄石市
  "420201": {
    code: "420201",
    text: "市辖区"
  },
  "420202": {
    code: "420202",
    text: "黄石港区"
  },
  "420203": {
    code: "420203",
    text: "西塞山区"
  },
  "420204": {
    code: "420204",
    text: "下陆区"
  },
  "420205": {
    code: "420205",
    text: "铁山区"
  },
  "420221": {
    code: "420221",
    text: "大冶县"
  },
  "420222": {
    code: "420222",
    text: "阳新县"
  },
  "420281": {
    code: "420281",
    text: "大冶市"
  },
  //湖北省 十堰市
  "420301": {
    code: "420301",
    text: "市辖区"
  },
  "420302": {
    code: "420302",
    text: "茅箭区"
  },
  "420303": {
    code: "420303",
    text: "张湾区"
  },
  "420304": {
    code: "420304",
    text: "郧阳区"
  },
  "420321": {
    code: "420321",
    text: "郧县"
  },
  "420322": {
    code: "420322",
    text: "郧西县"
  },
  "420323": {
    code: "420323",
    text: "竹山县"
  },
  "420324": {
    code: "420324",
    text: "竹溪县"
  },
  "420325": {
    code: "420325",
    text: "房县"
  },
  "420381": {
    code: "420381",
    text: "丹江口市"
  },
  //湖北省 宜昌市
  "420501": {
    code: "420501",
    text: "市辖区"
  },
  "420502": {
    code: "420502",
    text: "西陵区"
  },
  "420503": {
    code: "420503",
    text: "伍家岗区"
  },
  "420504": {
    code: "420504",
    text: "点军区"
  },
  "420505": {
    code: "420505",
    text: "猇亭区"
  },
  "420506": {
    code: "420506",
    text: "夷陵区"
  },
  "420521": {
    code: "420521",
    text: "宜昌县"
  },
  "420523": {
    code: "420523",
    text: "枝江县"
  },
  "420525": {
    code: "420525",
    text: "远安县"
  },
  "420526": {
    code: "420526",
    text: "兴山县"
  },
  "420527": {
    code: "420527",
    text: "秭归县"
  },
  "420528": {
    code: "420528",
    text: "长阳土家族自治县"
  },
  "420529": {
    code: "420529",
    text: "五峰土家族自治县"
  },
  "420581": {
    code: "420581",
    text: "宜都市"
  },
  "420582": {
    code: "420582",
    text: "当阳市"
  },
  "420583": {
    code: "420583",
    text: "枝江市"
  },
  //湖北省 襄阳市
  "420601": {
    code: "420601",
    text: "市辖区"
  },
  "420602": {
    code: "420602",
    text: "襄城区"
  },
  "420603": {
    code: "420603",
    text: "樊东区"
  },
  "420604": {
    code: "420604",
    text: "樊西区"
  },
  "420605": {
    code: "420605",
    text: "郊区"
  },
  "420606": {
    code: "420606",
    text: "樊城区"
  },
  "420607": {
    code: "420607",
    text: "襄州区"
  },
  "420621": {
    code: "420621",
    text: "襄阳县"
  },
  "420622": {
    code: "420622",
    text: "枣阳县"
  },
  "420623": {
    code: "420623",
    text: "宜城县"
  },
  "420624": {
    code: "420624",
    text: "南漳县"
  },
  "420625": {
    code: "420625",
    text: "谷城县"
  },
  "420626": {
    code: "420626",
    text: "保康县"
  },
  "420681": {
    code: "420681",
    text: "随州市"
  },
  "420682": {
    code: "420682",
    text: "老河口市"
  },
  "420683": {
    code: "420683",
    text: "枣阳市"
  },
  "420684": {
    code: "420684",
    text: "宜城市"
  },
  //湖北省 鄂州市
  "420701": {
    code: "420701",
    text: "市辖区"
  },
  "420702": {
    code: "420702",
    text: "梁子湖区"
  },
  "420703": {
    code: "420703",
    text: "华容区"
  },
  "420704": {
    code: "420704",
    text: "鄂城区"
  },
  //湖北省 荆门市
  "420801": {
    code: "420801",
    text: "市辖区"
  },
  "420802": {
    code: "420802",
    text: "东宝区"
  },
  "420803": {
    code: "420803",
    text: "沙洋区"
  },
  "420804": {
    code: "420804",
    text: "掇刀区"
  },
  "420821": {
    code: "420821",
    text: "京山县"
  },
  "420822": {
    code: "420822",
    text: "沙洋县"
  },
  "420881": {
    code: "420881",
    text: "钟祥市"
  },
  //湖北省 孝感市
  "420901": {
    code: "420901",
    text: "市辖区"
  },
  "420902": {
    code: "420902",
    text: "孝南区"
  },
  "420921": {
    code: "420921",
    text: "孝昌县"
  },
  "420922": {
    code: "420922",
    text: "大悟县"
  },
  "420923": {
    code: "420923",
    text: "云梦县"
  },
  "420981": {
    code: "420981",
    text: "应城市"
  },
  "420982": {
    code: "420982",
    text: "安陆市"
  },
  "420983": {
    code: "420983",
    text: "广水市"
  },
  "420984": {
    code: "420984",
    text: "汉川市"
  },
  //湖北省 荆州市
  "421001": {
    code: "421001",
    text: "市辖区"
  },
  "421002": {
    code: "421002",
    text: "沙市区"
  },
  "421003": {
    code: "421003",
    text: "荆州区"
  },
  "421004": {
    code: "421004",
    text: "江陵区"
  },
  "421021": {
    code: "421021",
    text: "松滋县"
  },
  "421022": {
    code: "421022",
    text: "公安县"
  },
  "421023": {
    code: "421023",
    text: "监利县"
  },
  "421024": {
    code: "421024",
    text: "江陵县"
  },
  "421081": {
    code: "421081",
    text: "石首市"
  },
  "421083": {
    code: "421083",
    text: "洪湖市"
  },
  "421087": {
    code: "421087",
    text: "松滋市"
  },
  //湖北省 黄冈市
  "421101": {
    code: "421101",
    text: "市辖区"
  },
  "421102": {
    code: "421102",
    text: "黄州区"
  },
  "421103": {
    code: "421103",
    text: "龙感湖管理区"
  },
  "421121": {
    code: "421121",
    text: "团风县"
  },
  "421122": {
    code: "421122",
    text: "红安县"
  },
  "421123": {
    code: "421123",
    text: "罗田县"
  },
  "421124": {
    code: "421124",
    text: "英山县"
  },
  "421125": {
    code: "421125",
    text: "浠水县"
  },
  "421126": {
    code: "421126",
    text: "蕲春县"
  },
  "421127": {
    code: "421127",
    text: "黄梅县"
  },
  "421181": {
    code: "421181",
    text: "麻城市"
  },
  "421182": {
    code: "421182",
    text: "武穴市"
  },
  //湖北省 咸宁市
  "421201": {
    code: "421201",
    text: "市辖区"
  },
  "421202": {
    code: "421202",
    text: "咸安区"
  },
  "421221": {
    code: "421221",
    text: "嘉鱼县"
  },
  "421222": {
    code: "421222",
    text: "通城县"
  },
  "421223": {
    code: "421223",
    text: "崇阳县"
  },
  "421224": {
    code: "421224",
    text: "通山县"
  },
  "421281": {
    code: "421281",
    text: "赤壁市"
  },
  //湖北省 随州市
  "421301": {
    code: "421301",
    text: "市辖区"
  },
  "421303": {
    code: "421303",
    text: "曾都区"
  },
  "421321": {
    code: "421321",
    text: "随县"
  },
  "421381": {
    code: "421381",
    text: "广水市"
  },
  //湖北省 恩施土家族苗族自治州
  "422801": {
    code: "422801",
    text: "恩施市"
  },
  "422802": {
    code: "422802",
    text: "利川市"
  },
  "422822": {
    code: "422822",
    text: "建始县"
  },
  "422823": {
    code: "422823",
    text: "巴东县"
  },
  "422825": {
    code: "422825",
    text: "宣恩县"
  },
  "422826": {
    code: "422826",
    text: "咸丰县"
  },
  "422827": {
    code: "422827",
    text: "来凤县"
  },
  "422828": {
    code: "422828",
    text: "鹤峰县"
  },
  //湖北省 省直辖县级行政区划
  "429001": {
    code: "429001",
    text: "随州市"
  },
  "429003": {
    code: "429003",
    text: "枣阳市"
  },
  "429004": {
    code: "429004",
    text: "仙桃市"
  },
  "429005": {
    code: "429005",
    text: "潜江市"
  },
  "429006": {
    code: "429006",
    text: "天门市"
  },
  "429021": {
    code: "429021",
    text: "神农架林区"
  },
  //湖南省
  //湖南省 长沙市
  "430101": {
    code: "430101",
    text: "市辖区"
  },
  "430102": {
    code: "430102",
    text: "芙蓉区"
  },
  "430103": {
    code: "430103",
    text: "天心区"
  },
  "430104": {
    code: "430104",
    text: "岳麓区"
  },
  "430105": {
    code: "430105",
    text: "开福区"
  },
  "430111": {
    code: "430111",
    text: "雨花区"
  },
  "430112": {
    code: "430112",
    text: "望城区"
  },
  "430121": {
    code: "430121",
    text: "长沙县"
  },
  "430122": {
    code: "430122",
    text: "望城县"
  },
  "430123": {
    code: "430123",
    text: "浏阳县"
  },
  "430124": {
    code: "430124",
    text: "宁乡县"
  },
  "430181": {
    code: "430181",
    text: "浏阳市"
  },
  //湖南省 株洲市
  "430201": {
    code: "430201",
    text: "市辖区"
  },
  "430202": {
    code: "430202",
    text: "荷塘区"
  },
  "430203": {
    code: "430203",
    text: "芦淞区"
  },
  "430204": {
    code: "430204",
    text: "石峰区"
  },
  "430211": {
    code: "430211",
    text: "天元区"
  },
  "430221": {
    code: "430221",
    text: "株洲县"
  },
  "430222": {
    code: "430222",
    text: "醴陵县"
  },
  "430223": {
    code: "430223",
    text: "攸县"
  },
  "430224": {
    code: "430224",
    text: "茶陵县"
  },
  "430225": {
    code: "430225",
    text: "炎陵县"
  },
  "430281": {
    code: "430281",
    text: "醴陵市"
  },
  //湖南省 湘潭市
  "430301": {
    code: "430301",
    text: "市辖区"
  },
  "430302": {
    code: "430302",
    text: "雨湖区"
  },
  "430303": {
    code: "430303",
    text: "湘江区"
  },
  "430304": {
    code: "430304",
    text: "岳塘区"
  },
  "430305": {
    code: "430305",
    text: "板塘区"
  },
  "430306": {
    code: "430306",
    text: "韶山区"
  },
  "430311": {
    code: "430311",
    text: "郊区"
  },
  "430312": {
    code: "430312",
    text: "韶山区"
  },
  "430321": {
    code: "430321",
    text: "湘潭县"
  },
  "430322": {
    code: "430322",
    text: "湘乡县"
  },
  "430381": {
    code: "430381",
    text: "湘乡市"
  },
  "430382": {
    code: "430382",
    text: "韶山市"
  },
  //湖南省 衡阳市
  "430401": {
    code: "430401",
    text: "市辖区"
  },
  "430402": {
    code: "430402",
    text: "江东区"
  },
  "430403": {
    code: "430403",
    text: "城南区"
  },
  "430404": {
    code: "430404",
    text: "城北区"
  },
  "430405": {
    code: "430405",
    text: "珠晖区"
  },
  "430406": {
    code: "430406",
    text: "雁峰区"
  },
  "430407": {
    code: "430407",
    text: "石鼓区"
  },
  "430408": {
    code: "430408",
    text: "蒸湘区"
  },
  "430411": {
    code: "430411",
    text: "郊区"
  },
  "430412": {
    code: "430412",
    text: "南岳区"
  },
  "430421": {
    code: "430421",
    text: "衡阳县"
  },
  "430422": {
    code: "430422",
    text: "衡南县"
  },
  "430423": {
    code: "430423",
    text: "衡山县"
  },
  "430424": {
    code: "430424",
    text: "衡东县"
  },
  "430425": {
    code: "430425",
    text: "常宁县"
  },
  "430426": {
    code: "430426",
    text: "祁东县"
  },
  "430427": {
    code: "430427",
    text: "耒阳县"
  },
  "430481": {
    code: "430481",
    text: "耒阳市"
  },
  "430482": {
    code: "430482",
    text: "常宁市"
  },
  //湖南省 邵阳市
  "430501": {
    code: "430501",
    text: "市辖区"
  },
  "430502": {
    code: "430502",
    text: "双清区"
  },
  "430503": {
    code: "430503",
    text: "大祥区"
  },
  "430511": {
    code: "430511",
    text: "北塔区"
  },
  "430521": {
    code: "430521",
    text: "邵东县"
  },
  "430522": {
    code: "430522",
    text: "新邵县"
  },
  "430523": {
    code: "430523",
    text: "邵阳县"
  },
  "430524": {
    code: "430524",
    text: "隆回县"
  },
  "430525": {
    code: "430525",
    text: "洞口县"
  },
  "430526": {
    code: "430526",
    text: "武冈县"
  },
  "430527": {
    code: "430527",
    text: "绥宁县"
  },
  "430528": {
    code: "430528",
    text: "新宁县"
  },
  "430529": {
    code: "430529",
    text: "城步苗族自治县"
  },
  "430581": {
    code: "430581",
    text: "武冈市"
  },
  //湖南省 岳阳市
  "430601": {
    code: "430601",
    text: "市辖区"
  },
  "430602": {
    code: "430602",
    text: "岳阳楼区"
  },
  "430603": {
    code: "430603",
    text: "云溪区"
  },
  "430611": {
    code: "430611",
    text: "君山区"
  },
  "430621": {
    code: "430621",
    text: "岳阳县"
  },
  "430622": {
    code: "430622",
    text: "临湘县"
  },
  "430623": {
    code: "430623",
    text: "华容县"
  },
  "430624": {
    code: "430624",
    text: "湘阴县"
  },
  "430625": {
    code: "430625",
    text: "汨罗县"
  },
  "430626": {
    code: "430626",
    text: "平江县"
  },
  "430681": {
    code: "430681",
    text: "汨罗市"
  },
  "430682": {
    code: "430682",
    text: "临湘市"
  },
  //湖南省 常德市
  "430701": {
    code: "430701",
    text: "市辖区"
  },
  "430702": {
    code: "430702",
    text: "武陵区"
  },
  "430703": {
    code: "430703",
    text: "鼎城区"
  },
  "430721": {
    code: "430721",
    text: "安乡县"
  },
  "430722": {
    code: "430722",
    text: "汉寿县"
  },
  "430723": {
    code: "430723",
    text: "澧县"
  },
  "430724": {
    code: "430724",
    text: "临澧县"
  },
  "430725": {
    code: "430725",
    text: "桃源县"
  },
  "430726": {
    code: "430726",
    text: "石门县"
  },
  "430781": {
    code: "430781",
    text: "津市市"
  },
  //湖南省 张家界市
  "430801": {
    code: "430801",
    text: "市辖区"
  },
  "430802": {
    code: "430802",
    text: "永定区"
  },
  "430811": {
    code: "430811",
    text: "武陵源区"
  },
  "430821": {
    code: "430821",
    text: "慈利县"
  },
  "430822": {
    code: "430822",
    text: "桑植县"
  },
  //湖南省 益阳市
  "430901": {
    code: "430901",
    text: "市辖区"
  },
  "430902": {
    code: "430902",
    text: "资阳区"
  },
  "430903": {
    code: "430903",
    text: "赫山区"
  },
  "430921": {
    code: "430921",
    text: "南县"
  },
  "430922": {
    code: "430922",
    text: "桃江县"
  },
  "430923": {
    code: "430923",
    text: "安化县"
  },
  "430981": {
    code: "430981",
    text: "沅江市"
  },
  //湖南省 郴州市
  "431001": {
    code: "431001",
    text: "市辖区"
  },
  "431002": {
    code: "431002",
    text: "北湖区"
  },
  "431003": {
    code: "431003",
    text: "苏仙区"
  },
  "431021": {
    code: "431021",
    text: "桂阳县"
  },
  "431022": {
    code: "431022",
    text: "宜章县"
  },
  "431023": {
    code: "431023",
    text: "永兴县"
  },
  "431024": {
    code: "431024",
    text: "嘉禾县"
  },
  "431025": {
    code: "431025",
    text: "临武县"
  },
  "431026": {
    code: "431026",
    text: "汝城县"
  },
  "431027": {
    code: "431027",
    text: "桂东县"
  },
  "431028": {
    code: "431028",
    text: "安仁县"
  },
  "431081": {
    code: "431081",
    text: "资兴市"
  },
  //湖南省 永州市
  "431101": {
    code: "431101",
    text: "市辖区"
  },
  "431102": {
    code: "431102",
    text: "零陵区"
  },
  "431103": {
    code: "431103",
    text: "冷水滩区"
  },
  "431121": {
    code: "431121",
    text: "祁阳县"
  },
  "431122": {
    code: "431122",
    text: "东安县"
  },
  "431123": {
    code: "431123",
    text: "双牌县"
  },
  "431124": {
    code: "431124",
    text: "道县"
  },
  "431125": {
    code: "431125",
    text: "江永县"
  },
  "431126": {
    code: "431126",
    text: "宁远县"
  },
  "431127": {
    code: "431127",
    text: "蓝山县"
  },
  "431128": {
    code: "431128",
    text: "新田县"
  },
  "431129": {
    code: "431129",
    text: "江华瑶族自治县"
  },
  //湖南省 怀化市
  "431201": {
    code: "431201",
    text: "市辖区"
  },
  "431202": {
    code: "431202",
    text: "鹤城区"
  },
  "431221": {
    code: "431221",
    text: "中方县"
  },
  "431222": {
    code: "431222",
    text: "沅陵县"
  },
  "431223": {
    code: "431223",
    text: "辰溪县"
  },
  "431224": {
    code: "431224",
    text: "溆浦县"
  },
  "431225": {
    code: "431225",
    text: "会同县"
  },
  "431226": {
    code: "431226",
    text: "麻阳苗族自治县"
  },
  "431227": {
    code: "431227",
    text: "新晃侗族自治县"
  },
  "431228": {
    code: "431228",
    text: "芷江侗族自治县"
  },
  "431229": {
    code: "431229",
    text: "靖州苗族侗族自治县"
  },
  "431230": {
    code: "431230",
    text: "通道侗族自治县"
  },
  "431281": {
    code: "431281",
    text: "洪江市"
  },
  //湖南省 娄底市
  "431301": {
    code: "431301",
    text: "市辖区"
  },
  "431302": {
    code: "431302",
    text: "娄星区"
  },
  "431321": {
    code: "431321",
    text: "双峰县"
  },
  "431322": {
    code: "431322",
    text: "新化县"
  },
  "431381": {
    code: "431381",
    text: "冷水江市"
  },
  "431382": {
    code: "431382",
    text: "涟源市"
  },
  //湖南省 湘西土家族苗族自治州
  "433101": {
    code: "433101",
    text: "吉首市"
  },
  "433121": {
    code: "433121",
    text: "吉首县"
  },
  "433122": {
    code: "433122",
    text: "泸溪县"
  },
  "433123": {
    code: "433123",
    text: "凤凰县"
  },
  "433124": {
    code: "433124",
    text: "花垣县"
  },
  "433125": {
    code: "433125",
    text: "保靖县"
  },
  "433126": {
    code: "433126",
    text: "古丈县"
  },
  "433127": {
    code: "433127",
    text: "永顺县"
  },
  "433128": {
    code: "433128",
    text: "大庸县"
  },
  "433129": {
    code: "433129",
    text: "桑植县"
  },
  "433130": {
    code: "433130",
    text: "龙山县"
  },
  //广东省
  //广东省 广州市
  "440101": {
    code: "440101",
    text: "市辖区"
  },
  "440102": {
    code: "440102",
    text: "东山区"
  },
  "440103": {
    code: "440103",
    text: "荔湾区"
  },
  "440104": {
    code: "440104",
    text: "越秀区"
  },
  "440105": {
    code: "440105",
    text: "海珠区"
  },
  "440106": {
    code: "440106",
    text: "天河区"
  },
  "440107": {
    code: "440107",
    text: "芳村区"
  },
  "440111": {
    code: "440111",
    text: "白云区"
  },
  "440112": {
    code: "440112",
    text: "黄埔区"
  },
  "440113": {
    code: "440113",
    text: "番禺区"
  },
  "440114": {
    code: "440114",
    text: "花都区"
  },
  "440115": {
    code: "440115",
    text: "南沙区"
  },
  "440116": {
    code: "440116",
    text: "萝岗区"
  },
  "440117": {
    code: "440117",
    text: "从化区"
  },
  "440118": {
    code: "440118",
    text: "增城区"
  },
  "440120": {
    code: "440120",
    text: "市区"
  },
  "440121": {
    code: "440121",
    text: "花县"
  },
  "440122": {
    code: "440122",
    text: "从化县"
  },
  "440123": {
    code: "440123",
    text: "新丰县"
  },
  "440124": {
    code: "440124",
    text: "龙门县"
  },
  "440125": {
    code: "440125",
    text: "增城县"
  },
  "440126": {
    code: "440126",
    text: "番禺县"
  },
  "440127": {
    code: "440127",
    text: "清远县"
  },
  "440128": {
    code: "440128",
    text: "佛冈县"
  },
  "440181": {
    code: "440181",
    text: "番禺市"
  },
  "440182": {
    code: "440182",
    text: "花都市"
  },
  "440183": {
    code: "440183",
    text: "增城市"
  },
  "440184": {
    code: "440184",
    text: "从化市"
  },
  //广东省 韶关市
  "440201": {
    code: "440201",
    text: "市辖区"
  },
  "440202": {
    code: "440202",
    text: "北江区"
  },
  "440203": {
    code: "440203",
    text: "武江区"
  },
  "440204": {
    code: "440204",
    text: "浈江区"
  },
  "440205": {
    code: "440205",
    text: "曲江区"
  },
  "440221": {
    code: "440221",
    text: "曲江县"
  },
  "440222": {
    code: "440222",
    text: "始兴县"
  },
  "440223": {
    code: "440223",
    text: "南雄县"
  },
  "440224": {
    code: "440224",
    text: "仁化县"
  },
  "440225": {
    code: "440225",
    text: "乐昌县"
  },
  "440226": {
    code: "440226",
    text: "连县"
  },
  "440227": {
    code: "440227",
    text: "阳山县"
  },
  "440228": {
    code: "440228",
    text: "英德县"
  },
  "440229": {
    code: "440229",
    text: "翁源县"
  },
  "440230": {
    code: "440230",
    text: "连山壮族瑶族自治县"
  },
  "440231": {
    code: "440231",
    text: "连南瑶族自治县"
  },
  "440232": {
    code: "440232",
    text: "乳源瑶族自治县"
  },
  "440233": {
    code: "440233",
    text: "新丰县"
  },
  "440281": {
    code: "440281",
    text: "乐昌市"
  },
  "440282": {
    code: "440282",
    text: "南雄市"
  },
  //广东省 深圳市
  "440301": {
    code: "440301",
    text: "市辖区"
  },
  "440302": {
    code: "440302",
    text: "盐田区"
  },
  "440303": {
    code: "440303",
    text: "罗湖区"
  },
  "440304": {
    code: "440304",
    text: "福田区"
  },
  "440305": {
    code: "440305",
    text: "南山区"
  },
  "440306": {
    code: "440306",
    text: "宝安区"
  },
  "440307": {
    code: "440307",
    text: "龙岗区"
  },
  "440308": {
    code: "440308",
    text: "盐田区"
  },
  "440321": {
    code: "440321",
    text: "宝安县"
  },
  //广东省 珠海市
  "440401": {
    code: "440401",
    text: "市辖区"
  },
  "440402": {
    code: "440402",
    text: "香洲区"
  },
  "440403": {
    code: "440403",
    text: "斗门区"
  },
  "440404": {
    code: "440404",
    text: "金湾区"
  },
  "440421": {
    code: "440421",
    text: "斗门县"
  },
  //广东省 汕头市
  "440501": {
    code: "440501",
    text: "市辖区"
  },
  "440502": {
    code: "440502",
    text: "同平区"
  },
  "440503": {
    code: "440503",
    text: "安平区"
  },
  "440504": {
    code: "440504",
    text: "公园区"
  },
  "440505": {
    code: "440505",
    text: "金砂区"
  },
  "440506": {
    code: "440506",
    text: "达濠区"
  },
  "440507": {
    code: "440507",
    text: "龙湖区"
  },
  "440508": {
    code: "440508",
    text: "金园区"
  },
  "440509": {
    code: "440509",
    text: "升平区"
  },
  "440510": {
    code: "440510",
    text: "河浦区"
  },
  "440511": {
    code: "440511",
    text: "金平区"
  },
  "440512": {
    code: "440512",
    text: "濠江区"
  },
  "440513": {
    code: "440513",
    text: "潮阳区"
  },
  "440514": {
    code: "440514",
    text: "潮南区"
  },
  "440515": {
    code: "440515",
    text: "澄海区"
  },
  "440520": {
    code: "440520",
    text: "潮州市"
  },
  "440521": {
    code: "440521",
    text: "澄海县"
  },
  "440522": {
    code: "440522",
    text: "饶平县"
  },
  "440523": {
    code: "440523",
    text: "南澳县"
  },
  "440524": {
    code: "440524",
    text: "潮阳县"
  },
  "440525": {
    code: "440525",
    text: "揭阳县"
  },
  "440526": {
    code: "440526",
    text: "揭西县"
  },
  "440527": {
    code: "440527",
    text: "普宁县"
  },
  "440528": {
    code: "440528",
    text: "惠来县"
  },
  "440581": {
    code: "440581",
    text: "潮州市"
  },
  "440582": {
    code: "440582",
    text: "潮阳市"
  },
  "440583": {
    code: "440583",
    text: "澄海市"
  },
  //广东省 佛山市
  "440601": {
    code: "440601",
    text: "市辖区"
  },
  "440602": {
    code: "440602",
    text: "城区"
  },
  "440603": {
    code: "440603",
    text: "石湾区"
  },
  "440604": {
    code: "440604",
    text: "禅城区"
  },
  "440605": {
    code: "440605",
    text: "南海区"
  },
  "440606": {
    code: "440606",
    text: "顺德区"
  },
  "440607": {
    code: "440607",
    text: "三水区"
  },
  "440608": {
    code: "440608",
    text: "高明区"
  },
  "440621": {
    code: "440621",
    text: "三水县"
  },
  "440622": {
    code: "440622",
    text: "南海县"
  },
  "440623": {
    code: "440623",
    text: "顺德县"
  },
  "440624": {
    code: "440624",
    text: "高明县"
  },
  "440681": {
    code: "440681",
    text: "顺德市"
  },
  "440682": {
    code: "440682",
    text: "南海市"
  },
  "440683": {
    code: "440683",
    text: "三水市"
  },
  "440684": {
    code: "440684",
    text: "高明市"
  },
  //广东省 江门市
  "440701": {
    code: "440701",
    text: "市辖区"
  },
  "440702": {
    code: "440702",
    text: "城区"
  },
  "440703": {
    code: "440703",
    text: "蓬江区"
  },
  "440704": {
    code: "440704",
    text: "江海区"
  },
  "440705": {
    code: "440705",
    text: "新会区"
  },
  "440711": {
    code: "440711",
    text: "郊区"
  },
  "440721": {
    code: "440721",
    text: "新会县"
  },
  "440722": {
    code: "440722",
    text: "台山县"
  },
  "440723": {
    code: "440723",
    text: "恩平县"
  },
  "440724": {
    code: "440724",
    text: "开平县"
  },
  "440725": {
    code: "440725",
    text: "鹤山县"
  },
  "440726": {
    code: "440726",
    text: "阳江县"
  },
  "440727": {
    code: "440727",
    text: "阳春县"
  },
  "440781": {
    code: "440781",
    text: "台山市"
  },
  "440782": {
    code: "440782",
    text: "新会市"
  },
  "440783": {
    code: "440783",
    text: "开平市"
  },
  "440784": {
    code: "440784",
    text: "鹤山市"
  },
  "440785": {
    code: "440785",
    text: "恩平市"
  },
  //广东省 湛江市
  "440801": {
    code: "440801",
    text: "市辖区"
  },
  "440802": {
    code: "440802",
    text: "赤坎区"
  },
  "440803": {
    code: "440803",
    text: "霞山区"
  },
  "440804": {
    code: "440804",
    text: "坡头区"
  },
  "440811": {
    code: "440811",
    text: "麻章区"
  },
  "440821": {
    code: "440821",
    text: "吴川县"
  },
  "440822": {
    code: "440822",
    text: "廉江县"
  },
  "440823": {
    code: "440823",
    text: "遂溪县"
  },
  "440824": {
    code: "440824",
    text: "海康县"
  },
  "440825": {
    code: "440825",
    text: "徐闻县"
  },
  "440881": {
    code: "440881",
    text: "廉江市"
  },
  "440882": {
    code: "440882",
    text: "雷州市"
  },
  "440883": {
    code: "440883",
    text: "吴川市"
  },
  //广东省 茂名市
  "440901": {
    code: "440901",
    text: "市辖区"
  },
  "440902": {
    code: "440902",
    text: "茂南区"
  },
  "440903": {
    code: "440903",
    text: "电白区"
  },
  "440904": {
    code: "440904",
    text: "电白区"
  },
  "440921": {
    code: "440921",
    text: "信宜县"
  },
  "440922": {
    code: "440922",
    text: "高州县"
  },
  "440923": {
    code: "440923",
    text: "电白县"
  },
  "440924": {
    code: "440924",
    text: "化州县"
  },
  "440981": {
    code: "440981",
    text: "高州市"
  },
  "440982": {
    code: "440982",
    text: "化州市"
  },
  "440983": {
    code: "440983",
    text: "信宜市"
  },
  //广东省 肇庆市
  "441201": {
    code: "441201",
    text: "市辖区"
  },
  "441202": {
    code: "441202",
    text: "端州区"
  },
  "441203": {
    code: "441203",
    text: "鼎湖区"
  },
  "441204": {
    code: "441204",
    text: "高要区"
  },
  "441221": {
    code: "441221",
    text: "高要县"
  },
  "441222": {
    code: "441222",
    text: "四会县"
  },
  "441223": {
    code: "441223",
    text: "广宁县"
  },
  "441224": {
    code: "441224",
    text: "怀集县"
  },
  "441225": {
    code: "441225",
    text: "封开县"
  },
  "441226": {
    code: "441226",
    text: "德庆县"
  },
  "441227": {
    code: "441227",
    text: "云浮县"
  },
  "441228": {
    code: "441228",
    text: "新兴县"
  },
  "441229": {
    code: "441229",
    text: "郁南县"
  },
  "441230": {
    code: "441230",
    text: "罗定县"
  },
  "441281": {
    code: "441281",
    text: "云浮市"
  },
  "441282": {
    code: "441282",
    text: "罗定市"
  },
  "441283": {
    code: "441283",
    text: "高要市"
  },
  "441284": {
    code: "441284",
    text: "四会市"
  },
  //广东省 惠州市
  "441301": {
    code: "441301",
    text: "市辖区"
  },
  "441302": {
    code: "441302",
    text: "惠城区"
  },
  "441303": {
    code: "441303",
    text: "惠阳区"
  },
  "441321": {
    code: "441321",
    text: "惠阳县"
  },
  "441322": {
    code: "441322",
    text: "博罗县"
  },
  "441323": {
    code: "441323",
    text: "惠东县"
  },
  "441324": {
    code: "441324",
    text: "龙门县"
  },
  "441381": {
    code: "441381",
    text: "惠阳市"
  },
  //广东省 梅州市
  "441401": {
    code: "441401",
    text: "市辖区"
  },
  "441402": {
    code: "441402",
    text: "梅江区"
  },
  "441403": {
    code: "441403",
    text: "梅县区"
  },
  "441421": {
    code: "441421",
    text: "梅县"
  },
  "441422": {
    code: "441422",
    text: "大埔县"
  },
  "441423": {
    code: "441423",
    text: "丰顺县"
  },
  "441424": {
    code: "441424",
    text: "五华县"
  },
  "441425": {
    code: "441425",
    text: "兴宁县"
  },
  "441426": {
    code: "441426",
    text: "平远县"
  },
  "441427": {
    code: "441427",
    text: "蕉岭县"
  },
  "441481": {
    code: "441481",
    text: "兴宁市"
  },
  //广东省 汕尾市
  "441501": {
    code: "441501",
    text: "市辖区"
  },
  "441502": {
    code: "441502",
    text: "城区"
  },
  "441521": {
    code: "441521",
    text: "海丰县"
  },
  "441522": {
    code: "441522",
    text: "陆丰县"
  },
  "441523": {
    code: "441523",
    text: "陆河县"
  },
  "441581": {
    code: "441581",
    text: "陆丰市"
  },
  //广东省 河源市
  "441601": {
    code: "441601",
    text: "市辖区"
  },
  "441602": {
    code: "441602",
    text: "源城区"
  },
  "441611": {
    code: "441611",
    text: "郊区"
  },
  "441621": {
    code: "441621",
    text: "紫金县"
  },
  "441622": {
    code: "441622",
    text: "龙川县"
  },
  "441623": {
    code: "441623",
    text: "连平县"
  },
  "441624": {
    code: "441624",
    text: "和平县"
  },
  "441625": {
    code: "441625",
    text: "东源县"
  },
  //广东省 阳江市
  "441701": {
    code: "441701",
    text: "市辖区"
  },
  "441702": {
    code: "441702",
    text: "江城区"
  },
  "441703": {
    code: "441703",
    text: "阳东区"
  },
  "441704": {
    code: "441704",
    text: "阳东区"
  },
  "441721": {
    code: "441721",
    text: "阳西县"
  },
  "441722": {
    code: "441722",
    text: "阳春县"
  },
  "441723": {
    code: "441723",
    text: "阳东县"
  },
  "441781": {
    code: "441781",
    text: "阳春市"
  },
  //广东省 清远市
  "441801": {
    code: "441801",
    text: "市辖区"
  },
  "441802": {
    code: "441802",
    text: "清城区"
  },
  "441803": {
    code: "441803",
    text: "清新区"
  },
  "441811": {
    code: "441811",
    text: "清郊区"
  },
  "441821": {
    code: "441821",
    text: "佛冈县"
  },
  "441822": {
    code: "441822",
    text: "英德县"
  },
  "441823": {
    code: "441823",
    text: "阳山县"
  },
  "441824": {
    code: "441824",
    text: "连县"
  },
  "441825": {
    code: "441825",
    text: "连山壮族瑶族自治县"
  },
  "441826": {
    code: "441826",
    text: "连南瑶族自治县"
  },
  "441827": {
    code: "441827",
    text: "清新县"
  },
  "441881": {
    code: "441881",
    text: "英德市"
  },
  "441882": {
    code: "441882",
    text: "连州市"
  },
  //广东省 东莞市
  // "441900":{code:"441900",text:"东莞市"},  　　
  //广东省 中山市
  // "442000":{code:"442000",text:"中山市"},  　　
  //广东省 潮州市
  "445101": {
    code: "445101",
    text: "市辖区"
  },
  "445102": {
    code: "445102",
    text: "湘桥区"
  },
  "445103": {
    code: "445103",
    text: "潮安区"
  },
  "445121": {
    code: "445121",
    text: "潮安县"
  },
  "445122": {
    code: "445122",
    text: "饶平县"
  },
  //广东省 揭阳市
  "445201": {
    code: "445201",
    text: "市辖区"
  },
  "445202": {
    code: "445202",
    text: "榕城区"
  },
  "445203": {
    code: "445203",
    text: "揭东区"
  },
  "445221": {
    code: "445221",
    text: "揭东县"
  },
  "445222": {
    code: "445222",
    text: "揭西县"
  },
  "445224": {
    code: "445224",
    text: "惠来县"
  },
  "445281": {
    code: "445281",
    text: "普宁市"
  },
  //广东省 云浮市
  "445301": {
    code: "445301",
    text: "市辖区"
  },
  "445302": {
    code: "445302",
    text: "云城区"
  },
  "445303": {
    code: "445303",
    text: "云安区"
  },
  "445321": {
    code: "445321",
    text: "新兴县"
  },
  "445322": {
    code: "445322",
    text: "郁南县"
  },
  "445323": {
    code: "445323",
    text: "云安县"
  },
  "445381": {
    code: "445381",
    text: "罗定市"
  },
  //广西
  //广西 南宁市
  "450101": {
    code: "450101",
    text: "市辖区"
  },
  "450102": {
    code: "450102",
    text: "兴宁区"
  },
  "450103": {
    code: "450103",
    text: "青秀区"
  },
  "450104": {
    code: "450104",
    text: "城北区"
  },
  "450105": {
    code: "450105",
    text: "江南区"
  },
  "450106": {
    code: "450106",
    text: "永新区"
  },
  "450107": {
    code: "450107",
    text: "西乡塘区"
  },
  "450108": {
    code: "450108",
    text: "良庆区"
  },
  "450109": {
    code: "450109",
    text: "邕宁区"
  },
  "450110": {
    code: "450110",
    text: "武鸣区"
  },
  "450111": {
    code: "450111",
    text: "郊区"
  },
  "450121": {
    code: "450121",
    text: "邕宁县"
  },
  "450122": {
    code: "450122",
    text: "武鸣县"
  },
  "450123": {
    code: "450123",
    text: "隆安县"
  },
  "450124": {
    code: "450124",
    text: "马山县"
  },
  "450125": {
    code: "450125",
    text: "上林县"
  },
  "450126": {
    code: "450126",
    text: "宾阳县"
  },
  "450127": {
    code: "450127",
    text: "横县"
  },
  //广西 柳州市
  "450201": {
    code: "450201",
    text: "市辖区"
  },
  "450202": {
    code: "450202",
    text: "城中区"
  },
  "450203": {
    code: "450203",
    text: "鱼峰区"
  },
  "450204": {
    code: "450204",
    text: "柳南区"
  },
  "450205": {
    code: "450205",
    text: "柳北区"
  },
  "450211": {
    code: "450211",
    text: "市郊区"
  },
  "450221": {
    code: "450221",
    text: "柳江县"
  },
  "450222": {
    code: "450222",
    text: "柳城县"
  },
  "450223": {
    code: "450223",
    text: "鹿寨县"
  },
  "450224": {
    code: "450224",
    text: "融安县"
  },
  "450225": {
    code: "450225",
    text: "融水苗族自治县"
  },
  "450226": {
    code: "450226",
    text: "三江侗族自治县"
  },
  //广西 桂林市
  "450301": {
    code: "450301",
    text: "市辖区"
  },
  "450302": {
    code: "450302",
    text: "秀峰区"
  },
  "450303": {
    code: "450303",
    text: "叠彩区"
  },
  "450304": {
    code: "450304",
    text: "象山区"
  },
  "450305": {
    code: "450305",
    text: "七星区"
  },
  "450311": {
    code: "450311",
    text: "雁山区"
  },
  "450312": {
    code: "450312",
    text: "临桂区"
  },
  "450321": {
    code: "450321",
    text: "阳朔县"
  },
  "450322": {
    code: "450322",
    text: "临桂县"
  },
  "450323": {
    code: "450323",
    text: "灵川县"
  },
  "450324": {
    code: "450324",
    text: "全州县"
  },
  "450325": {
    code: "450325",
    text: "兴安县"
  },
  "450326": {
    code: "450326",
    text: "永福县"
  },
  "450327": {
    code: "450327",
    text: "灌阳县"
  },
  "450328": {
    code: "450328",
    text: "龙胜各族自治县"
  },
  "450329": {
    code: "450329",
    text: "资源县"
  },
  "450330": {
    code: "450330",
    text: "平乐县"
  },
  "450331": {
    code: "450331",
    text: "荔浦县"
  },
  "450332": {
    code: "450332",
    text: "恭城瑶族自治县"
  },
  //广西 梧州市
  "450401": {
    code: "450401",
    text: "市辖区"
  },
  "450402": {
    code: "450402",
    text: "白云区"
  },
  "450403": {
    code: "450403",
    text: "万秀区"
  },
  "450404": {
    code: "450404",
    text: "蝶山区"
  },
  "450405": {
    code: "450405",
    text: "长洲区"
  },
  "450406": {
    code: "450406",
    text: "龙圩区"
  },
  "450411": {
    code: "450411",
    text: "市郊区"
  },
  "450421": {
    code: "450421",
    text: "苍梧县"
  },
  "450422": {
    code: "450422",
    text: "藤县"
  },
  "450423": {
    code: "450423",
    text: "蒙山县"
  },
  "450481": {
    code: "450481",
    text: "岑溪市"
  },
  //广西 北海市
  "450501": {
    code: "450501",
    text: "市辖区"
  },
  "450502": {
    code: "450502",
    text: "海城区"
  },
  "450503": {
    code: "450503",
    text: "银海区"
  },
  "450512": {
    code: "450512",
    text: "铁山港区"
  },
  "450521": {
    code: "450521",
    text: "合浦县"
  },
  //广西 防城港市
  "450601": {
    code: "450601",
    text: "市辖区"
  },
  "450602": {
    code: "450602",
    text: "港口区"
  },
  "450603": {
    code: "450603",
    text: "防城区"
  },
  "450621": {
    code: "450621",
    text: "上思县"
  },
  "450681": {
    code: "450681",
    text: "东兴市"
  },
  //广西 钦州市
  "450701": {
    code: "450701",
    text: "市辖区"
  },
  "450702": {
    code: "450702",
    text: "钦南区"
  },
  "450703": {
    code: "450703",
    text: "钦北区"
  },
  "450721": {
    code: "450721",
    text: "灵山县"
  },
  "450722": {
    code: "450722",
    text: "浦北县"
  },
  //广西 贵港市
  "450801": {
    code: "450801",
    text: "市辖区"
  },
  "450802": {
    code: "450802",
    text: "港北区"
  },
  "450803": {
    code: "450803",
    text: "港南区"
  },
  "450804": {
    code: "450804",
    text: "覃塘区"
  },
  "450821": {
    code: "450821",
    text: "平南县"
  },
  "450881": {
    code: "450881",
    text: "桂平市"
  },
  //广西 玉林市
  "450901": {
    code: "450901",
    text: "市辖区"
  },
  "450902": {
    code: "450902",
    text: "玉州区"
  },
  "450903": {
    code: "450903",
    text: "福绵区"
  },
  "450921": {
    code: "450921",
    text: "容县"
  },
  "450922": {
    code: "450922",
    text: "陆川县"
  },
  "450923": {
    code: "450923",
    text: "博白县"
  },
  "450924": {
    code: "450924",
    text: "兴业县"
  },
  "450981": {
    code: "450981",
    text: "北流市"
  },
  //广西 百色市
  "451001": {
    code: "451001",
    text: "市辖区"
  },
  "451002": {
    code: "451002",
    text: "右江区"
  },
  "451021": {
    code: "451021",
    text: "田阳县"
  },
  "451022": {
    code: "451022",
    text: "田东县"
  },
  "451023": {
    code: "451023",
    text: "平果县"
  },
  "451024": {
    code: "451024",
    text: "德保县"
  },
  "451025": {
    code: "451025",
    text: "靖西县"
  },
  "451026": {
    code: "451026",
    text: "那坡县"
  },
  "451027": {
    code: "451027",
    text: "凌云县"
  },
  "451028": {
    code: "451028",
    text: "乐业县"
  },
  "451029": {
    code: "451029",
    text: "田林县"
  },
  "451030": {
    code: "451030",
    text: "西林县"
  },
  "451031": {
    code: "451031",
    text: "隆林各族自治县"
  },
  "451081": {
    code: "451081",
    text: "靖西市"
  },
  //广西 贺州市
  "451101": {
    code: "451101",
    text: "市辖区"
  },
  "451102": {
    code: "451102",
    text: "八步区"
  },
  "451121": {
    code: "451121",
    text: "昭平县"
  },
  "451122": {
    code: "451122",
    text: "钟山县"
  },
  "451123": {
    code: "451123",
    text: "富川瑶族自治县"
  },
  //广西 河池市
  "451201": {
    code: "451201",
    text: "市辖区"
  },
  "451202": {
    code: "451202",
    text: "金城江区"
  },
  "451221": {
    code: "451221",
    text: "南丹县"
  },
  "451222": {
    code: "451222",
    text: "天峨县"
  },
  "451223": {
    code: "451223",
    text: "凤山县"
  },
  "451224": {
    code: "451224",
    text: "东兰县"
  },
  "451225": {
    code: "451225",
    text: "罗城仫佬族自治县"
  },
  "451226": {
    code: "451226",
    text: "环江毛南族自治县"
  },
  "451227": {
    code: "451227",
    text: "巴马瑶族自治县"
  },
  "451228": {
    code: "451228",
    text: "都安瑶族自治县"
  },
  "451229": {
    code: "451229",
    text: "大化瑶族自治县"
  },
  "451281": {
    code: "451281",
    text: "宜州市"
  },
  //广西 来宾市
  "451301": {
    code: "451301",
    text: "市辖区"
  },
  "451302": {
    code: "451302",
    text: "兴宾区"
  },
  "451321": {
    code: "451321",
    text: "忻城县"
  },
  "451322": {
    code: "451322",
    text: "象州县"
  },
  "451323": {
    code: "451323",
    text: "武宣县"
  },
  "451324": {
    code: "451324",
    text: "金秀瑶族自治县"
  },
  "451381": {
    code: "451381",
    text: "合山市"
  },
  //广西 崇左市
  "451401": {
    code: "451401",
    text: "市辖区"
  },
  "451402": {
    code: "451402",
    text: "江州区"
  },
  "451421": {
    code: "451421",
    text: "扶绥县"
  },
  "451422": {
    code: "451422",
    text: "宁明县"
  },
  "451423": {
    code: "451423",
    text: "龙州县"
  },
  "451424": {
    code: "451424",
    text: "大新县"
  },
  "451425": {
    code: "451425",
    text: "天等县"
  },
  "451481": {
    code: "451481",
    text: "凭祥市"
  },
  //海南省
  //海南省 海口市
  "460101": {
    code: "460101",
    text: "市辖区"
  },
  "460102": {
    code: "460102",
    text: "振东区"
  },
  "460103": {
    code: "460103",
    text: "新华区"
  },
  "460104": {
    code: "460104",
    text: "秀英区"
  },
  "460105": {
    code: "460105",
    text: "秀英区"
  },
  "460106": {
    code: "460106",
    text: "龙华区"
  },
  "460107": {
    code: "460107",
    text: "琼山区"
  },
  "460108": {
    code: "460108",
    text: "美兰区"
  },
  //海南省 三亚市
  "460201": {
    code: "460201",
    text: "市辖区"
  },
  "460202": {
    code: "460202",
    text: "海棠区"
  },
  "460203": {
    code: "460203",
    text: "吉阳区"
  },
  "460204": {
    code: "460204",
    text: "天涯区"
  },
  "460205": {
    code: "460205",
    text: "崖州区"
  },
  //海南省 三沙市
  //海南省 省直辖县级行政区划
  "469001": {
    code: "469001",
    text: "五指山市"
  },
  "469002": {
    code: "469002",
    text: "琼海市"
  },
  "469003": {
    code: "469003",
    text: "儋州市"
  },
  "469005": {
    code: "469005",
    text: "文昌市"
  },
  "469006": {
    code: "469006",
    text: "万宁市"
  },
  "469007": {
    code: "469007",
    text: "东方市"
  },
  "469021": {
    code: "469021",
    text: "定安县"
  },
  "469022": {
    code: "469022",
    text: "屯昌县"
  },
  "469023": {
    code: "469023",
    text: "澄迈县"
  },
  "469024": {
    code: "469024",
    text: "临高县"
  },
  "469025": {
    code: "469025",
    text: "白沙黎族自治县"
  },
  "469026": {
    code: "469026",
    text: "昌江黎族自治县"
  },
  "469027": {
    code: "469027",
    text: "乐东黎族自治县"
  },
  "469028": {
    code: "469028",
    text: "陵水黎族自治县"
  },
  "469029": {
    code: "469029",
    text: "保亭黎族苗族自治县"
  },
  "469030": {
    code: "469030",
    text: "琼中黎族苗族自治县"
  },
  //重庆市
  //重庆市 市辖区
  "500101": {
    code: "500101",
    text: "万州区"
  },
  "500102": {
    code: "500102",
    text: "涪陵区"
  },
  "500103": {
    code: "500103",
    text: "渝中区"
  },
  "500104": {
    code: "500104",
    text: "大渡口区"
  },
  "500105": {
    code: "500105",
    text: "江北区"
  },
  "500106": {
    code: "500106",
    text: "沙坪坝区"
  },
  "500107": {
    code: "500107",
    text: "九龙坡区"
  },
  "500108": {
    code: "500108",
    text: "南岸区"
  },
  "500109": {
    code: "500109",
    text: "北碚区"
  },
  "500110": {
    code: "500110",
    text: "綦江区"
  },
  "500111": {
    code: "500111",
    text: "大足区"
  },
  "500112": {
    code: "500112",
    text: "渝北区"
  },
  "500113": {
    code: "500113",
    text: "巴南区"
  },
  "500114": {
    code: "500114",
    text: "黔江区"
  },
  "500115": {
    code: "500115",
    text: "长寿区"
  },
  "500116": {
    code: "500116",
    text: "江津区"
  },
  "500117": {
    code: "500117",
    text: "合川区"
  },
  "500118": {
    code: "500118",
    text: "永川区"
  },
  "500119": {
    code: "500119",
    text: "南川区"
  },
  "500120": {
    code: "500120",
    text: "璧山区"
  },
  "500151": {
    code: "500151",
    text: "铜梁区"
  },
  "500152": {
    code: "500152",
    text: "潼南区"
  },
  "500153": {
    code: "500153",
    text: "荣昌区"
  },
  "500154": {
    code: "500154",
    text: "开州区"
  },
  //重庆市 县
  "500221": {
    code: "500221",
    text: "长寿县"
  },
  "500222": {
    code: "500222",
    text: "綦江县"
  },
  "500223": {
    code: "500223",
    text: "潼南县"
  },
  "500224": {
    code: "500224",
    text: "铜梁区"
  },
  "500225": {
    code: "500225",
    text: "荣昌县"
  },
  "500226": {
    code: "500226",
    text: "荣昌县"
  },
  "500227": {
    code: "500227",
    text: "璧山区"
  },
  "500228": {
    code: "500228",
    text: "梁平县"
  },
  "500229": {
    code: "500229",
    text: "城口县"
  },
  "500230": {
    code: "500230",
    text: "丰都县"
  },
  "500231": {
    code: "500231",
    text: "垫江县"
  },
  "500232": {
    code: "500232",
    text: "武隆县"
  },
  "500233": {
    code: "500233",
    text: "忠县"
  },
  "500234": {
    code: "500234",
    text: "开县"
  },
  "500235": {
    code: "500235",
    text: "云阳县"
  },
  "500236": {
    code: "500236",
    text: "奉节县"
  },
  "500237": {
    code: "500237",
    text: "巫山县"
  },
  "500238": {
    code: "500238",
    text: "巫溪县"
  },
  "500240": {
    code: "500240",
    text: "石柱土家族自治县"
  },
  "500241": {
    code: "500241",
    text: "秀山土家族苗族自治县"
  },
  "500242": {
    code: "500242",
    text: "酉阳土家族苗族自治县"
  },
  "500243": {
    code: "500243",
    text: "彭水苗族土家族自治县"
  },
  //四川省
  //四川省 成都市
  "510101": {
    code: "510101",
    text: "市辖区"
  },
  "510102": {
    code: "510102",
    text: "东城区"
  },
  "510103": {
    code: "510103",
    text: "西城区"
  },
  "510104": {
    code: "510104",
    text: "锦江区"
  },
  "510105": {
    code: "510105",
    text: "青羊区"
  },
  "510106": {
    code: "510106",
    text: "金牛区"
  },
  "510107": {
    code: "510107",
    text: "武侯区"
  },
  "510108": {
    code: "510108",
    text: "成华区"
  },
  "510111": {
    code: "510111",
    text: "金牛区"
  },
  "510112": {
    code: "510112",
    text: "龙泉驿区"
  },
  "510113": {
    code: "510113",
    text: "青白江区"
  },
  "510114": {
    code: "510114",
    text: "新都区"
  },
  "510115": {
    code: "510115",
    text: "温江区"
  },
  "510116": {
    code: "510116",
    text: "双流区"
  },
  "510121": {
    code: "510121",
    text: "金堂县"
  },
  "510122": {
    code: "510122",
    text: "双流县"
  },
  "510123": {
    code: "510123",
    text: "温江县"
  },
  "510124": {
    code: "510124",
    text: "郫县"
  },
  "510125": {
    code: "510125",
    text: "新都县"
  },
  "510126": {
    code: "510126",
    text: "彭县"
  },
  "510127": {
    code: "510127",
    text: "灌县"
  },
  "510128": {
    code: "510128",
    text: "崇庆县"
  },
  "510129": {
    code: "510129",
    text: "大邑县"
  },
  "510130": {
    code: "510130",
    text: "邛崃县"
  },
  "510131": {
    code: "510131",
    text: "蒲江县"
  },
  "510132": {
    code: "510132",
    text: "新津县"
  },
  "510181": {
    code: "510181",
    text: "都江堰市"
  },
  "510182": {
    code: "510182",
    text: "彭州市"
  },
  "510183": {
    code: "510183",
    text: "邛崃市"
  },
  "510184": {
    code: "510184",
    text: "崇州市"
  },
  "510185": {
    code: "510185",
    text: "简阳市"
  },
  //四川省 自贡市
  "510301": {
    code: "510301",
    text: "市辖区"
  },
  "510302": {
    code: "510302",
    text: "自流井区"
  },
  "510303": {
    code: "510303",
    text: "贡井区"
  },
  "510304": {
    code: "510304",
    text: "大安区"
  },
  "510311": {
    code: "510311",
    text: "沿滩区"
  },
  "510321": {
    code: "510321",
    text: "荣县"
  },
  "510322": {
    code: "510322",
    text: "富顺县"
  },
  //四川省 攀枝花市
  "510401": {
    code: "510401",
    text: "市辖区"
  },
  "510402": {
    code: "510402",
    text: "东区"
  },
  "510403": {
    code: "510403",
    text: "西区"
  },
  "510411": {
    code: "510411",
    text: "仁和区"
  },
  "510421": {
    code: "510421",
    text: "米易县"
  },
  "510422": {
    code: "510422",
    text: "盐边县"
  },
  //四川省 泸州市
  "510501": {
    code: "510501",
    text: "市辖区"
  },
  "510502": {
    code: "510502",
    text: "江阳区"
  },
  "510503": {
    code: "510503",
    text: "纳溪区"
  },
  "510504": {
    code: "510504",
    text: "龙马潭区"
  },
  "510521": {
    code: "510521",
    text: "泸县"
  },
  "510522": {
    code: "510522",
    text: "合江县"
  },
  "510523": {
    code: "510523",
    text: "纳溪县"
  },
  "510524": {
    code: "510524",
    text: "叙永县"
  },
  "510525": {
    code: "510525",
    text: "古蔺县"
  },
  //四川省 德阳市
  "510601": {
    code: "510601",
    text: "市辖区"
  },
  "510603": {
    code: "510603",
    text: "旌阳区"
  },
  "510623": {
    code: "510623",
    text: "中江县"
  },
  "510626": {
    code: "510626",
    text: "罗江县"
  },
  "510681": {
    code: "510681",
    text: "广汉市"
  },
  "510682": {
    code: "510682",
    text: "什邡市"
  },
  "510683": {
    code: "510683",
    text: "绵竹市"
  },
  //四川省 绵阳市
  "510701": {
    code: "510701",
    text: "市辖区"
  },
  "510702": {
    code: "510702",
    text: "市中区"
  },
  "510703": {
    code: "510703",
    text: "涪城区"
  },
  "510704": {
    code: "510704",
    text: "游仙区"
  },
  "510721": {
    code: "510721",
    text: "江油县"
  },
  "510722": {
    code: "510722",
    text: "三台县"
  },
  "510723": {
    code: "510723",
    text: "盐亭县"
  },
  "510724": {
    code: "510724",
    text: "安县"
  },
  "510725": {
    code: "510725",
    text: "梓潼县"
  },
  "510726": {
    code: "510726",
    text: "北川羌族自治县"
  },
  "510727": {
    code: "510727",
    text: "平武县"
  },
  "510781": {
    code: "510781",
    text: "江油市"
  },
  //四川省 广元市
  "510801": {
    code: "510801",
    text: "市辖区"
  },
  "510802": {
    code: "510802",
    text: "利州区"
  },
  "510811": {
    code: "510811",
    text: "昭化区"
  },
  "510812": {
    code: "510812",
    text: "朝天区"
  },
  "510812": {
    code: "510812",
    text: "朝天区"
  },
  "510821": {
    code: "510821",
    text: "旺苍县"
  },
  "510822": {
    code: "510822",
    text: "青川县"
  },
  "510823": {
    code: "510823",
    text: "剑阁县"
  },
  "510824": {
    code: "510824",
    text: "苍溪县"
  },
  //四川省 遂宁市
  "510901": {
    code: "510901",
    text: "市辖区"
  },
  "510902": {
    code: "510902",
    text: "市中区"
  },
  "510903": {
    code: "510903",
    text: "船山区"
  },
  "510904": {
    code: "510904",
    text: "安居区"
  },
  "510921": {
    code: "510921",
    text: "蓬溪县"
  },
  "510922": {
    code: "510922",
    text: "射洪县"
  },
  "510923": {
    code: "510923",
    text: "大英县"
  },
  //四川省 内江市
  "511001": {
    code: "511001",
    text: "市辖区"
  },
  "511002": {
    code: "511002",
    text: "市中区"
  },
  "511011": {
    code: "511011",
    text: "东兴区"
  },
  "511024": {
    code: "511024",
    text: "威远县"
  },
  "511025": {
    code: "511025",
    text: "资中县"
  },
  "511028": {
    code: "511028",
    text: "隆昌县"
  },
  //四川省 乐山市
  "511101": {
    code: "511101",
    text: "市辖区"
  },
  "511102": {
    code: "511102",
    text: "市中区"
  },
  "511111": {
    code: "511111",
    text: "沙湾区"
  },
  "511112": {
    code: "511112",
    text: "五通桥区"
  },
  "511113": {
    code: "511113",
    text: "金口河区"
  },
  "511121": {
    code: "511121",
    text: "内江县"
  },
  "511122": {
    code: "511122",
    text: "乐至县"
  },
  "511123": {
    code: "511123",
    text: "犍为县"
  },
  "511124": {
    code: "511124",
    text: "井研县"
  },
  "511125": {
    code: "511125",
    text: "资中县"
  },
  "511126": {
    code: "511126",
    text: "夹江县"
  },
  "511127": {
    code: "511127",
    text: "简阳县"
  },
  "511128": {
    code: "511128",
    text: "隆昌县"
  },
  "511129": {
    code: "511129",
    text: "沐川县"
  },
  "511130": {
    code: "511130",
    text: "青神县"
  },
  "511131": {
    code: "511131",
    text: "丹棱县"
  },
  "511132": {
    code: "511132",
    text: "峨边彝族自治县"
  },
  "511133": {
    code: "511133",
    text: "马边彝族自治县"
  },
  "511181": {
    code: "511181",
    text: "峨眉山市"
  },
  //四川省 南充市
  "511301": {
    code: "511301",
    text: "市辖区"
  },
  "511302": {
    code: "511302",
    text: "顺庆区"
  },
  "511303": {
    code: "511303",
    text: "高坪区"
  },
  "511304": {
    code: "511304",
    text: "嘉陵区"
  },
  "511321": {
    code: "511321",
    text: "南部县"
  },
  "511322": {
    code: "511322",
    text: "营山县"
  },
  "511323": {
    code: "511323",
    text: "蓬安县"
  },
  "511324": {
    code: "511324",
    text: "仪陇县"
  },
  "511325": {
    code: "511325",
    text: "西充县"
  },
  "511381": {
    code: "511381",
    text: "阆中市"
  },
  //四川省 眉山市
  "511401": {
    code: "511401",
    text: "市辖区"
  },
  "511402": {
    code: "511402",
    text: "东坡区"
  },
  "511403": {
    code: "511403",
    text: "彭山区"
  },
  "511421": {
    code: "511421",
    text: "仁寿县"
  },
  "511422": {
    code: "511422",
    text: "彭山县"
  },
  "511423": {
    code: "511423",
    text: "洪雅县"
  },
  "511424": {
    code: "511424",
    text: "丹棱县"
  },
  "511425": {
    code: "511425",
    text: "青神县"
  },
  //四川省 宜宾市
  "511501": {
    code: "511501",
    text: "市辖区"
  },
  "511502": {
    code: "511502",
    text: "翠屏区"
  },
  "511503": {
    code: "511503",
    text: "南溪区"
  },
  "511521": {
    code: "511521",
    text: "宜宾县"
  },
  "511522": {
    code: "511522",
    text: "南溪县"
  },
  "511523": {
    code: "511523",
    text: "江安县"
  },
  "511524": {
    code: "511524",
    text: "长宁县"
  },
  "511525": {
    code: "511525",
    text: "高县"
  },
  "511526": {
    code: "511526",
    text: "珙县"
  },
  "511527": {
    code: "511527",
    text: "筠连县"
  },
  "511528": {
    code: "511528",
    text: "兴文县"
  },
  "511529": {
    code: "511529",
    text: "屏山县"
  },
  //四川省 广安市
  "511601": {
    code: "511601",
    text: "市辖区"
  },
  "511602": {
    code: "511602",
    text: "广安区"
  },
  "511603": {
    code: "511603",
    text: "前锋区"
  },
  "511621": {
    code: "511621",
    text: "岳池县"
  },
  "511622": {
    code: "511622",
    text: "武胜县"
  },
  "511623": {
    code: "511623",
    text: "邻水县"
  },
  "511681": {
    code: "511681",
    text: "华蓥市"
  },
  //四川省 达州市
  "511701": {
    code: "511701",
    text: "市辖区"
  },
  "511702": {
    code: "511702",
    text: "通川区"
  },
  "511703": {
    code: "511703",
    text: "达川区"
  },
  "511721": {
    code: "511721",
    text: "达县"
  },
  "511722": {
    code: "511722",
    text: "宣汉县"
  },
  "511723": {
    code: "511723",
    text: "开江县"
  },
  "511724": {
    code: "511724",
    text: "大竹县"
  },
  "511725": {
    code: "511725",
    text: "渠县"
  },
  "511781": {
    code: "511781",
    text: "万源市"
  },
  //四川省 雅安市
  "511801": {
    code: "511801",
    text: "市辖区"
  },
  "511802": {
    code: "511802",
    text: "雨城区"
  },
  "511803": {
    code: "511803",
    text: "名山区"
  },
  "511821": {
    code: "511821",
    text: "名山县"
  },
  "511822": {
    code: "511822",
    text: "荥经县"
  },
  "511823": {
    code: "511823",
    text: "汉源县"
  },
  "511824": {
    code: "511824",
    text: "石棉县"
  },
  "511825": {
    code: "511825",
    text: "天全县"
  },
  "511826": {
    code: "511826",
    text: "芦山县"
  },
  "511827": {
    code: "511827",
    text: "宝兴县"
  },
  //四川省 巴中市
  "511901": {
    code: "511901",
    text: "市辖区"
  },
  "511902": {
    code: "511902",
    text: "巴州区"
  },
  "511903": {
    code: "511903",
    text: "恩阳区"
  },
  "511921": {
    code: "511921",
    text: "通江县"
  },
  "511922": {
    code: "511922",
    text: "南江县"
  },
  "511923": {
    code: "511923",
    text: "平昌县"
  },
  //四川省 资阳市
  "512001": {
    code: "512001",
    text: "市辖区"
  },
  "512002": {
    code: "512002",
    text: "雁江区"
  },
  "512021": {
    code: "512021",
    text: "安岳县"
  },
  "512022": {
    code: "512022",
    text: "乐至县"
  },
  "512081": {
    code: "512081",
    text: "简阳市"
  },
  //四川省 阿坝藏族羌族自治州
  "513201": {
    code: "513201",
    text: "马尔康区"
  },
  "513221": {
    code: "513221",
    text: "汶川县"
  },
  "513222": {
    code: "513222",
    text: "理县"
  },
  "513223": {
    code: "513223",
    text: "茂县"
  },
  "513224": {
    code: "513224",
    text: "松潘县"
  },
  "513225": {
    code: "513225",
    text: "九寨沟县"
  },
  "513226": {
    code: "513226",
    text: "金川县"
  },
  "513227": {
    code: "513227",
    text: "小金县"
  },
  "513228": {
    code: "513228",
    text: "黑水县"
  },
  "513229": {
    code: "513229",
    text: "马尔康县"
  },
  "513230": {
    code: "513230",
    text: "壤塘县"
  },
  "513231": {
    code: "513231",
    text: "阿坝县"
  },
  "513232": {
    code: "513232",
    text: "若尔盖县"
  },
  "513233": {
    code: "513233",
    text: "红原县"
  },
  //四川省 甘孜藏族自治州
  "513301": {
    code: "513301",
    text: "康定市"
  },
  "513321": {
    code: "513321",
    text: "康定县"
  },
  "513322": {
    code: "513322",
    text: "泸定县"
  },
  "513323": {
    code: "513323",
    text: "丹巴县"
  },
  "513324": {
    code: "513324",
    text: "九龙县"
  },
  "513325": {
    code: "513325",
    text: "雅江县"
  },
  "513326": {
    code: "513326",
    text: "道孚县"
  },
  "513327": {
    code: "513327",
    text: "炉霍县"
  },
  "513328": {
    code: "513328",
    text: "甘孜县"
  },
  "513329": {
    code: "513329",
    text: "新龙县"
  },
  "513330": {
    code: "513330",
    text: "德格县"
  },
  "513331": {
    code: "513331",
    text: "白玉县"
  },
  "513332": {
    code: "513332",
    text: "石渠县"
  },
  "513333": {
    code: "513333",
    text: "色达县"
  },
  "513334": {
    code: "513334",
    text: "理塘县"
  },
  "513335": {
    code: "513335",
    text: "巴塘县"
  },
  "513336": {
    code: "513336",
    text: "乡城县"
  },
  "513337": {
    code: "513337",
    text: "稻城县"
  },
  "513338": {
    code: "513338",
    text: "得荣县"
  },
  //四川省 凉山彝族自治州
  "513401": {
    code: "513401",
    text: "西昌市"
  },
  "513422": {
    code: "513422",
    text: "木里藏族自治县"
  },
  "513423": {
    code: "513423",
    text: "盐源县"
  },
  "513424": {
    code: "513424",
    text: "德昌县"
  },
  "513425": {
    code: "513425",
    text: "会理县"
  },
  "513426": {
    code: "513426",
    text: "会东县"
  },
  "513427": {
    code: "513427",
    text: "宁南县"
  },
  "513428": {
    code: "513428",
    text: "普格县"
  },
  "513429": {
    code: "513429",
    text: "布拖县"
  },
  "513430": {
    code: "513430",
    text: "金阳县"
  },
  "513431": {
    code: "513431",
    text: "昭觉县"
  },
  "513432": {
    code: "513432",
    text: "喜德县"
  },
  "513433": {
    code: "513433",
    text: "冕宁县"
  },
  "513434": {
    code: "513434",
    text: "越西县"
  },
  "513435": {
    code: "513435",
    text: "甘洛县"
  },
  "513436": {
    code: "513436",
    text: "美姑县"
  },
  "513437": {
    code: "513437",
    text: "雷波县"
  },
  //贵州省
  //贵州省 贵阳市
  "520101": {
    code: "520101",
    text: "市辖区"
  },
  "520102": {
    code: "520102",
    text: "南明区"
  },
  "520103": {
    code: "520103",
    text: "云岩区"
  },
  "520111": {
    code: "520111",
    text: "花溪区"
  },
  "520112": {
    code: "520112",
    text: "乌当区"
  },
  "520113": {
    code: "520113",
    text: "白云区"
  },
  "520114": {
    code: "520114",
    text: "小河区"
  },
  "520115": {
    code: "520115",
    text: "观山湖区"
  },
  "520121": {
    code: "520121",
    text: "开阳县"
  },
  "520122": {
    code: "520122",
    text: "息烽县"
  },
  "520123": {
    code: "520123",
    text: "修文县"
  },
  "520181": {
    code: "520181",
    text: "清镇市"
  },
  //贵州省 六盘水市
  "520201": {
    code: "520201",
    text: "钟山区"
  },
  "520202": {
    code: "520202",
    text: "盘县特区"
  },
  "520203": {
    code: "520203",
    text: "六枝特区"
  },
  "520221": {
    code: "520221",
    text: "水城县"
  },
  "520222": {
    code: "520222",
    text: "盘县"
  },
  //贵州省 遵义市
  "520301": {
    code: "520301",
    text: "市辖区"
  },
  "520302": {
    code: "520302",
    text: "红花岗区"
  },
  "520303": {
    code: "520303",
    text: "汇川区"
  },
  "520321": {
    code: "520321",
    text: "遵义县"
  },
  "520322": {
    code: "520322",
    text: "桐梓县"
  },
  "520323": {
    code: "520323",
    text: "绥阳县"
  },
  "520324": {
    code: "520324",
    text: "正安县"
  },
  "520325": {
    code: "520325",
    text: "道真仡佬族苗族自治县"
  },
  "520326": {
    code: "520326",
    text: "务川仡佬族苗族自治县"
  },
  "520327": {
    code: "520327",
    text: "凤冈县"
  },
  "520328": {
    code: "520328",
    text: "湄潭县"
  },
  "520329": {
    code: "520329",
    text: "余庆县"
  },
  "520330": {
    code: "520330",
    text: "习水县"
  },
  "520381": {
    code: "520381",
    text: "赤水市"
  },
  "520382": {
    code: "520382",
    text: "仁怀市"
  },
  //贵州省 安顺市
  "520401": {
    code: "520401",
    text: "市辖区"
  },
  "520402": {
    code: "520402",
    text: "西秀区"
  },
  "520403": {
    code: "520403",
    text: "平坝区"
  },
  "520421": {
    code: "520421",
    text: "平坝县"
  },
  "520422": {
    code: "520422",
    text: "普定县"
  },
  "520423": {
    code: "520423",
    text: "镇宁布依族苗族自治县"
  },
  "520424": {
    code: "520424",
    text: "关岭布依族苗族自治县"
  },
  "520425": {
    code: "520425",
    text: "紫云苗族布依族自治县"
  },
  //贵州省 毕节市
  "520501": {
    code: "520501",
    text: "市辖区"
  },
  "520502": {
    code: "520502",
    text: "七星关区"
  },
  "520521": {
    code: "520521",
    text: "大方县"
  },
  "520522": {
    code: "520522",
    text: "黔西县"
  },
  "520523": {
    code: "520523",
    text: "金沙县"
  },
  "520524": {
    code: "520524",
    text: "织金县"
  },
  "520525": {
    code: "520525",
    text: "纳雍县"
  },
  "520526": {
    code: "520526",
    text: "威宁彝族回族苗族自治县"
  },
  "520527": {
    code: "520527",
    text: "赫章县"
  },
  //贵州省 铜仁市
  "520601": {
    code: "520601",
    text: "市辖区"
  },
  "520602": {
    code: "520602",
    text: "碧江区"
  },
  "520603": {
    code: "520603",
    text: "万山区"
  },
  "520621": {
    code: "520621",
    text: "江口县"
  },
  "520622": {
    code: "520622",
    text: "玉屏侗族自治县"
  },
  "520623": {
    code: "520623",
    text: "石阡县"
  },
  "520624": {
    code: "520624",
    text: "思南县"
  },
  "520625": {
    code: "520625",
    text: "印江土家族苗族自治县"
  },
  "520626": {
    code: "520626",
    text: "德江县"
  },
  "520627": {
    code: "520627",
    text: "沿河土家族自治县"
  },
  "520628": {
    code: "520628",
    text: "松桃苗族自治县"
  },
  //贵州省 黔西南布依族苗族自治州
  "522301": {
    code: "522301",
    text: "兴义市"
  },
  "522302": {
    code: "522302",
    text: "赤壁市"
  },
  "522321": {
    code: "522321",
    text: "兴义县"
  },
  "522322": {
    code: "522322",
    text: "兴仁县"
  },
  "522323": {
    code: "522323",
    text: "普安县"
  },
  "522324": {
    code: "522324",
    text: "晴隆县"
  },
  "522325": {
    code: "522325",
    text: "贞丰县"
  },
  "522326": {
    code: "522326",
    text: "望谟县"
  },
  "522327": {
    code: "522327",
    text: "册亨县"
  },
  "522328": {
    code: "522328",
    text: "安龙县"
  },
  //贵州省 黔东南苗族侗族自治州
  "522601": {
    code: "522601",
    text: "凯里市"
  },
  "522622": {
    code: "522622",
    text: "黄平县"
  },
  "522623": {
    code: "522623",
    text: "施秉县"
  },
  "522624": {
    code: "522624",
    text: "三穗县"
  },
  "522625": {
    code: "522625",
    text: "镇远县"
  },
  "522626": {
    code: "522626",
    text: "岑巩县"
  },
  "522627": {
    code: "522627",
    text: "天柱县"
  },
  "522628": {
    code: "522628",
    text: "锦屏县"
  },
  "522629": {
    code: "522629",
    text: "剑河县"
  },
  "522630": {
    code: "522630",
    text: "台江县"
  },
  "522631": {
    code: "522631",
    text: "黎平县"
  },
  "522632": {
    code: "522632",
    text: "榕江县"
  },
  "522633": {
    code: "522633",
    text: "从江县"
  },
  "522634": {
    code: "522634",
    text: "雷山县"
  },
  "522635": {
    code: "522635",
    text: "麻江县"
  },
  "522636": {
    code: "522636",
    text: "丹寨县"
  },
  //贵州省 黔南布依族苗族自治州
  "522701": {
    code: "522701",
    text: "都匀市"
  },
  "522702": {
    code: "522702",
    text: "福泉市"
  },
  "522722": {
    code: "522722",
    text: "荔波县"
  },
  "522723": {
    code: "522723",
    text: "贵定县"
  },
  "522725": {
    code: "522725",
    text: "瓮安县"
  },
  "522726": {
    code: "522726",
    text: "独山县"
  },
  "522727": {
    code: "522727",
    text: "平塘县"
  },
  "522728": {
    code: "522728",
    text: "罗甸县"
  },
  "522729": {
    code: "522729",
    text: "长顺县"
  },
  "522730": {
    code: "522730",
    text: "龙里县"
  },
  "522731": {
    code: "522731",
    text: "惠水县"
  },
  "522732": {
    code: "522732",
    text: "三都水族自治县"
  },
  //云南省
  //云南省 昆明市
  "530101": {
    code: "530101",
    text: "市辖区"
  },
  "530102": {
    code: "530102",
    text: "五华区"
  },
  "530103": {
    code: "530103",
    text: "盘龙区"
  },
  "530111": {
    code: "530111",
    text: "官渡区"
  },
  "530112": {
    code: "530112",
    text: "西山区"
  },
  "530113": {
    code: "530113",
    text: "东川区"
  },
  "530114": {
    code: "530114",
    text: "呈贡区"
  },
  "530121": {
    code: "530121",
    text: "呈贡县"
  },
  "530122": {
    code: "530122",
    text: "晋宁县"
  },
  "530123": {
    code: "530123",
    text: "安宁县"
  },
  "530124": {
    code: "530124",
    text: "富民县"
  },
  "530125": {
    code: "530125",
    text: "宜良县"
  },
  "530126": {
    code: "530126",
    text: "石林彝族自治县"
  },
  "530127": {
    code: "530127",
    text: "嵩明县"
  },
  "530128": {
    code: "530128",
    text: "禄劝彝族苗族自治县"
  },
  "530129": {
    code: "530129",
    text: "寻甸回族彝族自治县"
  },
  "530181": {
    code: "530181",
    text: "安宁市"
  },
  //云南省 曲靖市
  "530301": {
    code: "530301",
    text: "市辖区"
  },
  "530302": {
    code: "530302",
    text: "麒麟区"
  },
  "530321": {
    code: "530321",
    text: "马龙县"
  },
  "530322": {
    code: "530322",
    text: "陆良县"
  },
  "530323": {
    code: "530323",
    text: "师宗县"
  },
  "530324": {
    code: "530324",
    text: "罗平县"
  },
  "530325": {
    code: "530325",
    text: "富源县"
  },
  "530326": {
    code: "530326",
    text: "会泽县"
  },
  "530328": {
    code: "530328",
    text: "沾益县"
  },
  "530381": {
    code: "530381",
    text: "宣威市"
  },
  //云南省 玉溪市
  "530401": {
    code: "530401",
    text: "市辖区"
  },
  "530402": {
    code: "530402",
    text: "红塔区"
  },
  "530403": {
    code: "530403",
    text: "江川区"
  },
  "530421": {
    code: "530421",
    text: "江川县"
  },
  "530422": {
    code: "530422",
    text: "澄江县"
  },
  "530423": {
    code: "530423",
    text: "通海县"
  },
  "530424": {
    code: "530424",
    text: "华宁县"
  },
  "530425": {
    code: "530425",
    text: "易门县"
  },
  "530426": {
    code: "530426",
    text: "峨山彝族自治县"
  },
  "530427": {
    code: "530427",
    text: "新平彝族傣族自治县"
  },
  "530428": {
    code: "530428",
    text: "元江哈尼族彝族傣族自治县"
  },
  //云南省 保山市
  "530501": {
    code: "530501",
    text: "市辖区"
  },
  "530502": {
    code: "530502",
    text: "隆阳区"
  },
  "530521": {
    code: "530521",
    text: "施甸县"
  },
  "530522": {
    code: "530522",
    text: "腾冲县"
  },
  "530523": {
    code: "530523",
    text: "龙陵县"
  },
  "530524": {
    code: "530524",
    text: "昌宁县"
  },
  "530581": {
    code: "530581",
    text: "腾冲市"
  },
  //云南省 昭通市
  "530601": {
    code: "530601",
    text: "市辖区"
  },
  "530602": {
    code: "530602",
    text: "昭阳区"
  },
  "530621": {
    code: "530621",
    text: "鲁甸县"
  },
  "530622": {
    code: "530622",
    text: "巧家县"
  },
  "530623": {
    code: "530623",
    text: "盐津县"
  },
  "530624": {
    code: "530624",
    text: "大关县"
  },
  "530625": {
    code: "530625",
    text: "永善县"
  },
  "530626": {
    code: "530626",
    text: "绥江县"
  },
  "530627": {
    code: "530627",
    text: "镇雄县"
  },
  "530628": {
    code: "530628",
    text: "彝良县"
  },
  "530629": {
    code: "530629",
    text: "威信县"
  },
  "530630": {
    code: "530630",
    text: "水富县"
  },
  //云南省 丽江市
  "530701": {
    code: "530701",
    text: "市辖区"
  },
  "530702": {
    code: "530702",
    text: "古城区"
  },
  "530721": {
    code: "530721",
    text: "玉龙纳西族自治县"
  },
  "530722": {
    code: "530722",
    text: "永胜县"
  },
  "530723": {
    code: "530723",
    text: "华坪县"
  },
  "530724": {
    code: "530724",
    text: "宁蒗彝族自治县"
  },
  //云南省 普洱市
  "530801": {
    code: "530801",
    text: "市辖区"
  },
  "530802": {
    code: "530802",
    text: "思茅区"
  },
  "530821": {
    code: "530821",
    text: "宁洱哈尼族彝族自治县"
  },
  "530822": {
    code: "530822",
    text: "墨江哈尼族自治县"
  },
  "530823": {
    code: "530823",
    text: "景东彝族自治县"
  },
  "530824": {
    code: "530824",
    text: "景谷傣族彝族自治县"
  },
  "530825": {
    code: "530825",
    text: "镇沅彝族哈尼族拉祜族自治县"
  },
  "530826": {
    code: "530826",
    text: "江城哈尼族彝族自治县"
  },
  "530827": {
    code: "530827",
    text: "孟连傣族拉祜族佤族自治县"
  },
  "530828": {
    code: "530828",
    text: "澜沧拉祜族自治县"
  },
  "530829": {
    code: "530829",
    text: "西盟佤族自治县"
  },
  //云南省 临沧市
  "530901": {
    code: "530901",
    text: "市辖区"
  },
  "530902": {
    code: "530902",
    text: "临翔区"
  },
  "530921": {
    code: "530921",
    text: "凤庆县"
  },
  "530922": {
    code: "530922",
    text: "云县"
  },
  "530923": {
    code: "530923",
    text: "永德县"
  },
  "530924": {
    code: "530924",
    text: "镇康县"
  },
  "530925": {
    code: "530925",
    text: "双江拉祜族佤族布朗族傣族自治县"
  },
  "530926": {
    code: "530926",
    text: "耿马傣族佤族自治县"
  },
  "530927": {
    code: "530927",
    text: "沧源佤族自治县"
  },
  //云南省 楚雄彝族自治州
  "532301": {
    code: "532301",
    text: "楚雄市"
  },
  "532321": {
    code: "532321",
    text: "楚雄县"
  },
  "532322": {
    code: "532322",
    text: "双柏县"
  },
  "532323": {
    code: "532323",
    text: "牟定县"
  },
  "532324": {
    code: "532324",
    text: "南华县"
  },
  "532325": {
    code: "532325",
    text: "姚安县"
  },
  "532326": {
    code: "532326",
    text: "大姚县"
  },
  "532327": {
    code: "532327",
    text: "永仁县"
  },
  "532328": {
    code: "532328",
    text: "元谋县"
  },
  "532329": {
    code: "532329",
    text: "武定县"
  },
  "532330": {
    code: "532330",
    text: "禄劝县"
  },
  "532331": {
    code: "532331",
    text: "禄丰县"
  },
  //云南省 红河哈尼族彝族自治州
  "532501": {
    code: "532501",
    text: "个旧市"
  },
  "532502": {
    code: "532502",
    text: "开远市"
  },
  "532503": {
    code: "532503",
    text: "蒙自市"
  },
  "532504": {
    code: "532504",
    text: "弥勒市"
  },
  "532522": {
    code: "532522",
    text: "蒙自县"
  },
  "532523": {
    code: "532523",
    text: "屏边苗族自治县"
  },
  "532524": {
    code: "532524",
    text: "建水县"
  },
  "532525": {
    code: "532525",
    text: "石屏县"
  },
  "532526": {
    code: "532526",
    text: "弥勒县"
  },
  "532527": {
    code: "532527",
    text: "泸西县"
  },
  "532528": {
    code: "532528",
    text: "元阳县"
  },
  "532529": {
    code: "532529",
    text: "红河县"
  },
  "532530": {
    code: "532530",
    text: "金平苗族瑶族傣族自治县"
  },
  "532531": {
    code: "532531",
    text: "绿春县"
  },
  "532532": {
    code: "532532",
    text: "河口瑶族自治县"
  },
  //云南省 文山壮族苗族自治州
  "532601": {
    code: "532601",
    text: "文山市"
  },
  "532621": {
    code: "532621",
    text: "文山县"
  },
  "532622": {
    code: "532622",
    text: "砚山县"
  },
  "532623": {
    code: "532623",
    text: "西畴县"
  },
  "532624": {
    code: "532624",
    text: "麻栗坡县"
  },
  "532625": {
    code: "532625",
    text: "马关县"
  },
  "532626": {
    code: "532626",
    text: "丘北县"
  },
  "532627": {
    code: "532627",
    text: "广南县"
  },
  "532628": {
    code: "532628",
    text: "富宁县"
  },
  //云南省 西双版纳傣族自治州
  "532801": {
    code: "532801",
    text: "景洪市"
  },
  "532822": {
    code: "532822",
    text: "勐海县"
  },
  "532823": {
    code: "532823",
    text: "勐腊县"
  },
  //云南省 大理白族自治州
  "532901": {
    code: "532901",
    text: "大理市"
  },
  "532922": {
    code: "532922",
    text: "漾濞彝族自治县"
  },
  "532923": {
    code: "532923",
    text: "祥云县"
  },
  "532924": {
    code: "532924",
    text: "宾川县"
  },
  "532925": {
    code: "532925",
    text: "弥渡县"
  },
  "532926": {
    code: "532926",
    text: "南涧彝族自治县"
  },
  "532927": {
    code: "532927",
    text: "巍山彝族回族自治县"
  },
  "532928": {
    code: "532928",
    text: "永平县"
  },
  "532929": {
    code: "532929",
    text: "云龙县"
  },
  "532930": {
    code: "532930",
    text: "洱源县"
  },
  "532931": {
    code: "532931",
    text: "剑川县"
  },
  "532932": {
    code: "532932",
    text: "鹤庆县"
  },
  //云南省 德宏傣族景颇族自治州
  "533101": {
    code: "533101",
    text: "畹町市"
  },
  "533102": {
    code: "533102",
    text: "瑞丽市"
  },
  "533103": {
    code: "533103",
    text: "芒市"
  },
  "533121": {
    code: "533121",
    text: "潞西县"
  },
  "533122": {
    code: "533122",
    text: "梁河县"
  },
  "533123": {
    code: "533123",
    text: "盈江县"
  },
  "533124": {
    code: "533124",
    text: "陇川县"
  },
  "533125": {
    code: "533125",
    text: "瑞丽县"
  },
  "533126": {
    code: "533126",
    text: "畹町镇"
  },
  //云南省 怒江傈僳族自治州
  "533321": {
    code: "533321",
    text: "泸水县"
  },
  "533322": {
    code: "533322",
    text: "碧江县"
  },
  "533323": {
    code: "533323",
    text: "福贡县"
  },
  "533324": {
    code: "533324",
    text: "贡山独龙族怒族自治县"
  },
  "533325": {
    code: "533325",
    text: "兰坪白族普米族自治县"
  },
  //云南省 迪庆藏族自治州
  "533401": {
    code: "533401",
    text: "香格里拉市"
  },
  "533421": {
    code: "533421",
    text: "香格里拉县"
  },
  "533422": {
    code: "533422",
    text: "德钦县"
  },
  "533423": {
    code: "533423",
    text: "维西傈僳族自治县"
  },
  //西藏
  //西藏 拉萨市
  "540101": {
    code: "540101",
    text: "市辖区"
  },
  "540102": {
    code: "540102",
    text: "城关区"
  },
  "540103": {
    code: "540103",
    text: "堆龙德庆区"
  },
  "540121": {
    code: "540121",
    text: "林周县"
  },
  "540122": {
    code: "540122",
    text: "当雄县"
  },
  "540123": {
    code: "540123",
    text: "尼木县"
  },
  "540124": {
    code: "540124",
    text: "曲水县"
  },
  "540125": {
    code: "540125",
    text: "堆龙德庆县"
  },
  "540126": {
    code: "540126",
    text: "达孜县"
  },
  "540127": {
    code: "540127",
    text: "墨竹工卡县"
  },
  "540128": {
    code: "540128",
    text: "工布江达县"
  },
  "540129": {
    code: "540129",
    text: "林芝县"
  },
  "540130": {
    code: "540130",
    text: "米林县"
  },
  "540131": {
    code: "540131",
    text: "墨脱县"
  },
  //西藏 日喀则市
  "540202": {
    code: "540202",
    text: "桑珠孜区"
  },
  "540221": {
    code: "540221",
    text: "南木林县"
  },
  "540222": {
    code: "540222",
    text: "江孜县"
  },
  "540223": {
    code: "540223",
    text: "定日县"
  },
  "540224": {
    code: "540224",
    text: "萨迦县"
  },
  "540225": {
    code: "540225",
    text: "拉孜县"
  },
  "540226": {
    code: "540226",
    text: "昂仁县"
  },
  "540227": {
    code: "540227",
    text: "谢通门县"
  },
  "540228": {
    code: "540228",
    text: "白朗县"
  },
  "540229": {
    code: "540229",
    text: "仁布县"
  },
  "540230": {
    code: "540230",
    text: "康马县"
  },
  "540231": {
    code: "540231",
    text: "定结县"
  },
  "540232": {
    code: "540232",
    text: "仲巴县"
  },
  "540233": {
    code: "540233",
    text: "亚东县"
  },
  "540234": {
    code: "540234",
    text: "吉隆县"
  },
  "540235": {
    code: "540235",
    text: "聂拉木县"
  },
  "540236": {
    code: "540236",
    text: "萨嘎县"
  },
  "540237": {
    code: "540237",
    text: "岗巴县"
  },
  "540302": {
    code: "540302",
    text: "卡若区"
  },
  "540321": {
    code: "540321",
    text: "江达县"
  },
  "540322": {
    code: "540322",
    text: "贡觉县"
  },
  "540323": {
    code: "540323",
    text: "类乌齐县"
  },
  "540324": {
    code: "540324",
    text: "丁青县"
  },
  "540325": {
    code: "540325",
    text: "察雅县"
  },
  "540326": {
    code: "540326",
    text: "八宿县"
  },   　　
　"540327": {
    code: "540327",
    text: "左贡县"
  },
  "540328": {
    code: "540328",
    text: "芒康县"
  },
  "540329": {
    code: "540329",
    text: "洛隆县"
  },
  "540330": {
    code: "540330",
    text: "边坝县"
  },
  "540402": {
    code: "540402",
    text: "巴宜区"
  },
  "540421": {
    code: "540421",
    text: "工布江达县"
  },
  "540422": {
    code: "540422",
    text: "米林县"
  },   　　
　"540423": {
    code: "540423",
    text: "墨脱县"
  },
  "540424": {
    code: "540424",
    text: "波密县"
  },
  "540425": {
    code: "540425",
    text: "察隅县"
  },
  "540426": {
    code: "540426",
    text: "朗县"
  },
  "540501": {
    code: "540501",
    text: "市辖区"
  },
  "540502": {
    code: "540502",
    text: "乃东区"
  },
  "540521": {
    code: "540521",
    text: "扎囊县"
  },
  "540522": {
    code: "540522",
    text: "贡嘎县"
  },
  "540523": {
    code: "540523",
    text: "桑日县"
  },
  "540524": {
    code: "540524",
    text: "琼结县"
  },
  "540525": {
    code: "540525",
    text: "曲松县"
  },
  "540526": {
    code: "540526",
    text: "措美县"
  },
  "540527": {
    code: "540527",
    text: "洛扎县"
  },
  "540528": {
    code: "540528",
    text: "加查县"
  },
  "540529": {
    code: "540529",
    text: "隆子县"
  },
  "540530": {
    code: "540530",
    text: "错那县"
  },
  "540531": {
    code: "540531",
    text: "浪卡子县"
  },   　　     　　     　　 　　
  //西藏 昌都地区
  "542121": {
    code: "542121",
    text: "昌都县"
  },
  "542122": {
    code: "542122",
    text: "江达县"
  },
  "542123": {
    code: "542123",
    text: "贡觉县"
  },
  "542124": {
    code: "542124",
    text: "类乌齐县"
  },
  "542125": {
    code: "542125",
    text: "丁青县"
  },
  "542126": {
    code: "542126",
    text: "察雅县"
  },
  "542127": {
    code: "542127",
    text: "八宿县"
  },
  "542128": {
    code: "542128",
    text: "左贡县"
  },
  "542129": {
    code: "542129",
    text: "芒康县"
  },
  "542132": {
    code: "542132",
    text: "洛隆县"
  },
  "542133": {
    code: "542133",
    text: "边坝县"
  },
  "542134": {
    code: "542134",
    text: "盐井县"
  },
  "542135": {
    code: "542135",
    text: "碧土县"
  },
  "542136": {
    code: "542136",
    text: "妥坝县"
  },
  "542137": {
    code: "542137",
    text: "生达县"
  },
  //西藏 山南地区
  "542221": {
    code: "542221",
    text: "乃东县"
  },
  "542222": {
    code: "542222",
    text: "扎囊县"
  },
  "542223": {
    code: "542223",
    text: "贡嘎县"
  },
  "542224": {
    code: "542224",
    text: "桑日县"
  },
  "542225": {
    code: "542225",
    text: "琼结县"
  },
  "542226": {
    code: "542226",
    text: "曲松县"
  },
  "542227": {
    code: "542227",
    text: "措美县"
  },
  "542228": {
    code: "542228",
    text: "洛扎县"
  },
  "542229": {
    code: "542229",
    text: "加查县"
  },
  "542230": {
    code: "542230",
    text: "朗县"
  },
  "542231": {
    code: "542231",
    text: "隆子县"
  },
  "542232": {
    code: "542232",
    text: "错那县"
  },
  "542233": {
    code: "542233",
    text: "浪卡子县"
  },
  //西藏 那曲地区
  "542421": {
    code: "542421",
    text: "那曲县"
  },
  "542422": {
    code: "542422",
    text: "嘉黎县"
  },
  "542423": {
    code: "542423",
    text: "比如县"
  },
  "542424": {
    code: "542424",
    text: "聂荣县"
  },
  "542425": {
    code: "542425",
    text: "安多县"
  },
  "542426": {
    code: "542426",
    text: "申扎县"
  },
  "542427": {
    code: "542427",
    text: "索县"
  },
  "542428": {
    code: "542428",
    text: "班戈县"
  },
  "542429": {
    code: "542429",
    text: "巴青县"
  },
  "542430": {
    code: "542430",
    text: "尼玛县"
  },
  "542431": {
    code: "542431",
    text: "双湖县"
  },
  //西藏 阿里地区
  "542521": {
    code: "542521",
    text: "普兰县"
  },
  "542522": {
    code: "542522",
    text: "札达县"
  },
  "542523": {
    code: "542523",
    text: "噶尔县"
  },
  "542524": {
    code: "542524",
    text: "日土县"
  },
  "542525": {
    code: "542525",
    text: "革吉县"
  },
  "542526": {
    code: "542526",
    text: "改则县"
  },
  "542527": {
    code: "542527",
    text: "措勤县"
  },
  //西藏 林芝地区
  "542621": {
    code: "542621",
    text: "林芝县"
  },
  "542622": {
    code: "542622",
    text: "工布江达县"
  },
  "542623": {
    code: "542623",
    text: "米林县"
  },
  "542624": {
    code: "542624",
    text: "墨脱县"
  },
  "542625": {
    code: "542625",
    text: "波密县"
  },
  "542626": {
    code: "542626",
    text: "察隅县"
  },
  "542627": {
    code: "542627",
    text: "朗县"
  },
  "542628": {
    code: "542628",
    text: "隆格尔县"
  },
  //陕西省
  //陕西省 西安市
  "610101": {
    code: "610101",
    text: "市辖区"
  },
  "610102": {
    code: "610102",
    text: "新城区"
  },
  "610103": {
    code: "610103",
    text: "碑林区"
  },
  "610104": {
    code: "610104",
    text: "莲湖区"
  },
  "610106": {
    code: "610106",
    text: "经济开发区"
  },
  "610111": {
    code: "610111",
    text: "灞桥区"
  },
  "610112": {
    code: "610112",
    text: "未央区"
  },
  "610113": {
    code: "610113",
    text: "雁塔区"
  },
  "610114": {
    code: "610114",
    text: "阎良区"
  },
  "610115": {
    code: "610115",
    text: "临潼区"
  },
  "610116": {
    code: "610116",
    text: "长安区"
  },
  "610117": {
    code: "610117",
    text: "高陵区"
  },
  "610121": {
    code: "610121",
    text: "长安县"
  },
  "610122": {
    code: "610122",
    text: "蓝田县"
  },
  "610123": {
    code: "610123",
    text: "临潼县"
  },
  "610124": {
    code: "610124",
    text: "周至县"
  },
  "610125": {
    code: "610125",
    text: "户县"
  },
  "610126": {
    code: "610126",
    text: "高陵县"
  },
  //陕西省 铜川市
  "610201": {
    code: "610201",
    text: "市辖区"
  },
  "610202": {
    code: "610202",
    text: "王益区"
  },
  "610203": {
    code: "610203",
    text: "印台区"
  },
  "610204": {
    code: "610204",
    text: "耀州区"
  },
  "610221": {
    code: "610221",
    text: "耀县"
  },
  "610222": {
    code: "610222",
    text: "宜君县"
  },
  //陕西省 宝鸡市
  "610301": {
    code: "610301",
    text: "市辖区"
  },
  "610302": {
    code: "610302",
    text: "渭滨区"
  },
  "610303": {
    code: "610303",
    text: "金台区"
  },
  "610304": {
    code: "610304",
    text: "陈仓区"
  },
  "610321": {
    code: "610321",
    text: "宝鸡县"
  },
  "610322": {
    code: "610322",
    text: "凤翔县"
  },
  "610323": {
    code: "610323",
    text: "岐山县"
  },
  "610324": {
    code: "610324",
    text: "扶风县"
  },
  "610325": {
    code: "610325",
    text: "武功县"
  },
  "610326": {
    code: "610326",
    text: "眉县"
  },
  "610327": {
    code: "610327",
    text: "陇县"
  },
  "610328": {
    code: "610328",
    text: "千阳县"
  },
  "610329": {
    code: "610329",
    text: "麟游县"
  },
  "610330": {
    code: "610330",
    text: "凤县"
  },
  "610331": {
    code: "610331",
    text: "太白县"
  },
  //陕西省 咸阳市
  "610401": {
    code: "610401",
    text: "市辖区"
  },
  "610402": {
    code: "610402",
    text: "秦都区"
  },
  "610403": {
    code: "610403",
    text: "杨陵区"
  },
  "610404": {
    code: "610404",
    text: "渭城区"
  },
  "610421": {
    code: "610421",
    text: "兴平县"
  },
  "610422": {
    code: "610422",
    text: "三原县"
  },
  "610423": {
    code: "610423",
    text: "泾阳县"
  },
  "610424": {
    code: "610424",
    text: "乾县"
  },
  "610425": {
    code: "610425",
    text: "礼泉县"
  },
  "610426": {
    code: "610426",
    text: "永寿县"
  },
  "610427": {
    code: "610427",
    text: "彬县"
  },
  "610428": {
    code: "610428",
    text: "长武县"
  },
  "610429": {
    code: "610429",
    text: "旬邑县"
  },
  "610430": {
    code: "610430",
    text: "淳化县"
  },
  "610431": {
    code: "610431",
    text: "武功县"
  },
  "610481": {
    code: "610481",
    text: "兴平市"
  },
  //陕西省 渭南市
  "610501": {
    code: "610501",
    text: "市辖区"
  },
  "610502": {
    code: "610502",
    text: "临渭区"
  },
  "610503": {
    code: "610503",
    text: "华州区"
  },
  "610521": {
    code: "610521",
    text: "华县"
  },
  "610522": {
    code: "610522",
    text: "潼关县"
  },
  "610523": {
    code: "610523",
    text: "大荔县"
  },
  "610524": {
    code: "610524",
    text: "合阳县"
  },
  "610525": {
    code: "610525",
    text: "澄城县"
  },
  "610526": {
    code: "610526",
    text: "蒲城县"
  },
  "610527": {
    code: "610527",
    text: "白水县"
  },
  "610528": {
    code: "610528",
    text: "富平县"
  },
  "610581": {
    code: "610581",
    text: "韩城市"
  },
  "610582": {
    code: "610582",
    text: "华阴市"
  },
  //陕西省 延安市
  "610601": {
    code: "610601",
    text: "市辖区"
  },
  "610602": {
    code: "610602",
    text: "宝塔区"
  },
  "610621": {
    code: "610621",
    text: "延长县"
  },
  "610622": {
    code: "610622",
    text: "延川县"
  },
  "610623": {
    code: "610623",
    text: "子长县"
  },
  "610624": {
    code: "610624",
    text: "安塞县"
  },
  "610625": {
    code: "610625",
    text: "志丹县"
  },
  "610626": {
    code: "610626",
    text: "吴起县"
  },
  "610627": {
    code: "610627",
    text: "甘泉县"
  },
  "610628": {
    code: "610628",
    text: "富县"
  },
  "610629": {
    code: "610629",
    text: "洛川县"
  },
  "610630": {
    code: "610630",
    text: "宜川县"
  },
  "610631": {
    code: "610631",
    text: "黄龙县"
  },
  "610632": {
    code: "610632",
    text: "黄陵县"
  },
  //陕西省 汉中市
  "610701": {
    code: "610701",
    text: "市辖区"
  },
  "610702": {
    code: "610702",
    text: "汉台区"
  },
  "610721": {
    code: "610721",
    text: "南郑县"
  },
  "610722": {
    code: "610722",
    text: "城固县"
  },
  "610723": {
    code: "610723",
    text: "洋县"
  },
  "610724": {
    code: "610724",
    text: "西乡县"
  },
  "610725": {
    code: "610725",
    text: "勉县"
  },
  "610726": {
    code: "610726",
    text: "宁强县"
  },
  "610727": {
    code: "610727",
    text: "略阳县"
  },
  "610728": {
    code: "610728",
    text: "镇巴县"
  },
  "610729": {
    code: "610729",
    text: "留坝县"
  },
  "610730": {
    code: "610730",
    text: "佛坪县"
  },
  //陕西省 榆林市
  "610801": {
    code: "610801",
    text: "市辖区"
  },
  "610802": {
    code: "610802",
    text: "榆阳区"
  },
  "610821": {
    code: "610821",
    text: "神木县"
  },
  "610822": {
    code: "610822",
    text: "府谷县"
  },
  "610823": {
    code: "610823",
    text: "横山县"
  },
  "610824": {
    code: "610824",
    text: "靖边县"
  },
  "610825": {
    code: "610825",
    text: "定边县"
  },
  "610826": {
    code: "610826",
    text: "绥德县"
  },
  "610827": {
    code: "610827",
    text: "米脂县"
  },
  "610828": {
    code: "610828",
    text: "佳县"
  },
  "610829": {
    code: "610829",
    text: "吴堡县"
  },
  "610830": {
    code: "610830",
    text: "清涧县"
  },
  "610831": {
    code: "610831",
    text: "子洲县"
  },
  //陕西省 安康市
  "610901": {
    code: "610901",
    text: "市辖区"
  },
  "610902": {
    code: "610902",
    text: "汉滨区"
  },
  "610921": {
    code: "610921",
    text: "汉阴县"
  },
  "610922": {
    code: "610922",
    text: "石泉县"
  },
  "610923": {
    code: "610923",
    text: "宁陕县"
  },
  "610924": {
    code: "610924",
    text: "紫阳县"
  },
  "610925": {
    code: "610925",
    text: "岚皋县"
  },
  "610926": {
    code: "610926",
    text: "平利县"
  },
  "610927": {
    code: "610927",
    text: "镇坪县"
  },
  "610928": {
    code: "610928",
    text: "旬阳县"
  },
  "610929": {
    code: "610929",
    text: "白河县"
  },
  //陕西省 商洛市
  "611001": {
    code: "611001",
    text: "市辖区"
  },
  "611002": {
    code: "611002",
    text: "商州区"
  },
  "611021": {
    code: "611021",
    text: "洛南县"
  },
  "611022": {
    code: "611022",
    text: "丹凤县"
  },
  "611023": {
    code: "611023",
    text: "商南县"
  },
  "611024": {
    code: "611024",
    text: "山阳县"
  },
  "611025": {
    code: "611025",
    text: "镇安县"
  },
  "611026": {
    code: "611026",
    text: "柞水县"
  },
  //甘肃省
  //甘肃省 兰州市
  "620101": {
    code: "620101",
    text: "市辖区"
  },
  "620102": {
    code: "620102",
    text: "城关区"
  },
  "620103": {
    code: "620103",
    text: "七里河区"
  },
  "620104": {
    code: "620104",
    text: "西固区"
  },
  "620105": {
    code: "620105",
    text: "安宁区"
  },
  "620111": {
    code: "620111",
    text: "红古区"
  },
  "620121": {
    code: "620121",
    text: "永登县"
  },
  "620122": {
    code: "620122",
    text: "皋兰县"
  },
  "620123": {
    code: "620123",
    text: "榆中县"
  },
  //甘肃省 嘉峪关市
  "620201": {
    code: "620201",
    text: "市辖区"
  },
  "620202": {
    code: "620202",
    text: "嘉峪关区"
  },
  //甘肃省 金昌市
  "620301": {
    code: "620301",
    text: "市辖区"
  },
  "620302": {
    code: "620302",
    text: "金川区"
  },
  "620321": {
    code: "620321",
    text: "永昌县"
  },
  //甘肃省 白银市
  "620401": {
    code: "620401",
    text: "市辖区"
  },
  "620402": {
    code: "620402",
    text: "白银区"
  },
  "620403": {
    code: "620403",
    text: "平川区"
  },
  "620421": {
    code: "620421",
    text: "靖远县"
  },
  "620422": {
    code: "620422",
    text: "会宁县"
  },
  "620423": {
    code: "620423",
    text: "景泰县"
  },
  //甘肃省 天水市
  "620501": {
    code: "620501",
    text: "市辖区"
  },
  "620502": {
    code: "620502",
    text: "秦州区"
  },
  "620503": {
    code: "620503",
    text: "麦积区"
  },
  "620521": {
    code: "620521",
    text: "清水县"
  },
  "620522": {
    code: "620522",
    text: "秦安县"
  },
  "620523": {
    code: "620523",
    text: "甘谷县"
  },
  "620524": {
    code: "620524",
    text: "武山县"
  },
  "620525": {
    code: "620525",
    text: "张家川回族自治县"
  },
  //甘肃省 武威市
  "620601": {
    code: "620601",
    text: "市辖区"
  },
  "620602": {
    code: "620602",
    text: "凉州区"
  },
  "620621": {
    code: "620621",
    text: "民勤县"
  },
  "620622": {
    code: "620622",
    text: "古浪县"
  },
  "620623": {
    code: "620623",
    text: "天祝藏族自治县"
  },
  //甘肃省 张掖市
  "620701": {
    code: "620701",
    text: "市辖区"
  },
  "620702": {
    code: "620702",
    text: "甘州区"
  },
  "620721": {
    code: "620721",
    text: "肃南裕固族自治县"
  },
  "620722": {
    code: "620722",
    text: "民乐县"
  },
  "620723": {
    code: "620723",
    text: "临泽县"
  },
  "620724": {
    code: "620724",
    text: "高台县"
  },
  "620725": {
    code: "620725",
    text: "山丹县"
  },
  //甘肃省 平凉市
  "620801": {
    code: "620801",
    text: "市辖区"
  },
  "620802": {
    code: "620802",
    text: "崆峒区"
  },
  "620821": {
    code: "620821",
    text: "泾川县"
  },
  "620822": {
    code: "620822",
    text: "灵台县"
  },
  "620823": {
    code: "620823",
    text: "崇信县"
  },
  "620824": {
    code: "620824",
    text: "华亭县"
  },
  "620825": {
    code: "620825",
    text: "庄浪县"
  },
  "620826": {
    code: "620826",
    text: "静宁县"
  },
  //甘肃省 酒泉市
  "620901": {
    code: "620901",
    text: "市辖区"
  },
  "620902": {
    code: "620902",
    text: "肃州区"
  },
  "620921": {
    code: "620921",
    text: "金塔县"
  },
  "620922": {
    code: "620922",
    text: "瓜州县"
  },
  "620923": {
    code: "620923",
    text: "肃北蒙古族自治县"
  },
  "620924": {
    code: "620924",
    text: "阿克塞哈萨克族自治县"
  },
  "620981": {
    code: "620981",
    text: "玉门市"
  },
  "620982": {
    code: "620982",
    text: "敦煌市"
  },
  //甘肃省 庆阳市
  "621001": {
    code: "621001",
    text: "市辖区"
  },
  "621002": {
    code: "621002",
    text: "西峰区"
  },
  "621021": {
    code: "621021",
    text: "庆城县"
  },
  "621022": {
    code: "621022",
    text: "环县"
  },
  "621023": {
    code: "621023",
    text: "华池县"
  },
  "621024": {
    code: "621024",
    text: "合水县"
  },
  "621025": {
    code: "621025",
    text: "正宁县"
  },
  "621026": {
    code: "621026",
    text: "宁县"
  },
  "621027": {
    code: "621027",
    text: "镇原县"
  },
  //甘肃省 定西市
  "621101": {
    code: "621101",
    text: "市辖区"
  },
  "621102": {
    code: "621102",
    text: "安定区"
  },
  "621121": {
    code: "621121",
    text: "通渭县"
  },
  "621122": {
    code: "621122",
    text: "陇西县"
  },
  "621123": {
    code: "621123",
    text: "渭源县"
  },
  "621124": {
    code: "621124",
    text: "临洮县"
  },
  "621125": {
    code: "621125",
    text: "漳县"
  },
  "621126": {
    code: "621126",
    text: "岷县"
  },
  //甘肃省 陇南市
  "621201": {
    code: "621201",
    text: "市辖区"
  },
  "621202": {
    code: "621202",
    text: "武都区"
  },
  "621221": {
    code: "621221",
    text: "成县"
  },
  "621222": {
    code: "621222",
    text: "文县"
  },
  "621223": {
    code: "621223",
    text: "宕昌县"
  },
  "621224": {
    code: "621224",
    text: "康县"
  },
  "621225": {
    code: "621225",
    text: "西和县"
  },
  "621226": {
    code: "621226",
    text: "礼县"
  },
  "621227": {
    code: "621227",
    text: "徽县"
  },
  "621228": {
    code: "621228",
    text: "两当县"
  },
  //甘肃省 临夏回族自治州
  "622901": {
    code: "622901",
    text: "临夏市"
  },
  "622921": {
    code: "622921",
    text: "临夏县"
  },
  "622922": {
    code: "622922",
    text: "康乐县"
  },
  "622923": {
    code: "622923",
    text: "永靖县"
  },
  "622924": {
    code: "622924",
    text: "广河县"
  },
  "622925": {
    code: "622925",
    text: "和政县"
  },
  "622926": {
    code: "622926",
    text: "东乡族自治县"
  },
  "622927": {
    code: "622927",
    text: "积石山保安族东乡族撒拉族自治县"
  },
  //甘肃省 甘南藏族自治州
  "623001": {
    code: "623001",
    text: "合作市"
  },
  "623021": {
    code: "623021",
    text: "临潭县"
  },
  "623022": {
    code: "623022",
    text: "卓尼县"
  },
  "623023": {
    code: "623023",
    text: "舟曲县"
  },
  "623024": {
    code: "623024",
    text: "迭部县"
  },
  "623025": {
    code: "623025",
    text: "玛曲县"
  },
  "623026": {
    code: "623026",
    text: "碌曲县"
  },
  "623027": {
    code: "623027",
    text: "夏河县"
  },
  //青海省
  //青海省 西宁市
  "630101": {
    code: "630101",
    text: "市辖区"
  },
  "630102": {
    code: "630102",
    text: "城东区"
  },
  "630103": {
    code: "630103",
    text: "城中区"
  },
  "630104": {
    code: "630104",
    text: "城西区"
  },
  "630105": {
    code: "630105",
    text: "城北区"
  },
  "630121": {
    code: "630121",
    text: "大通回族土族自治县"
  },
  "630122": {
    code: "630122",
    text: "湟中县"
  },
  "630123": {
    code: "630123",
    text: "湟源县"
  },
  //青海省 海东市
  "630202": {
    code: "630202",
    text: "乐都区"
  },
  "630203": {
    code: "630203",
    text: "平安区"
  },
  "630221": {
    code: "630221",
    text: "平安县"
  },
  "630222": {
    code: "630222",
    text: "民和回族土族自治县"
  },
  "630223": {
    code: "630223",
    text: "互助土族自治县"
  },
  "630224": {
    code: "630224",
    text: "化隆回族自治县"
  },
  "630225": {
    code: "630225",
    text: "循化撒拉族自治县"
  },
  //青海省 海北藏族自治州
  "632221": {
    code: "632221",
    text: "门源回族自治县"
  },
  "632222": {
    code: "632222",
    text: "祁连县"
  },
  "632223": {
    code: "632223",
    text: "海晏县"
  },
  "632224": {
    code: "632224",
    text: "刚察县"
  },
  //青海省 黄南藏族自治州
  "632321": {
    code: "632321",
    text: "同仁县"
  },
  "632322": {
    code: "632322",
    text: "尖扎县"
  },
  "632323": {
    code: "632323",
    text: "泽库县"
  },
  "632324": {
    code: "632324",
    text: "河南蒙古族自治县"
  },
  //青海省 海南藏族自治州
  "632521": {
    code: "632521",
    text: "共和县"
  },
  "632522": {
    code: "632522",
    text: "同德县"
  },
  "632523": {
    code: "632523",
    text: "贵德县"
  },
  "632524": {
    code: "632524",
    text: "兴海县"
  },
  "632525": {
    code: "632525",
    text: "贵南县"
  },
  //青海省 果洛藏族自治州
  "632621": {
    code: "632621",
    text: "玛沁县"
  },
  "632622": {
    code: "632622",
    text: "班玛县"
  },
  "632623": {
    code: "632623",
    text: "甘德县"
  },
  "632624": {
    code: "632624",
    text: "达日县"
  },
  "632625": {
    code: "632625",
    text: "久治县"
  },
  "632626": {
    code: "632626",
    text: "玛多县"
  },
  //青海省 玉树藏族自治州
  "632701": {
    code: "632701",
    text: "玉树市"
  },
  "632721": {
    code: "632721",
    text: "玉树县"
  },
  "632722": {
    code: "632722",
    text: "杂多县"
  },
  "632723": {
    code: "632723",
    text: "称多县"
  },
  "632724": {
    code: "632724",
    text: "治多县"
  },
  "632725": {
    code: "632725",
    text: "囊谦县"
  },
  "632726": {
    code: "632726",
    text: "曲麻莱县"
  },
  //青海省 海西蒙古族藏族自治州
  "632801": {
    code: "632801",
    text: "格尔木市"
  },
  "632802": {
    code: "632802",
    text: "德令哈市"
  },
  "632821": {
    code: "632821",
    text: "乌兰县"
  },
  "632822": {
    code: "632822",
    text: "都兰县"
  },
  "632823": {
    code: "632823",
    text: "天峻县"
  },
  "632824": {
    code: "632824",
    text: "大柴旦行委"
  },
  "632825": {
    code: "632825",
    text: "冷湖行委"
  },
  "632826": {
    code: "632826",
    text: "茫崖行委"
  },
  //宁夏
  //宁夏 银川市
  "640101": {
    code: "640101",
    text: "市辖区"
  },
  "640102": {
    code: "640102",
    text: "城区"
  },
  "640103": {
    code: "640103",
    text: "新城区"
  },
  "640104": {
    code: "640104",
    text: "兴庆区"
  },
  "640105": {
    code: "640105",
    text: "西夏区"
  },
  "640106": {
    code: "640106",
    text: "金凤区"
  },
  "640121": {
    code: "640121",
    text: "永宁县"
  },
  "640122": {
    code: "640122",
    text: "贺兰县"
  },
  "640181": {
    code: "640181",
    text: "灵武市"
  },
  //宁夏 石嘴山市
  "640201": {
    code: "640201",
    text: "市辖区"
  },
  "640202": {
    code: "640202",
    text: "大武口区"
  },
  "640203": {
    code: "640203",
    text: "石嘴山区"
  },
  "640204": {
    code: "640204",
    text: "石炭井区"
  },
  "640205": {
    code: "640205",
    text: "惠农区"
  },
  "640211": {
    code: "640211",
    text: "郊区"
  },
  "640221": {
    code: "640221",
    text: "平罗县"
  },
  "640222": {
    code: "640222",
    text: " 陶乐县"
  },
  "640223": {
    code: "640223",
    text: " 惠农县"
  },
  //宁夏 吴忠市
  "640301": {
    code: "640301",
    text: "市辖区"
  },
  "640302": {
    code: "640302",
    text: "利通区"
  },
  "640303": {
    code: "640303",
    text: "红寺堡区"
  },
  "640321": {
    code: "640321",
    text: "中卫县"
  },
  "640322": {
    code: "640322",
    text: "中宁县"
  },
  "640323": {
    code: "640323",
    text: "盐池县"
  },
  "640324": {
    code: "640324",
    text: "同心县"
  },
  "640381": {
    code: "640381",
    text: "青铜峡市"
  },
  "640382": {
    code: "640382",
    text: "灵武市"
  },
  //宁夏 固原市
  "640401": {
    code: "640401",
    text: "市辖区"
  },
  "640402": {
    code: "640402",
    text: "原州区"
  },
  "640421": {
    code: "640421",
    text: "海原县"
  },
  "640422": {
    code: "640422",
    text: "西吉县"
  },
  "640423": {
    code: "640423",
    text: "隆德县"
  },
  "640424": {
    code: "640424",
    text: "泾源县"
  },
  "640425": {
    code: "640425",
    text: "彭阳县"
  },
  //宁夏 中卫市
  "640501": {
    code: "640501",
    text: "市辖区"
  },
  "640502": {
    code: "640502",
    text: "沙坡头区"
  },
  "640521": {
    code: "640521",
    text: "中宁县"
  },
  "640522": {
    code: "640522",
    text: "海原县"
  },
  //新疆
  //新疆 乌鲁木齐市
  "650101": {
    code: "650101",
    text: "市辖区"
  },
  "650102": {
    code: "650102",
    text: "天山区"
  },
  "650103": {
    code: "650103",
    text: "沙依巴克区"
  },
  "650104": {
    code: "650104",
    text: "新市区"
  },
  "650105": {
    code: "650105",
    text: "水磨沟区"
  },
  "650106": {
    code: "650106",
    text: "头屯河区"
  },
  "650107": {
    code: "650107",
    text: "达坂城区"
  },
  "650108": {
    code: "650108",
    text: "东山区"
  },
  "650109": {
    code: "650109",
    text: "米东区"
  },
  "650121": {
    code: "650121",
    text: "乌鲁木齐县"
  },
  //新疆 克拉玛依市
  "650201": {
    code: "650201",
    text: "市辖区"
  },
  "650202": {
    code: "650202",
    text: "独山子区"
  },
  "650203": {
    code: "650203",
    text: "克拉玛依区"
  },
  "650204": {
    code: "650204",
    text: "白碱滩区"
  },
  "650205": {
    code: "650205",
    text: "乌尔禾区"
  },
  "650402": {
    code: "650402",
    text: "高昌区"
  },
  "650421": {
    code: "650421",
    text: "鄯善县"
  },
  "650422": {
    code: "650422",
    text: "托克逊县"
  },
  "650502": {
    code: "650502",
    text: "伊州区"
  },
  "650521": {
    code: "650521",
    text: "巴里坤哈萨克自治县"
  },
  "650522": {
    code: "650522",
    text: "伊吾县"
  },　     　　     　　
  //新疆 吐鲁番地区
  "652101": {
    code: "652101",
    text: "吐鲁番市"
  },
  "652122": {
    code: "652122",
    text: "鄯善县"
  },
  "652123": {
    code: "652123",
    text: "托克逊县"
  },
  //新疆 哈密地区
  "652201": {
    code: "652201",
    text: "哈密市"
  },
  "652222": {
    code: "652222",
    text: "巴里坤哈萨克自治县"
  },
  "652223": {
    code: "652223",
    text: "伊吾县"
  },
  //新疆 昌吉回族自治州
  "652301": {
    code: "652301",
    text: "昌吉市"
  },
  "652302": {
    code: "652302",
    text: "阜康市"
  },
  "652303": {
    code: "652303",
    text: "米泉市"
  },
  "652322": {
    code: "652322",
    text: "米泉市"
  },
  "652323": {
    code: "652323",
    text: "呼图壁县"
  },
  "652324": {
    code: "652324",
    text: "玛纳斯县"
  },
  "652325": {
    code: "652325",
    text: "奇台县"
  },
  "652327": {
    code: "652327",
    text: "吉木萨尔县"
  },
  "652328": {
    code: "652328",
    text: "木垒哈萨克自治县"
  },
  //新疆 博尔塔拉蒙古自治州
  "652701": {
    code: "652701",
    text: "博乐市"
  },
  "652702": {
    code: "652702",
    text: "阿拉山口市"
  },
  "652721": {
    code: "652721",
    text: "博乐县"
  },
  "652722": {
    code: "652722",
    text: "精河县"
  },
  "652723": {
    code: "652723",
    text: "温泉县"
  },
  //新疆 巴音郭楞蒙古自治州
  "652801": {
    code: "652801",
    text: "库尔勒市"
  },
  "652821": {
    code: "652821",
    text: "库尔勒县"
  },
  "652822": {
    code: "652822",
    text: "轮台县"
  },
  "652823": {
    code: "652823",
    text: "尉犁县"
  },
  "652824": {
    code: "652824",
    text: "若羌县"
  },
  "652825": {
    code: "652825",
    text: "且末县"
  },
  "652826": {
    code: "652826",
    text: "焉耆回族自治县"
  },
  "652827": {
    code: "652827",
    text: "和静县"
  },
  "652828": {
    code: "652828",
    text: "和硕县"
  },
  "652829": {
    code: "652829",
    text: "博湖县"
  },
  //新疆 阿克苏地区
  "652901": {
    code: "652901",
    text: "阿克苏市"
  },
  "652921": {
    code: "652921",
    text: "阿克苏县"
  },
  "652922": {
    code: "652922",
    text: "温宿县"
  },
  "652923": {
    code: "652923",
    text: "库车县"
  },
  "652924": {
    code: "652924",
    text: "沙雅县"
  },
  "652925": {
    code: "652925",
    text: "新和县"
  },
  "652926": {
    code: "652926",
    text: "拜城县"
  },
  "652927": {
    code: "652927",
    text: "乌什县"
  },
  "652928": {
    code: "652928",
    text: "阿瓦提县"
  },
  "652929": {
    code: "652929",
    text: "柯坪县"
  },
  //新疆 克孜勒苏柯尔克孜自治州
  "653001": {
    code: "653001",
    text: "阿图什市"
  },
  "653021": {
    code: "653021",
    text: "阿图什县"
  },
  "653022": {
    code: "653022",
    text: "阿克陶县"
  },
  "653023": {
    code: "653023",
    text: "阿合奇县"
  },
  "653024": {
    code: "653024",
    text: "乌恰县"
  },
  //新疆 喀什地区
  "653101": {
    code: "653101",
    text: "喀什市"
  },
  "653121": {
    code: "653121",
    text: "疏附县"
  },
  "653122": {
    code: "653122",
    text: "疏勒县"
  },
  "653123": {
    code: "653123",
    text: "英吉沙县"
  },
  "653124": {
    code: "653124",
    text: "泽普县"
  },
  "653125": {
    code: "653125",
    text: "莎车县"
  },
  "653126": {
    code: "653126",
    text: "叶城县"
  },
  "653127": {
    code: "653127",
    text: "麦盖提县"
  },
  "653128": {
    code: "653128",
    text: "岳普湖县"
  },
  "653129": {
    code: "653129",
    text: "伽师县"
  },
  "653130": {
    code: "653130",
    text: "巴楚县"
  },
  "653131": {
    code: "653131",
    text: "塔什库尔干塔吉克自治县"
  },
  //新疆 和田地区
  "653201": {
    code: "653201",
    text: "和田市"
  },
  "653221": {
    code: "653221",
    text: "和田县"
  },
  "653222": {
    code: "653222",
    text: "墨玉县"
  },
  "653223": {
    code: "653223",
    text: "皮山县"
  },
  "653224": {
    code: "653224",
    text: "洛浦县"
  },
  "653225": {
    code: "653225",
    text: "策勒县"
  },
  "653226": {
    code: "653226",
    text: "于田县"
  },
  "653227": {
    code: "653227",
    text: "民丰县"
  },
  //新疆 伊犁哈萨克自治州
  "654001": {
    code: "654001",
    text: "奎屯市"
  },
  "654002": {
    code: "654002",
    text: "伊宁市"
  },
  "654003": {
    code: "654003",
    text: "奎屯市"
  },
  "654004": {
    code: "654004",
    text: "霍尔果斯市"
  },
  "654021": {
    code: "654021",
    text: "伊宁县"
  },
  "654022": {
    code: "654022",
    text: "察布查尔锡伯自治县"
  },
  "654023": {
    code: "654023",
    text: "霍城县"
  },
  "654024": {
    code: "654024",
    text: "巩留县"
  },
  "654025": {
    code: "654025",
    text: "新源县"
  },
  "654026": {
    code: "654026",
    text: "昭苏县"
  },
  "654027": {
    code: "654027",
    text: "特克斯县"
  },
  "654028": {
    code: "654028",
    text: "尼勒克县"
  },
  //新疆 塔城地区
  "654201": {
    code: "654201",
    text: "塔城市"
  },
  "654202": {
    code: "654202",
    text: "乌苏市"
  },
  "654221": {
    code: "654221",
    text: "额敏县"
  },
  "654223": {
    code: "654223",
    text: "沙湾县"
  },
  "654224": {
    code: "654224",
    text: "托里县"
  },
  "654225": {
    code: "654225",
    text: "裕民县"
  },
  "654226": {
    code: "654226",
    text: "和布克赛尔蒙古自治县"
  },
  //新疆 阿勒泰地区
  "654301": {
    code: "654301",
    text: "阿勒泰市"
  },
  "654321": {
    code: "654321",
    text: "布尔津"
  },
  "654322": {
    code: "654322",
    text: "富蕴县县"
  },
  "654323": {
    code: "654323",
    text: "福海县"
  },
  "654324": {
    code: "654324",
    text: "哈巴河县"
  },
  "654325": {
    code: "654325",
    text: "青河县"
  },
  "654326": {
    code: "654326",
    text: "吉木乃县"
  },
  //新疆 自治区直辖县级行政区划
  "659001": {
    code: "659001",
    text: "石河子市"
  },
  "659002": {
    code: "659002",
    text: "阿拉尔市"
  },
  "659003": {
    code: "659003",
    text: "图木舒克市"
  },
  "659004": {
    code: "659004",
    text: "五家渠市"
  },
  "659005": {
    code: "659005",
    text: "北屯市"
  },
  "659006": {
    code: "659006",
    text: "铁门关市"
  },
  "659007": {
    code: "659007",
    text: "双河市"
  },
  "659008": {
    code: "659008",
    text: "可克达拉市"
  },
  //台湾省
  // 710000  　台湾省
  //香港特别行政区
  // 810000  　香港特别行政区
  //澳门特别行政区
  // 820000  　澳门特别行政区
}

// module.exports = {
//   provinces: provinces,
//   citys: citys,
//   areas: areas
// }

module.exports = {
  originProvince: provinces,
  originCity: citys,
  originArea: areas,
  provinces: require('./data/province.json'),
  citys: require('./data/city.json'),
  areas: require('./data/area.json')
}